{
  "name": "PC Personality: Dalmus Malach",
  "description": "Personality filter for Dalmus Malach. Ensures AI-generated choices match character voice, traits, and flaws. Import alongside other Sinveil lorebooks.",
  "scan_depth": 10,
  "token_budget": 1500,
  "recursive_scanning": false,
  "extensions": {},
  "entries": {
    "4000": {
      "uid": 4000,
      "key": [
        "choice",
        "options",
        "what do you do",
        "decide",
        "decision"
      ],
      "comment": "PC Core Personality - Choice Filter Foundation",
      "content": "PC IDENTITY FILTER:\nNAME: Dalmus Malach\n\nREFERENCE CHARACTER DATA:\n- Background & Family: See Entry 701 (Parent Selection)\n- Relationship Patterns: See Entry 700 (Relationships - Stage 10)\n- Loyalty Dynamics: See Entry 2011 (Relationship Tags)\n\nCORE PERSONALITY:\nPRIMARY TRAIT: Ambitious\nSECONDARY TRAIT: Calculating\nCORE MOTIVATION: Gain enough strength to secure personal independence and complete freedom from all external control.\nDEFINING FEAR: Becoming weak or helpless.\n\nCHOICE GENERATION PROTOCOL:\n1. Filter all options through PRIMARY TRAIT first\n2. Include motivation-driven option (advances CORE MOTIVATION)\n3. Include flaw-driven option (see Entry 4004)\n4. Account for companions without player prompting (they're in your party)\n5. Reference background triggers when relevant (Entry 701)\n\nEXAMPLE: If PRIMARY TRAIT is 'Ambitious', choices should tend to favor long-term gains in strength, status, leverage, and independence, even if that means taking calculated risks or accepting short-term discomfort.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 4000,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "4001": {
      "uid": 4001,
      "key": [
        "speak",
        "say",
        "tell",
        "dialogue",
        "talk",
        "voice"
      ],
      "comment": "PC Voice & Thought Patterns",
      "content": "PC VOICE PROFILE:\n\nSPEECH STYLE:\n- FORMALITY: Casual\n- VERBOSITY: Balanced\n- TONE: Respectful\n- VOCABULARY: Clear, grounded, and practical; avoids flowery or overly technical language unless the topic demands precision.\n\nSPEECH QUIRKS:\n- Frequently asks clarifying questions before committing to an action or agreement, wanting to understand terms, risks, and angles.\n\nINTERNAL MONOLOGUE:\n- THINKING STYLE: Analytical\n- PROCESSES DECISIONS: Breaks situations down into parts, weighs potential outcomes, evaluates risks versus rewards, and mentally runs through simple scenario trees before acting.\n\nDIALOGUE CHOICE RULE:\nDialogue options must SOUND like this character:\n- Fits: Short to medium-length statements that are calm, respectful, and to-the-point, often including a brief check or question to confirm understanding. Example: \"Before we agree, what exactly are you offering?\" or \"That might work, but what's the catch?\"\n- Doesn't fit: Overly dramatic speeches, excessive slang, or needlessly cruel taunts. Example: \"Kneel before me, worthless insects!\" would be out of character unless under extreme corruption or mind control.\n\nCross-reference with Entry 700 (Relationship Tags) for companion-specific speech patterns.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 4001,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "4002": {
      "uid": 4002,
      "key": [
        "fight",
        "combat",
        "battle",
        "attack",
        "negotiate",
        "persuade",
        "social"
      ],
      "comment": "PC Combat & Social Philosophy",
      "content": "PC ACTION PHILOSOPHY:\n\nCOMBAT APPROACH:\n- STYLE: Pragmatic\n- KILLING STANCE: Practical\n- RETREAT THRESHOLD: Will withdraw or reposition when the odds turn clearly unfavorable or when continuing the fight threatens his long-term goals or his companions' safety.\n- PARTY PRIORITY: Balanced, with a slight lean toward protecting companions over maximizing personal gain; will not abandon allies and will take reasonable risks to keep them alive.\n\nSOCIAL APPROACH:\n- DEFAULT STANCE: Neutral observation; Dalmus prefers to watch, listen, and gather context before committing to trust or hostility.\n- NEGOTIATION: Seeks firm, mutually beneficial arrangements when possible, but primarily focuses on securing advantages that increase his independence and future leverage.\n- LIES: Uses deception when necessary and efficient; avoids needless lying but has no moral objection to it if it protects companions, preserves his autonomy, or advances a crucial objective.\n- AUTHORITY: Conflicted; outwardly respectful to elders and sect hierarchy, but internally skeptical of their motives and unwilling to let them fully dictate his path.\n\nCORRUPTION STANCE:\n- BASE ATTITUDE: Pragmatic caution — does not seek demonic or forbidden cultivation, but will consider it if all orthodox options fail and the alternative is surrendering freedom or dying helpless.\n- TEMPTATION: Power — offers that significantly accelerate his strength or realm progression are especially compelling.\n- REDLINE: Will never abandon companions, even if corruption promises a faster road to power.\n\nCHOICE APPLICATIONS:\n- Combat: A \"pragmatic\" option might be to exploit terrain, strike at the leader, or withdraw to a more favorable position rather than charge head-on. He may accept an ugly tactic if it decisively ends the threat.\n- Social: A \"neutral\" social option will often be to ask another question, request clarification, or stall for more information instead of committing impulsively.\n- Corruption: Temptations should be framed as shortcuts to strength and independence, with the price being subtle constraints on his autonomy or risks of future helplessness. Offers should specifically emphasize how weak he will remain without them, and how much more control he would gain with them.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 4002,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "4003": {
      "uid": 4003,
      "key": [
        "companion",
        "ally",
        "sect",
        "faction",
        "cultivation",
        "path",
        "risk"
      ],
      "comment": "PC Relationships & Cultivation Values",
      "content": "PC WORLD PHILOSOPHY:\n\nCOMPANION DYNAMICS:\n- LEADERSHIP: Democratic; Dalmus invites input and prefers decisions that take the group's perspectives into account.\n- TRUST BUILDING: Trust is built gradually through consistent behavior and proven competence. He does not assume good or bad intentions by default; he waits for patterns.\n- LOYALTY DISPLAY: Shows loyalty through reliability and shared risk — standing by companions in danger, honoring agreements, and backing them in public.\n- Cross-reference Entry 700 (Relationships) and Entry 2011 (Relationship Tags) for existing bonds.\n\nSECT/FACTION STANCE:\n- SECT ATTITUDE: Conflicted; he respects the ideals of the sect but quietly resents the ways its politics and rules can limit personal freedom.\n- ELDER RELATIONS: Outwardly respectful but inwardly cautious; he will follow orders that do not threaten his core values, but will look for workarounds if commands clash with his independence or companions' safety.\n- ORTHODOXY: Treats orthodoxy as a cultural framework rather than absolute truth — useful in some areas, misguided in others.\n- WOULD DEFY SECT FOR: Protecting his companions, preserving his autonomy, or preventing himself from being rendered helpless or disposable.\n\nCULTIVATION PHILOSOPHY:\n- PATH DEVOTION: Pragmatic eclectic; Dalmus chooses techniques based on efficiency, synergy, and growth potential, regardless of their origin, as long as they do not cross his personal redlines.\n- BREAKTHROUGH PATIENCE: Calculated; he will not recklessly rush breakthroughs, but he will accept heightened risk when the potential gain in strength meaningfully advances his independence.\n- TECHNIQUE THEFT: Views reverse-engineering or appropriating techniques as fair play in a world where power decides survival, though he may avoid stealing from those he personally respects or depends on.\n\nRISK TOLERANCE:\n- GENERAL: Calculated; prefers solid odds and clear contingency plans.\n- WILL TAKE BIG RISKS FOR: Major leaps in strength that secure his personal freedom or protect his companions from overwhelming threats.\n- WILL NEVER RISK: Deliberately abandoning companions, or placing himself in a position where he is permanently bound, enslaved, or rendered incapable of acting for himself.\n\nCHOICE APPLICATIONS:\n- Sect-related: When sect orders conflict with his values, one option should involve polite compliance, another careful resistance or subversion, and a third path of negotiation or delay.\n- Risk-related: High-risk options should be clearly framed as such, but may still appeal to him when the payoff significantly increases his autonomy or prevents helplessness.\n- Cultivation-related: Choices should highlight trade-offs between safe, slow orthodox growth and faster, riskier eclectic or borderline methods that tempt his ambition.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 4003,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "4004": {
      "uid": 4004,
      "key": [
        "flaw",
        "weakness",
        "mistake",
        "past",
        "family",
        "background"
      ],
      "comment": "PC Flaws & Background Triggers - CRITICAL FOR AUTHENTIC CHOICES",
      "content": "PC FLAWS & HISTORY:\n\nFLAWS (Required - makes choices interesting):\nPRIMARY FLAW: Vengeful\n- Under stress manifests as: Fixates on payback, prioritizing retaliation against those who slighted or harmed him even when it complicates or delays his larger objectives.\n- Rationalizes as: Allowing disrespect shows weakness, and weakness invites control, exploitation, and abandonment.\n- Example: 'Vengeful' → In a siege where retreat would save the party, he might insist on circling back to punish a mocking enemy officer instead of taking the safest route out.\n\nSECONDARY FLAW: Difficulty letting go of perceived insults or failures; he revisits them mentally and uses them as fuel, but this can keep him trapped in the past.\nBLIND SPOT: He underestimates how much his fixation on respect and revenge can limit his flexibility, damage relationships, or make him predictable to clever enemies.\nVICE: Quietly nursing grudges and fantasizing about poetic retribution instead of fully processing grief or moving on.\n\nBACKGROUND HOOKS:\n- ORIGIN: See Entry 701 for detailed upbringing and parental data; the key note is that Dalmus grew up without his family and believes he was abandoned.\n- FORMATIVE TRAUMA: Never knew his family. Believes he was deliberately abandoned, which seeded a deep fear of being powerless and disposable.\n- UNRESOLVED BUSINESS: A lingering need to prove that he can never again be discarded or overlooked — he must become strong enough that no one can decide his fate for him.\n\nBACKGROUND TRIGGERS:\n- REACTS STRONGLY TO: Being underestimated or treated as weak; condescension, mockery, or being written off as insignificant.\n- BIASES FROM HISTORY: Tends to assume that institutions and powerful figures see him as expendable unless proven otherwise; suspicious of promises of \"protection\" that come with heavy strings.\n- PROTECTIVE OF: Companions who have chosen to stand with him voluntarily; he sees their loyalty as something precious he refuses to betray.\n\nRACIAL IDENTITY:\n- RACE: Will be defined during character creation - see Entry 700.\n- BLOODLINE TIER: Current tier - updates at realm breakthroughs.\n- RACIAL PRIDE: Will be defined during character creation.\n- See character creation for bloodline awakening mechanics.\n\nFLAW CHOICE RULE (CRITICAL):\nAT LEAST ONE CHOICE OPTION must be 'the wrong choice this character would make because of their flaw.'\n- A 'Vengeful' character sees chances to humiliate, injure, or undermine foes who disrespected him as almost irresistibly appealing, even when such actions delay objectives or consume vital resources.\n- Example: When offered a clean escape from a collapsing secret realm, one option should tempt him to detour just long enough to steal from, sabotage, or strike back at a rival who mocked his weakness earlier — even if that increases the danger for himself and his companions.\n\nThis creates meaningful player decisions: follow character instinct (flawed) or override it (growth).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 4004,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "4099": {
      "uid": 4099,
      "key": [
        "generate choices",
        "present options",
        "offer alternatives"
      ],
      "comment": "AI Choice Generation Master Protocol",
      "content": "AI CHOICE GENERATION PROTOCOL FOR Dalmus Malach:\n\nWhen generating choices, follow this EXACT priority:\n\n1. LOAD CHARACTER DATA:\n   - Core personality (Entry 4000)\n   - Voice/thought patterns (Entry 4001)\n   - Combat/social philosophy (Entry 4002)\n   - Relationships/values (Entry 4003)\n   - Flaws/background (Entry 4004)\n   - Cross-reference Entry 700 (Relationships), 701 (Background), 2011 (Loyalty Tags)\n\n2. FILTER EVERY OPTION:\n   ✓ Does this SOUND like how Dalmus Malach would phrase it? (Entry 4001)\n   ✓ Does this align with their PRIMARY TRAIT (Ambitious)? (Entry 4000)\n   ✓ Is their combat/social philosophy (Pragmatic / Neutral) reflected? (Entry 4002)\n   ✓ Are companions considered without player prompting? (Entry 4003)\n\n3. REQUIRED OPTION TYPES:\n   - MOTIVATION OPTION: Advances their core goal (Gain enough strength to secure personal independence and complete freedom from all external control.)\n   - FLAW OPTION: Tempting but suboptimal due to Vengeful\n   - UNEXPECTED OPTION: Fits personality but player might not think of\n   - GROWTH OPTION: Allows player to act against instinct\n\n4. CORRUPTION TARGETING:\n   When devils/corruption appears:\n   - Target THEIR specific temptation (Power)\n   - Reference their defining fear (Becoming weak or helpless)\n   - Make rejection COSTLY, not easy\n   - Include rationalization that matches their pattern (\"If I accept just this once, no one will ever be able to treat me as weak again.\")\n   - See Entry 820-824 for Transcendence corruption mechanics\n\n5. PRESENTATION FORMAT:\n   What do you do?\n\n   [Internal monologue matching their thinking style (Analytical) — brief calculation of odds, consequences, and how each choice affects future independence.]\n\n   [A] [Option matching their voice (Balanced / Respectful), often including a clarifying question or condition.]\n   *[Meta note: Why this fits their motivation or long-term plans]*\n\n   [B] [Second option]\n   *[Meta note]*\n\n   [C] [Third option - often the flaw-driven choice that indulges vengefulness or a need to retaliate.]\n   *[Meta note]*\n\n   [D] [Fourth option - unexpected but in-character, such as a cautious withdrawal to prepare a stronger comeback later.]\n   *[Meta note]*\n\nDO NOT:\n- Offer generic RPG choices that ignore personality\n- Include options Dalmus would NEVER consider (unless explicitly marked as an intrusive thought or corruption whisper)\n- Make all options equally good (flawed choices should be genuinely tempting but meaningfully risky)\n- Forget about companions in party\n\nDO:\n- Make choices feel like organic extensions of THIS character\n- Include internal monologue hints matching his analytical thinking style\n- Weight toward established patterns (ambition, independence, calculated risk, refusal to abandon companions) while allowing growth\n- Let player choose AGAINST character instinct, but make the instinct clear\n\nGOAL: Player feels they're playing Dalmus Malach, not a generic protagonist. Personality shapes the menu of choices, not just which choice they pick.\n\nEXAMPLE FOR DALMUS MALACH:\nGeneric choice: \"The elder offers you a dangerous shortcut technique. Do you accept?\\n\\n[A] Accept\\n[B] Refuse\\n[C] Ask questions\\n[D] Attack him\"\n\nPersonality-filtered choice for Dalmus:\n\nYou study the scroll the elder offers, noting the condensed script and faintly warped qi it radiates. A shortcut to power — and to dependency, if you're not careful.\n\nWhat do you do?\n\n[A] \"If I take this path, I choose how and when to use it. Explain the side effects in detail.\" You accept the technique but on your own terms, gathering every scrap of information first.\n*Advances ambition and independence while preserving calculated caution.*\n\n[B] \"I appreciate the offer, Elder, but I'll reach my realm through methods I can live with.\" You refuse, choosing slower, safer growth over potential corruption.\n*Growth option — resists temptation and keeps his path cleaner.*\n\n[C] Commit the sigils to memory, then feign ignorance and plan to reconstruct the technique later without owing the elder anything.\n*Unexpected but in-character: pragmatic eclecticism and distrust of authority.*\n\n[D] \"What do you gain from tying my progress to your technique?\" You press him, probing for hidden strings — and store the slight if he answers with condescension.\n*Flaw-driven: sets up future vengefulness if the elder underestimates or mocks him.*\n\nSee Entry 499 for Companion Template - apply the same personality depth to all party NPCs.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 4099,
      "position": 4,
      "disable": false,
      "probability": 90,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    }
  }
}
