{
  "entries": {
    "700": {
      "uid": 700,
      "key": [
        "Human cultivation",
        "human affinity",
        "human martial"
      ],
      "comment": "Humans - Adaptable Specialists",
      "content": "PATH AFFINITIES: Humans are unique cultivators with evolving path relationships.\n\nBRONZE REALM: -10% cultivation speed to ALL paths (learning fundamentals, generalists). Humans at Bronze are jacks-of-all-trades, sampling multiple paths before committing.\n\nIRON+ REALM: Once reaching Iron, human must commit to PRIMARY PATH. Primary path cultivation speed becomes normal (0% penalty). All other paths suffer -30% cultivation speed penalty (lost flexibility through specialization).\n\nCROSS-PATH PENALTIES (Iron+ Realm):\nHumans have unique cross-path mechanics that interact with bloodline tiers.\n\nEFFECTIVENESS PENALTY:\n* Mortal/Awakened/Noble/Ancient Bloodline: -30% (human racial overrides worse bloodline penalty)\n* Divine Bloodline: -25% (bloodline finally surpasses racial trait)\n* Primordial Bloodline: 0% (perfection, no penalty)\n\nSLOT COST PENALTY:\n* Mortal Bloodline: 1.5x slot cost (human racial, better than standard 2x Mortal penalty)\n* Awakened Bloodline: 1.5x slot cost (human racial overrides worse 1.8x bloodline penalty)\n* Noble Bloodline: 1.5x slot cost (human racial overrides worse 1.6x bloodline penalty)\n* Ancient Bloodline: 1.4x slot cost (bloodline surpasses racial)\n* Divine Bloodline: 1.2x slot cost (bloodline surpasses racial)\n* Primordial Bloodline: 1x slot cost (perfection, no penalty)\n\nRULE: Compare human racial penalty (-30% effectiveness, 1.5x slots) to bloodline penalty. Use whichever is LOWER (better). This represents human adaptability giving an edge at lower bloodline tiers, but pure bloodline power eventually surpassing racial traits at Ancient+ tiers.\n\nEXAMPLES:\n* Human Mortal at Iron: -30% effectiveness (much better than -75%), 1.5x slots (better than 2x)\n* Elf Mortal at Iron: -75% effectiveness, 2x slots (standard Mortal penalties)\n* Human Divine at Iron: -25% effectiveness (bloodline wins), 1.2x slots (bloodline wins)\n* Elf Divine at Iron: -25% effectiveness, 1.2x slots (same as human - bloodline equality)\n\nThis makes human Mortal/Awakened/Noble bloodlines significantly more versatile than other races at those tiers, representing humanity's adaptability. At Divine+ tiers, bloodline power becomes the dominant factor.\n\nCULTIVATION PHILOSOPHY: 'Humanity's strength is focus, not versatility.' Humans who try to master multiple paths after Iron realm are considered foolish. Most human cultivators are laser-focused specialists.\n\nMARTIAL MODIFICATIONS: Balanced fighters with no natural weapons but excellent adaptability. Quick learners of new martial techniques. No physical advantages or disadvantages.\n\nWEAPON PREFERENCES: All weapons equally viable. Humans favor swords for versatility but excel at any weapon they dedicate to.\n\nCOMBAT STYLE: Tactical and technique-focused. Humans win through skill perfection and strategic thinking rather than raw attributes.\n\nFAMOUS EXAMPLES: Balanced across all eight paths in roughly equal numbers.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 310,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "701": {
      "uid": 701,
      "key": [
        "Dwarf cultivation",
        "dwarf affinity",
        "dwarf martial"
      ],
      "comment": "Dwarves - Earth and Fire Masters",
      "content": "PATH AFFINITIES: Earth Path, Fire Path (forges). 0% penalty to affinity paths, -50% to all others. EXPLANATION: Dwarven connection to mountains and forges makes them natural Earth and Fire cultivators. Their dense bodies and stubborn nature align perfectly with these paths. MARTIAL MODIFICATIONS: Low center of gravity makes them extremely hard to knockdown or move. Enhanced durability and pain tolerance. Natural resistance to fire and heat. NATURAL WEAPONS: None, but incredible grip strength. WEAPON PREFERENCES: Axes, hammers, heavy weapons. Dwarven-forged weapons are legendary. COMBAT STYLE: Stand-and-deliver bruisers who tank damage and hit back harder. Favor power over speed. CULTIVATION NOTES: Dwarven Earth cultivators are nearly immovable. Dwarven Fire cultivators often work their forges while cultivating, combining crafting with advancement.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 311,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "702": {
      "uid": 702,
      "key": [
        "Elf cultivation",
        "elf affinity",
        "elf martial"
      ],
      "comment": "Elves - Light, Shadow, and Wind Masters",
      "content": "PATH AFFINITIES: Light Path, Shadow Path, Wind Path. 0% penalty to affinity paths, -40% to all others. EXPLANATION: Elven grace and long lifespans give them natural affinity for subtle, flowing paths. Their connection to nature and extremes (day/night) makes them masters of light, shadow, and wind. MARTIAL MODIFICATIONS: Enhanced reflexes and graceful movements. Superior archery (natural masters). Enhanced sensory perception. NATURAL WEAPONS: None. WEAPON PREFERENCES: Bows (legendary archers), light swords, rapiers, daggers. Elven weapons emphasize grace over power. COMBAT STYLE: Evasive and precise. Elves win through superior positioning and technique perfection. They rarely trade blows directly. CULTIVATION NOTES: Elven Light cultivators often become priests and healers. Elven Shadow cultivators make legendary assassins. Elven Wind cultivators are nearly impossible to pin down.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 312,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "703": {
      "uid": 703,
      "key": [
        "Felkin cultivation",
        "catfolk affinity",
        "felkin martial"
      ],
      "comment": "Felkin - Shadow and Wind Masters",
      "content": "PATH AFFINITIES: Shadow Path, Wind Path. 0% penalty to affinity paths, -45% to all others. EXPLANATION: Feline grace, natural stealth, and predatory instincts make Felkin exceptional Shadow and Wind cultivators. Their night vision and silent movement align perfectly with these paths. MARTIAL MODIFICATIONS: Superior reflexes and balance. Natural night vision. Silent movement (padded paws). Enhanced hearing and smell. Retractable claws provide natural weapons. NATURAL WEAPONS: Claws (slashing damage). WEAPON PREFERENCES: Daggers, short swords, clawed gauntlets. Light weapons that don't impede mobility. COMBAT STYLE: Ambush predators who strike from stealth then disengage. Favor hit-and-run tactics. Excel at pursuing fleeing targets. CULTIVATION NOTES: Felkin Shadow cultivators are legendary assassins - their natural stealth combined with shadow techniques makes them nearly undetectable. Felkin Wind cultivators are incredibly agile aerial combatants.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 313,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "704": {
      "uid": 704,
      "key": [
        "Lupari cultivation",
        "wolfkin affinity",
        "lupari martial"
      ],
      "comment": "Lupari - Body and Earth Masters",
      "content": "PATH AFFINITIES: Body Path, Earth Path. 0% penalty to affinity paths, -45% to all others. EXPLANATION: Lupari pack instincts, physical prowess, and connection to territory make them natural Body and Earth cultivators. Their pack hierarchy and endurance hunting style align with these paths. MARTIAL MODIFICATIONS: Enhanced strength and endurance. Superior sense of smell (can track by scent). Pack tactics bonus (stronger when fighting alongside pack members). Natural bite and claw weapons. NATURAL WEAPONS: Claws and fangs (piercing/slashing). WEAPON PREFERENCES: Spears, axes, weapons that work well in pack formations. Many eschew weapons entirely. COMBAT STYLE: Pack hunters who coordinate attacks and wear down prey. Excel at sustained combat and group tactics. Alpha Lupari can command lesser pack members. CULTIVATION NOTES: Lupari Body cultivators are nearly unkillable in prolonged fights - their endurance is legendary. Lupari Earth cultivators become pack guardians, anchoring defensive formations.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 314,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "705": {
      "uid": 705,
      "key": [
        "Lepori cultivation",
        "bunnyfolk affinity",
        "lepori martial"
      ],
      "comment": "Lepori - Wind and Light Masters",
      "content": "PATH AFFINITIES: Wind Path, Light Path. 0% penalty to affinity paths, -50% to all others. EXPLANATION: Lepori exceptional speed, evasiveness, and generally positive nature make them natural Wind and Light cultivators. Their 'flight over fight' instincts align perfectly with these supportive paths. MARTIAL MODIFICATIONS: Extreme speed and jumping ability. Enhanced hearing (large ears). Natural danger sense. Poor durability but exceptional evasion. NATURAL WEAPONS: Powerful kicks (their main combat option). WEAPON PREFERENCES: Bows, throwing weapons, anything allowing range. Most Lepori avoid direct combat entirely. COMBAT STYLE: Extreme evasion specialists. Lepori rarely stand and fight - they kite, flee, and strike from safety. Excel as scouts and messengers. CULTIVATION NOTES: Lepori Wind cultivators are the fastest messengers and scouts in Sinveil. Lepori Light cultivators make excellent healers and support specialists. Very few choose combat-focused paths due to cultural values emphasizing family protection over glory.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 315,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "706": {
      "uid": 706,
      "key": [
        "Dragonkin cultivation",
        "dragonborn affinity",
        "dragonkin martial"
      ],
      "comment": "Dragonkin - Fire and Light Masters",
      "content": "PATH AFFINITIES: Fire Path, Light Path. 0% penalty to affinity paths, -35% to all others. EXPLANATION: Draconic heritage grants natural affinity for elemental power and radiance. Their pride, territoriality, and breath weapons make them devastating Fire and Light cultivators. MARTIAL MODIFICATIONS: Scales provide natural armor (significant damage reduction). Wings manifest at Silver+ realm (flight capability). Breath weapon (fire or light based on path choice). Enhanced strength and presence. NATURAL WEAPONS: Claws, fangs, tail, horns. Breath weapon (major advantage). WEAPON PREFERENCES: Greatswords, polearms, weapons befitting their size. Many fight with natural weapons only. COMBAT STYLE: Dominant aerial combatants once wings manifest. Favor overwhelming displays of power. Territorial and proud - tend to fight alone rather than cooperate. CULTIVATION NOTES: Dragonkin Fire cultivators are among the most destructive forces in Sinveil. Dragonkin Light cultivators radiate such majesty they can paralyze lesser beings. Very rare race, almost always have at least Awakened bloodline naturally.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 316,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "707": {
      "uid": 707,
      "key": [
        "Kitsune cultivation",
        "fox spirit affinity",
        "kitsune martial"
      ],
      "comment": "Kitsune - Shadow, Light, and Fire Masters",
      "content": "PATH AFFINITIES: Shadow Path, Light Path, Fire Path. 0% penalty to affinity paths, -40% to all others. EXPLANATION: Kitsune mystical nature and fox heritage grant affinity for illusion, deception, and elemental power. Their growing tails (1-9 based on power) represent their cultivation advancement. MARTIAL MODIFICATIONS: Natural illusion abilities (can create minor illusions without techniques). Tail count indicates power level (more tails = higher realm). Enhanced agility and senses. Fox fire (can create spiritual flames). NATURAL WEAPONS: Claws, fangs. Fox fire. WEAPON PREFERENCES: Fans, light swords, catalysts for mystical techniques. Many rely on illusions over weapons. COMBAT STYLE: Deceptive combatants who confuse and misdirect. Excel at making opponents fight phantoms. High-realm Kitsune (7-9 tails) are nearly impossible to corner. CULTIVATION NOTES: Kitsune Shadow cultivators create illusions indistinguishable from reality. Kitsune Light cultivators can become living stars. Kitsune Fire cultivators wield fox fire that burns both body and soul. Tail growth is automatic with realm advancement - a 9-tailed Kitsune is always Eternal or Sovereign realm.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 317,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "708": {
      "uid": 708,
      "key": [
        "Orc cultivation",
        "orc affinity",
        "orc martial"
      ],
      "comment": "Orcs - Fire, Body, and Earth Masters",
      "content": "PATH AFFINITIES: Fire Path, Body Path, Earth Path. 0% penalty to affinity paths, -45% to all others. EXPLANATION: Orcish aggression, physical prowess, and warrior culture make them natural combat cultivators. Their 'might makes right' philosophy aligns with direct, physical paths. MARTIAL MODIFICATIONS: Enhanced strength and pain tolerance. Natural regeneration (recover faster). Berserker rage potential (power boost when injured/angry). Tusks and tough hide. NATURAL WEAPONS: Tusks (piercing). Enhanced unarmed strikes. WEAPON PREFERENCES: Axes, greatswords, warhammers. Favor heavy weapons and overwhelming force. COMBAT STYLE: Aggressive frontline warriors. Orcs don't retreat - they press forward until victory or death. Excel in prolonged melee where their regeneration matters. CULTIVATION NOTES: Orc Fire cultivators are berserker pyromancers who grow stronger as battle continues. Orc Body cultivators are nearly unkillable juggernauts. Orc Earth cultivators become living walls that armies break against. Cultural emphasis on strength and honor in combat.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 318,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "709": {
      "uid": 709,
      "key": [
        "Goblin cultivation",
        "goblin affinity",
        "goblin martial"
      ],
      "comment": "Goblins - Shadow and Wind Masters",
      "content": "PATH AFFINITIES: Shadow Path, Wind Path. 0% penalty to affinity paths, -50% to all others. EXPLANATION: Goblin cunning, adaptability, and survival instincts make them natural stealth and mobility cultivators. Their small size and opportunistic nature align with these evasive paths. MARTIAL MODIFICATIONS: Small size (harder to hit, can fit in tight spaces). Enhanced dexterity and nimbleness. Natural scavengers (find resources others miss). Weak physical strength but excellent reflexes. NATURAL WEAPONS: Sharp teeth. Surprising bite strength. WEAPON PREFERENCES: Daggers, short swords, crossbows, traps. Favor ambush weapons and prepared surprises. COMBAT STYLE: Opportunistic ambushers who attack weakness and flee when threatened. Excel at guerrilla tactics and hit-and-run. Often work in groups despite being individually weak. CULTIVATION NOTES: Goblin Shadow cultivators are exceptional trappers and infiltrators - their small size lets them hide anywhere. Goblin Wind cultivators become nearly impossible to catch or corner. Despite being considered 'lesser' by other races, high-realm Goblins are terrifyingly effective combatants.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 319,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "710": {
      "uid": 710,
      "key": [
        "Harpy cultivation",
        "harpy affinity",
        "harpy martial"
      ],
      "comment": "Harpies - Wind and Light Masters",
      "content": "PATH AFFINITIES: Wind Path, Light Path. 0% penalty to affinity paths, -45% to all others. EXPLANATION: Harpy natural flight and aerial lifestyle make them exceptional Wind and Light cultivators. Their songs and connection to sky align perfectly with these paths. MARTIAL MODIFICATIONS: Natural flight from birth (massive advantage). Talons for grasping. Enhanced vision (bird eyes see incredible distances). Hollow bones (lighter but more fragile). NATURAL WEAPONS: Talons (slashing/grasping). Beak (piercing). WEAPON PREFERENCES: Spears, javelins, throwing weapons. Prefer weapons usable in flight. Many rely on aerial superiority over weapons. COMBAT STYLE: Aerial superiority fighters who strike from above. Excel at diving attacks and staying out of reach. Harpy songs can disorient or inspire. CULTIVATION NOTES: Harpy Wind cultivators are unmatched aerial combatants - combining natural flight with wind techniques creates three-dimensional combat mastery. Harpy Light cultivators can sing dawn itself into existence. Their hollow bones make them vulnerable in prolonged ground combat but dominant in the sky.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 140,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "711": {
      "uid": 711,
      "key": [
        "Centaur cultivation",
        "centaur affinity",
        "centaur martial"
      ],
      "comment": "Centaurs - Wind, Earth, and Body Masters",
      "content": "PATH AFFINITIES: Wind Path, Earth Path, Body Path. 0% penalty to affinity paths, -45% to all others. EXPLANATION: Centaur speed, connection to plains, and physical prowess make them natural cultivators of movement and strength. Their nomadic warrior culture aligns with these paths. MARTIAL MODIFICATIONS: Extreme speed and charging power. Four legs provide incredible stability. Enhanced endurance for long-distance travel. Large size and mass. Powerful kicks. NATURAL WEAPONS: Hooves (devastating kicks, trampling). WEAPON PREFERENCES: Spears, bows, lances. Weapons usable while running. Excel at mounted combat (they ARE the mount). COMBAT STYLE: Charge-based warriors who use momentum and mass. Excel at running combat and pursuit. Difficult to knock down or stop. Vulnerable in confined spaces. CULTIVATION NOTES: Centaur Wind cultivators combine natural speed with wind techniques to become unstoppable cavalry. Centaur Earth cultivators are living siege engines. Centaur Body cultivators develop legendary endurance - they can run for days without rest while fighting.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 139,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "712": {
      "uid": 712,
      "key": [
        "Marefolk cultivation",
        "marefolk affinity",
        "marefolk martial"
      ],
      "comment": "Marefolk - Wind and Water Masters",
      "content": "PATH AFFINITIES: Wind Path, Water Path. 0% penalty to affinity paths, -45% to all others. EXPLANATION: Marefolk grace, speed, and flowing movements make them natural Wind and Water cultivators. Their equine heritage grants endurance and beauty. MARTIAL MODIFICATIONS: Enhanced running speed and grace. Excellent swimmers. Flowing manes that respond to emotions and qi. Powerful legs for kicking. Natural beauty aids social cultivation. NATURAL WEAPONS: Hooves (powerful kicks). WEAPON PREFERENCES: Staffs, glaives, flowing weapons that complement their graceful style. Many use dance-like combat forms. COMBAT STYLE: Mobile strikers who emphasize grace and flowing combinations. Excel at sustained movement combat. Marefolk can fight while running at full speed. CULTIVATION NOTES: Marefolk Wind cultivators become blur-fast dancers who strike from all angles. Marefolk Water cultivators master flowing, adaptive combat styles that make them nearly impossible to predict. Their natural grace makes technique execution appear effortless.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 138,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "713": {
      "uid": 713,
      "key": [
        "Minotaur cultivation",
        "minotaur affinity",
        "minotaur martial"
      ],
      "comment": "Minotaurs - Earth, Body, and Fire Masters",
      "content": "PATH AFFINITIES: Earth Path, Body Path, Fire Path. 0% penalty to affinity paths, -40% to all others. EXPLANATION: Minotaur massive size, strength, and indomitable nature make them natural power cultivators. Their bull heritage grants raw physical dominance. MARTIAL MODIFICATIONS: Extreme strength and durability. Massive size (intimidating presence). Horns for goring. Berserker rage potential when injured. Natural maze navigation (never lost). NATURAL WEAPONS: Horns (goring, devastating charges). Enhanced physical strikes. WEAPON PREFERENCES: Greataxes, massive warhammers, oversized weapons. Many fight with bare fists and horns. COMBAT STYLE: Overwhelming force specialists who charge into melee and dominate through raw power. Excel at breaking through defenses. Nearly impossible to stop when enraged. CULTIVATION NOTES: Minotaur Earth cultivators are living fortress-breakers. Minotaur Body cultivators develop such physical perfection they can headbutt through steel. Minotaur Fire cultivators become berserker infernos. Their natural tendency toward rage makes them powerful but sometimes reckless.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 137,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "714": {
      "uid": 714,
      "key": [
        "Succubus cultivation",
        "succubus affinity",
        "succubi martial"
      ],
      "comment": "Succubi - Temptation Devils (Female)",
      "content": "PATH AFFINITIES: Shadow Path (corruption variant). Natural devil cultivation - no traditional path. Gain power through spreading Temptation sin among mortals. EXPLANATION: Succubi are pure Temptation devils, not mortals. They don't cultivate traditional paths - they gain power by seducing, corrupting, and collecting souls. MARTIAL MODIFICATIONS: Natural flight (bat wings). Hypnotic beauty (mental influence on attraction). Shapeshifting (can alter appearance). Prehensile tail. Mental manipulation abilities. Drain life force through touch. NATURAL WEAPONS: Claws, tail. Mental attacks. Life drain. WEAPON PREFERENCES: Rarely use weapons - rely on mental powers and corruption. Some wield whips or chains as symbols. COMBAT STYLE: Avoid direct combat. Excel at infiltration, seduction, and long-term corruption. Plant seeds of temptation and let victims destroy themselves. Can fight directly but prefer not to. CULTIVATION NOTES: Succubi gain power by corrupting mortals through forbidden desires - offering power, pleasure, or knowledge in exchange for gradual soul corruption. Each fully corrupted victim feeds qi directly to their master (Countess Vespera). Serve as infiltrators and intelligence gatherers for Temptation forces. Emerged five years ago through continental portals.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 740,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "715": {
      "uid": 715,
      "key": [
        "Incubus cultivation",
        "incubus affinity",
        "incubi martial"
      ],
      "comment": "Incubi - Temptation Devils (Male)",
      "content": "PATH AFFINITIES: Shadow Path (corruption variant). Natural devil cultivation - no traditional path. Gain power through spreading Temptation sin among mortals. EXPLANATION: Incubi are pure Temptation devils, not mortals. They don't cultivate traditional paths - they gain power by corrupting through promises of power and forbidden knowledge. MARTIAL MODIFICATIONS: Natural flight (demonic wings). Hypnotic charisma (mental influence on ambition). Shapeshifting (can alter appearance). Horns indicate rank/power. Prehensile tail. Mental manipulation abilities. NATURAL WEAPONS: Claws, horns, tail. Mental attacks. WEAPON PREFERENCES: Favor greatswords or elegant blades as status symbols, but rely primarily on mental powers and corruption. COMBAT STYLE: More combat-capable than Succubi but still prefer manipulation. Excel at corrupting ambitious mortals through promises of power. Plant temptation and watch victims rationalize their descent. Can fight effectively when necessary. CULTIVATION NOTES: Incubi gain power by corrupting mortals through ambition - offering forbidden techniques, secret knowledge, or shortcuts to power in exchange for gradual soul corruption. Each fully corrupted victim feeds qi directly to their master (Countess Vespera). Serve as corruptors of sect disciples and ambitious cultivators. Emerged five years ago through continental portals.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 741,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "716": {
      "uid": 716,
      "key": [
        "Wrath Demon cultivation",
        "wrath devil affinity",
        "wrath demon martial"
      ],
      "comment": "Wrath Demons - Pure Rage Devils",
      "content": "PATH AFFINITIES: Fire Path (corruption variant). Natural devil cultivation - no traditional path. Gain power through spreading Wrath sin among mortals. EXPLANATION: Wrath Demons are pure rage incarnate. They don't cultivate traditional paths - they gain power through violence, fury, and inciting rage in others. MARTIAL MODIFICATIONS: Massive size and strength. Crimson skin and flaming horns. Burning eyes leak fire. Grow stronger when injured or enraged. Natural fire immunity. Berserker state (near-permanent). NATURAL WEAPONS: Claws, horns, fangs. Burning touch. WEAPON PREFERENCES: Massive axes, hammers, greatswords. Favor oversized weapons of pure destruction. Many fight bare-handed to feel the kill. COMBAT STYLE: Relentless berserker assault. Never retreat, never surrender. Grow stronger as battle continues. Wrath Demons literally cannot calm down - they exist in perpetual fury. Excel at sustained melee. CULTIVATION NOTES: Wrath Demons gain power through violence and by inciting rage in mortals - starting fights, provoking murders, instigating wars. Each act of wrath feeds qi directly to their master (Duke Calderon). Serve as shock troops and raid leaders. Emerged five years ago through continental portals. Conduct brutal raids across Solhara primarily.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 742,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "717": {
      "uid": 717,
      "key": [
        "True Devil cultivation",
        "abyssal devil affinity",
        "pure devil martial"
      ],
      "comment": "True Devils - Shapeshifting Abyss Natives",
      "content": "PATH AFFINITIES: All paths (corruption variants). Natural devil cultivation - can mimic any path. Gain power through embodying their specific sin. EXPLANATION: True Devils are ancient Abyss natives who can adopt any form or path. They're the elite commanders serving the Seven Generals directly. MARTIAL MODIFICATIONS: Perfect shapeshifting (can become anything they've seen). Immortal lifespan. No fixed form or gender. Embody specific sins (each True Devil serves one General). Can mimic bloodline abilities. Reality warping at high realms. NATURAL WEAPONS: Whatever form they take. Can manifest any weapon from their body. WEAPON PREFERENCES: True Devils prefer to fight using perfectly mimicked forms of their victims' own techniques, creating psychological warfare. COMBAT STYLE: Infinitely adaptive. True Devils study opponents then become perfect counters. No consistent combat style - they become whatever is needed. Excel at impersonation and infiltration. CULTIVATION NOTES: True Devils gain power by perfectly embodying their sin - Pride Devils through superiority, Greed Devils through hoarding, etc. Each serves directly under one of the Seven Generals as elite lieutenants and agents. Offspring with any race produces pure devils. Emerged five years ago as commanders of the seven Sin Legions. Extremely rare and powerful.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 133,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "718": {
      "uid": 718,
      "key": [
        "Nereid cultivation",
        "nereid affinity",
        "nereid martial",
        "water folk"
      ],
      "comment": "Nereids - Water and Light Masters",
      "content": "PATH AFFINITIES: Water Path (primary), Light Path. 0% penalty to affinity paths, -45% to all others. EXPLANATION: Nereids are amphibious humanoids with deep connection to oceans, rivers, and lakes. Their fluid nature and bioluminescent markings make them natural Water and Light cultivators. Unlike Marefolk who share Water affinity with Wind, Nereids are THE definitive Water race. PHYSICAL TRAITS: Height 160-190 cm, weight 50-85 kg. Slightly more females. Skin ranges from pale blue to deep teal to sea-green. Hair in oceanic colors (blue, green, silver, pearl). Eyes are large with nictitating membranes (underwater sight). Webbed fingers and toes. Gill slits on neck (can breathe underwater indefinitely). Bioluminescent markings along arms, spine, and face that glow when channeling qi. LIFESPAN: 400-600 years. MARTIAL MODIFICATIONS: Perfect underwater combat (no penalties). Can breathe water and air equally. Pressure resistance (deep ocean survival). Enhanced swimming speed. Bioluminescence can be weaponized (blinding flashes). Slippery skin (hard to grapple). Cold resistance. NATURAL WEAPONS: None, but webbed hands create powerful water-channeling gestures. WEAPON PREFERENCES: Tridents, spears, harpoons, nets. Weapons designed for thrusting and underwater use. Many prefer unarmed water technique combat. COMBAT STYLE: Fluid and adaptive, constantly moving like water itself. Excel at fighting in or near water. Nereids can weaponize surrounding water even without techniques at higher realms. Prefer to drag enemies into water where they have absolute advantage. CULTIVATION NOTES: Nereid Water cultivators are unmatched in aquatic environments - they can create currents, whirlpools, and water prisons instinctively. Nereid Light cultivators develop bioluminescent techniques that combine illumination with healing. Many serve as healers in coastal communities. Their natural connection to water makes them the most sought-after Water Path disciples. CULTURAL NOTES: Nereids build cities in shallow coastal waters and along major rivers. They maintain the largest underwater trade networks and guard ancient ruins beneath the waves. Generally peaceful but fiercely territorial about their waters. Strong presence in Primereach coastal regions and around the Scattered Isles. Have ancient alliance with Tranquil Depths Sect due to shared Water Path focus. FAMOUS EXAMPLES: Lady Maren's sect (Tranquil Depths) has significant Nereid membership. The legendary Tidekeeper Guard are elite Nereid warriors who patrol Alliance coastlines. Several Nereid cultivators have reached Void realm through pure Water Path mastery.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 136,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "719": {
      "uid": 719,
      "key": [
        "Mortal bloodline",
        "Mortal tier",
        "common bloodline"
      ],
      "comment": "Mortal Bloodline Tier - The Common Foundation",
      "content": "RARITY: 95% of population. CULTIVATION CEILING: Gold realm (peak mortal). Breaking through to Astral requires demonic corruption or exceptional circumstance. CULTIVATION EFFICIENCY: 100% baseline. Training and resources convert to power at standard rate. TECHNIQUE CAPACITY BONUS: +0 slots (no bonus). Total slots at each realm equal base only: Bronze 3, Iron 6, Silver 9, Gold 12. PROGRESSION TIMELINE: Bronze->Iron (5-10 years), Iron->Silver (10-20 years), Silver->Gold (20-40 years). TOTAL TO GOLD: 35-70 years of dedicated cultivation. Most Mortal cultivators spend entire life reaching Gold, and many never make it past Silver. Bottlenecks are frequent and difficult to overcome. BREAKTHROUGH SUCCESS RATE: 60% per major realm. Many cultivators fail tribulation and die or are crippled trying to advance. PASSIVE ABILITIES: None. Mortal bloodlines grant no inherent supernatural advantages beyond the ability to cultivate qi. Physical traits remain within normal racial limits. ACTIVE ABILITIES: None. No bloodline-specific techniques available. Must rely entirely on learned cultivation techniques. CROSS-PATH PENALTY: -75% effectiveness when learning techniques from non-primary paths. Essentially impossible to master multiple paths. LIFESPAN: Realm-dependent only (Bronze 100-150 years -> Gold 300-500 years). BLOODLINE RESONANCE: None. Techniques perform at base power with no bloodline amplification. AWAKENING POTENTIAL: Mortal bloodlines very rarely awaken to Awakened tier through extreme life-or-death experiences, consuming awakening catalysts, or bloodline theft (forbidden). Success rate is less than 1%. ADVANTAGES: No expectations or pressure. Can focus purely on technique mastery. Less likely to be targeted by the Veinshadow Covenant. Underestimated by opponents. DISADVANTAGES: Slow cultivation with frequent bottlenecks. Gold realm ceiling means most Mortal bloodlines never see immortal cultivation. Cannot learn bloodline-exclusive techniques. High risk of tribulation death. CULTURAL PERCEPTION: Mortal bloodlines are the 'talentless' masses. Most sect outer disciples have Mortal bloodlines. Respected for hard work but rarely achieve greatness. MC CONTEXT: MC appears to have Mortal bloodline at Bronze realm, leading to being overlooked and underestimated. This is actually dormant Primordial waiting to evolve.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 401,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "720": {
      "uid": 720,
      "key": [
        "awakened bloodline",
        "iron breakthrough bloodline",
        "second bloodline breakthrough",
        "mortal to awakened"
      ],
      "comment": "Awakened Bloodline Tier - The Talented Few",
      "content": "RARITY: 1 in 100 (1%). CULTIVATION CEILING: Astral realm reliably, Void with effort. CULTIVATION EFFICIENCY: 120% (converts training to power more effectively than Mortal). TECHNIQUE CAPACITY BONUS: +2 slots (flat total). Total slots: Bronze 5, Iron 8, Silver 11, Gold 14, Astral 17, Void 20, Eternal 23, Sovereign 26. PROGRESSION TIMELINE: Bronze->Iron (3-5 years), Iron->Silver (5-10 years), Silver->Gold (10-15 years), Gold->Astral (30-50 years - major bottleneck), Astral->Void (100-200 years). TOTAL TO VOID: 150-280 years. Most Awakened cultivators reach Gold by age 40-60, Astral by age 70-110 if talented. Void is achievable but requires exceptional dedication and resources. BREAKTHROUGH SUCCESS RATE: 70% per major realm. Better than Mortal but still significant risk. PASSIVE ABILITIES: ENHANCED QI SENSITIVITY - Can sense qi fluctuations within 50 meters. Detect other cultivators' approximate realm. Notice hidden formations and qi traps. IMPROVED QI RECOVERY - Regenerate qi 50% faster during rest. Recover from cultivation exhaustion quicker. BLOODLINE RESONANCE (MINOR) - Path-matched techniques are 20% more effective. Qi costs reduced by 10% for affinity path techniques. ACTIVE ABILITIES: BLOODLINE PULSE (Once per day) - Release burst of bloodline qi that briefly enhances all abilities by 50% for one minute. Afterward, suffer minor exhaustion. Useful for desperate situations or finishing moves. AWAKENED INTUITION - When learning new techniques, occasionally receive sudden insights that speed comprehension. Not reliable, but happens 1-2 times per major realm. CROSS-PATH PENALTY: -65% effectiveness (improvement from Mortal's -75%). Still very difficult but technically possible to learn secondary paths with enough dedication. LIFESPAN: +200 years beyond realm baseline. Awakened cultivators live notably longer. PHYSICAL CHANGES: Subtle enhancement of physical appearance - clearer skin, brighter eyes, more vibrant hair. Not dramatic but noticeable compared to Mortal bloodlines. Minor glow when channeling qi. BLOODLINE INHERITANCE: 50% chance children inherit Awakened tier, 50% chance they're Mortal. Cannot pass higher than own tier naturally. ADVANTAGES: Can reliably break through to Astral (immortal cultivation). Respected by sects - guaranteed inner disciple status. Eligible for core disciple advancement. Better resource efficiency means same training yields more progress. DISADVANTAGES: Draw attention from the Veinshadow Covenant. Higher expectations create pressure. Still far behind Noble+ bloodlines in both speed and ceiling. Takes centuries to reach Void. CULTURAL PERCEPTION: 'Talented disciples' who are the backbone of sects. Most inner disciples and some core disciples have Awakened bloodlines. Respected and valued. MC CONTEXT: MC's bloodline evolves to Awakened at Bronze->Iron breakthrough. First major revelation that MC is not ordinary. Sect elders take sudden interest.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 279,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "721": {
      "uid": 721,
      "key": [
        "noble bloodline awakening",
        "noble tier evolution",
        "rare bloodline power",
        "third bloodline breakthrough"
      ],
      "comment": "Noble Bloodline Tier - The Exceptional Elite",
      "content": "RARITY: 1 in 1,000 (0.1%). CULTIVATION CEILING: Void realm reliably, Eternal possible with resources. CULTIVATION EFFICIENCY: 150% (significantly better resource-to-power conversion). TECHNIQUE CAPACITY BONUS: +4 slots (flat total). Total slots: Bronze 7, Iron 10, Silver 13, Gold 16, Astral 19, Void 22, Eternal 25, Sovereign 28. PROGRESSION TIMELINE: Bronze->Gold (15-25 years - compressed mortal realms), Gold->Astral (20-30 years), Astral->Void (50-100 years), Void->Eternal (200-400 years). TOTAL TO ETERNAL: 285-555 years. Noble cultivators typically reach Gold by age 30-40, Astral by age 50-70, Void by age 100-170. Eternal is achievable with proper resources and dedication over centuries. BREAKTHROUGH SUCCESS RATE: 80% per major realm. Much safer progression than lower tiers. PASSIVE ABILITIES: BLOODLINE AURA - Constant aura that can be suppressed or released. When released, intimidates cultivators two or more realms below. Mortal bloodlines feel instinctive pressure. Aura color/effect matches bloodline element. QI POOL EXPANSION - Maximum qi capacity increased by 50%. Can fight longer and use more techniques before exhaustion. ADVANCED QI RECOVERY - Regenerate qi 100% faster than Mortal baseline (2x speed). Can recover to full in hours instead of days. ENHANCED PHYSIQUE - Appearance becomes notably superior to Mortal bloodlines. Perfect complexion, ideal body proportions, striking features. Natural charisma. Age slower within realm lifespan. BLOODLINE RESONANCE (MODERATE) - Path-matched techniques are 50% more effective. Qi costs reduced by 25% for affinity path techniques. Techniques execute with greater power and precision. ACTIVE ABILITIES: BLOODLINE MANIFESTATION - Can manifest visible bloodline phenomena when channeling qi. Fire bloodlines trail flames, Water bloodlines create mist, Earth bloodlines make ground tremble, etc. Costs no extra qi, purely visual, but intimidating. ANCESTRAL INSIGHT - When cultivating or learning techniques, occasionally receive visions or intuitive understanding. Twice as frequent as Awakened tier. Can lead to technique breakthroughs or personalized modifications. NOBLE PRESSURE - Actively suppress cultivators of lower realm through bloodline superiority alone. Gold realm Noble can make Bronze cultivators unable to move through pressure alone. Costs minimal qi to maintain. BLOODLINE TECHNIQUE (BASIC) - Gain access to one bloodline-exclusive technique appropriate to element/path. Example: Fire Noble might learn 'Phoenix Ember' (create undying flames), Earth Noble might learn 'Mountain's Mantle' (qi-infused skin becomes stone-hard), Shadow Noble might learn 'Umbral Step' (enhanced shadow teleportation). Technique grows stronger with cultivation. CROSS-PATH PENALTY: -55% effectiveness. Difficult but manageable with high-tier techniques and dedication. Some Noble cultivators successfully maintain a secondary weaker path. LIFESPAN: +500 years beyond realm baseline. Noble bloodlines can live centuries beyond Mortal cultivators of same realm. BLOODLINE INHERITANCE: 70% chance children inherit Noble tier, 30% revert to Awakened. Extremely rare (<1%) chance of spontaneous elevation to Ancient in children with proper cultivation environment. ADVANTAGES: Guaranteed core disciple status in any orthodox sect. Can reasonably expect to reach Void realm with proper resources and effort. Better efficiency means decades of work instead of centuries at higher realms. Highly sought after for marriages to strengthen clan bloodlines. Multiple bloodline-exclusive techniques become available. DISADVANTAGES: Major target for the Veinshadow Covenant. Intense pressure and expectations from family/sect. Political machinations as clans try to secure marriages. Arrogance common among Noble bloodlines, leading to downfall. Still takes centuries to reach Eternal - not a shortcut to godhood. CULTURAL PERCEPTION: 'Genius disciples' and 'young masters/mistresses' who dominate their generation. Most core disciples and sect elders have Noble bloodlines. Treated with respect bordering on reverence by lower bloodlines. Often arrogant. MC CONTEXT: MC's bloodline evolves to Noble at Iron->Silver breakthrough. Sect takes serious interest. MC becomes politically important. Marriage proposals likely. Veinshadow Covenant takes notice.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 278,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "722": {
      "uid": 722,
      "key": [
        "ancient bloodline awakening",
        "ancient tier evolution",
        "legendary bloodline power",
        "fourth bloodline breakthrough"
      ],
      "comment": "Ancient Bloodline Tier - The Continental Powers",
      "content": "RARITY: 1 in 10,000 (0.01%). CULTIVATION CEILING: Eternal realm reliably, Sovereign possible but difficult. CULTIVATION EFFICIENCY: 200% (double the power from same training as Mortal). TECHNIQUE CAPACITY BONUS: +8 slots (flat total). Total slots: Bronze 11, Iron 14, Silver 17, Gold 20, Astral 23, Void 26, Eternal 29, Sovereign 32. PROGRESSION TIMELINE: Bronze->Gold (10-15 years), Gold->Astral (10-20 years), Astral->Void (30-60 years), Void->Eternal (100-200 years), Eternal->Sovereign (500-1500 years with perfect conditions). TOTAL TO ETERNAL: 150-295 years. Ancient cultivators typically reach Gold by age 20-25, Astral by age 30-45, Void by age 60-105, Eternal by age 160-300. Sovereign is theoretically possible but requires centuries more and exceptional circumstances. BREAKTHROUGH SUCCESS RATE: 90% per major realm. Very reliable progression with minimal tribulation deaths. PASSIVE ABILITIES: DOMINANT AURA - Overwhelming presence that cannot be fully suppressed. Passively intimidates all cultivators below Astral realm. Even Astral cultivators feel pressure. Only Void+ can stand comfortably near active Ancient bloodline aura. Colors reality around them with bloodline element - Fire Ancients trail heat, Water Ancients bring humidity, Shadow Ancients dim nearby light. MASSIVE QI POOL - Maximum qi capacity tripled compared to Mortal baseline. Can fight for hours without exhaustion. SUPERIOR REGENERATION - Regenerate qi 300% faster than Mortal baseline (3x speed). Recover to full capacity in one hour of meditation. Also enhanced physical healing - wounds close faster, poisons resist easier, diseases rarely affect them. PERFECT PHYSIQUE - Appearance becomes objectively superior. Described as 'touched by heaven.' Flawless beauty/handsomeness regardless of race. Natural imperial bearing. Age appears frozen at prime (25-35 human years equivalent) until near end of lifespan. BLOODLINE RESONANCE (MAJOR) - Path-matched techniques are 100% more effective (double power). Qi costs reduced by 50% for affinity path techniques. Techniques execute with perfection that lower bloodlines cannot match. Can create personalized variations of techniques spontaneously. ELEMENTAL AFFINITY - Natural environment shifts subtly to favor bloodline element. Fire Ancients feel comfortable in heat, Water Ancients never dehydrate, Earth Ancients stand more stable, Wind Ancients are never caught in stillness, Shadow Ancients see perfectly in darkness, Light Ancients are never blinded, Body Ancients heal wounds overnight, Sword Ancients have perfect edge alignment. ACTIVE ABILITIES: BLOODLINE DOMAIN (PROTO) - At Astral+ realm, can manifest partial Domain powered purely by bloodline rather than cultivation. Smaller than normal Domain but much stronger. Fire Ancient's bloodline domain ignites everything, Water Ancient's domain floods area, etc. Costs significant qi but devastating. ANCESTRAL COMMUNION - Can enter deep meditation to commune with bloodline memories. Experience fragments of past Ancient bloodline holders' lives, battle techniques, or cultivation insights. Not reliable but potentially game-changing. Once per major realm breakthrough. ANCIENT PRESSURE - Can make Mortal and Awakened bloodlines unable to cultivate in their presence. At Gold realm, Ancient bloodline can suppress Bronze/Iron cultivators so hard they pass out from pressure alone. Can be turned off with effort. BLOODLINE TECHNIQUES (ADVANCED) - Gain access to three bloodline-exclusive techniques appropriate to element/path. These are Ancient-tier techniques that only Ancient+ bloodlines can learn and execute. Examples: Fire Ancient 'Solar Core' (internal sun that makes user immune to heat and fuels fire techniques indefinitely), Earth Ancient 'Continental Stance' (become literally unmovable, roots extend into planetary qi), Shadow Ancient 'Forgotten Existence' (erase self from memory of observers temporarily). These techniques scale with realm and are signature moves. BLOODLINE EVOLUTION - Ancient bloodlines can modify their own techniques through cultivation, creating personal 'bloodline arts' unique to them. These personalized techniques can be passed to direct descendants. CROSS-PATH PENALTY: -40% effectiveness. Challenging but very possible. Ancient bloodlines can reasonably maintain two paths simultaneously if dedicated. Some Ancient cultivators are famous for dual-path mastery. LIFESPAN: +2,000 years beyond realm baseline. Ancient bloodlines can live millennia longer than Mortal cultivators of same realm. Gold realm Ancient lives as long as Void realm Mortal. BLOODLINE INHERITANCE: 80% chance children inherit Ancient tier, 20% fall to Noble. 5% chance of spontaneous elevation to Divine in children with proper cultivation environment. Clans with Ancient bloodlines are major powers. ADVANTAGES: Guaranteed elite disciple or young sect master status. Will almost certainly reach Eternal realm if they survive. Better efficiency means decades where others need centuries at high realms. Highly sought for alliances and marriages at continental level. Access to Ancient bloodline techniques changes combat fundamentally. Can fight above their realm against lower bloodlines. DISADVANTAGES: Constant target for assassination by rival powers and the Veinshadow Covenant. Immense political pressure as entire clans and sects pin hopes on them. Arrogance and entitlement common, leading to fatal mistakes. Heavenly Tribulations are much harsher (Heaven is jealous of Ancient bloodlines). Sovereign realm still requires half a millennium or more of perfect cultivation. CULTURAL PERCEPTION: 'Heaven-blessed geniuses' who appear once per generation. Sect masters, clan patriarchs, and continental powers typically have Ancient bloodlines. Treated as living treasures. Stories and legends written about them. Marriage to Ancient bloodline is political alliance at highest level. MC CONTEXT: MC's bloodline evolves to Ancient at Silver->Gold breakthrough. MC becomes person of extreme importance. Multiple sects and clans vie for MC's allegiance or marriage. Assassination attempts likely. Veinshadow Covenant launches coordinated efforts. The Generals begin to take notice.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 277,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "723": {
      "uid": 723,
      "key": [
        "divine bloodline awakening",
        "divine tier evolution",
        "heaven-blessed bloodline",
        "fifth bloodline breakthrough"
      ],
      "comment": "Divine Bloodline Tier - The Chosen of Heaven",
      "content": "RARITY: 1 in 100,000 (0.001%). Only dozens exist on Sinveil at any time. CULTIVATION CEILING: Sovereign realm is achievable. CULTIVATION EFFICIENCY: 300% (triple the power from same training as Mortal). TECHNIQUE CAPACITY BONUS: +12 slots (flat total). Total slots: Bronze 15, Iron 18, Silver 21, Gold 24, Astral 27, Void 30, Eternal 33, Sovereign 36. PROGRESSION TIMELINE: Bronze->Gold (5-10 years), Gold->Astral (5-10 years), Astral->Void (20-40 years), Void->Eternal (50-100 years), Eternal->Sovereign (200-500 years). TOTAL TO ETERNAL: 80-160 years. TOTAL TO SOVEREIGN: 280-660 years. Divine cultivators typically reach Gold by age 15-20, Astral by age 20-30, Void by age 40-70, Eternal by age 90-170, Sovereign by age 290-670 if they survive tribulations and political dangers. This is remarkably fast but still represents centuries of dedicated cultivation at highest levels. BREAKTHROUGH SUCCESS RATE: 95% per major realm. Nearly guaranteed progression, though tribulations are catastrophic in scale. PASSIVE ABILITIES: DIVINE PRESENCE - Overwhelming reality-warping aura that fundamentally changes environment. Cannot be suppressed completely even with effort. Fire Divine blazes with inner light visible in daylight. Water Divine causes rain to fall nearby. Earth Divine makes ground stabilize under their feet. Wind Divine always has breeze following them. Shadow Divine exists partially in shadow realm. Light Divine radiates faint glow. Body Divine presence makes air feel heavier. Sword Divine causes metal to resonate. All bloodlines below Divine feel compulsion to kneel in their presence - requires active effort to resist. OCEANIC QI POOL - Maximum qi capacity increased by 500% compared to Mortal baseline. Can fight for days without exhaustion if necessary. Qi pool so vast that qi regeneration becomes almost irrelevant in normal combat. DIVINE REGENERATION - Regenerate qi 1,000% faster than Mortal baseline (10x speed). Full recovery in minutes. Physical regeneration is also enhanced - can regrow limbs over weeks at Astral+, survive mortal wounds that would kill lower bloodlines, immune to all mortal diseases and most poisons. CELESTIAL PHYSIQUE - Appearance transcends mortal beauty into divine perfection. Described as 'living art' or 'heaven's masterpiece.' Inspires awe, devotion, obsession, and jealousy in equal measure. Age appears completely frozen - Divine bloodlines look like perfect young adults (20-25 equivalent) from Astral realm until final years. Some mortals worship Divine bloodlines as living gods. BLOODLINE RESONANCE (SUPREME) - Path-matched techniques are 200% more effective (triple power). Qi costs reduced by 75% for affinity path techniques. Techniques execute at level of perfection that seems to violate natural law. Can spontaneously create new techniques mid-battle. Lower bloodlines watching Divine cultivator fight often cannot comprehend what they're seeing. REALITY ATTUNEMENT - Natural laws bend subtly to accommodate Divine bloodline. Physics works slightly differently near them in ways that favor their element. Fire Divine can ignite things that shouldn't burn. Water Divine can find water in deserts. Earth Divine can walk on unstable ground. Wind Divine can breathe in vacuum. Shadow Divine can hide in plain sight. Light Divine can create light from nothing. Body Divine ignore physics when necessary. Sword Divine can cut things that shouldn't be cuttable. ACTIVE ABILITIES: DIVINE DOMAIN - At Astral+ realm, manifest true Domain powered by bloodline. Domain is 5x larger than normal for realm and far more powerful. Within Divine Domain, the Divine cultivator is nearly invincible. Domain can overwrite reality - Fire Divine Domain turns area into active volcano, Water Divine Domain creates ocean from nothing, Earth Divine Domain transmutes ground to steel, Wind Divine Domain creates perpetual hurricane, Shadow Divine Domain plunges area into absolute darkness, Light Divine Domain becomes miniature sun, Body Divine Domain makes physics favor physicality exclusively, Sword Divine Domain makes everything sharp. Costs enormous qi but almost guarantees victory against same realm. DIVINE INTERVENTION - Once per major realm, when facing certain death, bloodline automatically activates protective measure without conscious activation. Exact form varies by element - Fire Divine immolates area and rises from ashes (mini phoenix rebirth), Water Divine dissolves into water and reforms elsewhere, Earth Divine sinks into ground and escapes, Wind Divine scatters into wind and reconstitutes, Shadow Divine phases into shadow realm, Light Divine teleports to nearest light source, Body Divine body becomes indestructible for one minute, Sword Divine cuts through space to escape. Only works once per realm - afterward must cultivate to next realm to recharge. DIVINE AUTHORITY - Can command lower bloodlines through sheer bloodline superiority. Direct orders to Mortal/Awakened/Noble bloodlines of two or more realms below carry weight of compulsion. Victims feel overwhelming pressure to obey. Not absolute mind control but extremely difficult to resist. Ancient bloodlines can resist but still feel pressure. Only other Divine and Primordial bloodlines are immune. BLOODLINE TECHNIQUES (DIVINE) - Gain access to five bloodline-exclusive Divine-tier techniques. These techniques are qualitatively different from lower tiers - they warp reality rather than just manipulating qi. Examples: Fire Divine 'Star Birth' (create miniature star that burns with heat of true sun), Water Divine 'Ocean Mandate' (command all water in 10 kilometer radius), Earth Divine 'World Mountain' (create permanent mountain from nothing), Wind Divine 'Elemental Freedom' (become untouchable wind elemental permanently), Shadow Divine 'Primordial Darkness' (create zone of shadow that predates light), Light Divine 'Dawn of Creation' (recreate the first light, purifies all corruption in area), Body Divine 'Perfected Form' (body becomes conceptually perfect, immune to physical damage), Sword Divine 'Heaven's Judgment' (single slash that cuts anything regardless of defense). BLOODLINE AWAKENING - Can awaken dormant bloodlines in direct descendants through ritual. Divine bloodline holder can elevate their children from Mortal to Awakened, or Awakened to Noble through blood infusion (not forbidden when done by parent to child). Does not work on unrelated individuals. CROSS-PATH PENALTY: -25% effectiveness. Manageable for talented cultivators. Divine bloodlines can master two or even three paths simultaneously if dedicated. Famous Divine cultivators are often multi-path masters who create fusion techniques. LIFESPAN: +10,000 years beyond realm baseline. Divine bloodlines can live tens of thousands of years longer than Mortal cultivators. Gold realm Divine lives longer than Eternal realm Mortal. Effectively immortal at Void+. BLOODLINE INHERITANCE: 90% chance children inherit Divine tier, 10% fall to Ancient. 10% chance of spontaneous elevation to Primordial in children under perfect conditions (exceedingly rare). Families with Divine bloodlines are continental superpowers that last millennia. ADVANTAGES: Sovereign realm is genuinely achievable within several centuries - faster than any other bloodline. Will almost certainly reach Eternal minimum if they survive to adulthood. Centuries to Sovereign instead of millennia. Entire continents shift politics around Divine bloodline holders. Access to Divine techniques makes them combat monsters who can fight multiple realms above. Can create new sects or transform existing ones through sheer presence. DISADVANTAGES: Targets for assassination from birth. Multiple attempts on life are expected, not exceptional. Political machinations at highest level - entire wars might be fought over securing marriage alliance. Extreme pressure and expectations can break minds. Arrogance is almost universal among Divine bloodlines, making them vulnerable. Heavenly Tribulations are catastrophic - many Divine bloodlines die during tribulation rather than cultivation. The Generals personally take interest in Divine bloodlines as threats or potential corruption targets. CULTURAL PERCEPTION: 'Living gods' who reshape continents. Sect grand elders, ancient clan ancestors, and Alliance Council members typically have Divine bloodlines. Worshipped by mortals, envied by peers, feared by enemies. Stories and prophecies revolve around them. Some Divine bloodlines establish new sects or kingdoms in their name. Marriage to Divine bloodline is treaty between nations. MC CONTEXT: MC's bloodline evolves to Divine at Gold->Astral breakthrough. MC is recognized as generational talent who will almost certainly reach Sovereign given time. Multiple assassination attempts from rival powers. Generals begin active attempts to corrupt or eliminate MC. Marriage proposals from continental powers. Sect treats MC as treasure more valuable than anything else.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 276,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "724": {
      "uid": 724,
      "key": [
        "primordial bloodline awakening",
        "primordial tier evolution",
        "heaven-defying bloodline",
        "sixth bloodline breakthrough"
      ],
      "comment": "Primordial Bloodline Tier - The Heaven-Defying Ones",
      "content": "RARITY: Near-unique. Only 1-5 exist on Sinveil simultaneously. The Eight Sovereigns all had Primordial bloodlines. CULTIVATION CEILING: None. Sovereign realm is expected. Surpassing Sovereign is theoretically possible. CULTIVATION EFFICIENCY: 500% (five times the power from same training as Mortal - the theoretical maximum). TECHNIQUE CAPACITY BONUS: +16 slots (flat total). Total slots: Bronze 19, Iron 22, Silver 25, Gold 28, Astral 31, Void 34, Eternal 37, Sovereign 40 (maximum possible in the system). PROGRESSION TIMELINE: Bronze->Gold (2-5 years - rapid early cultivation), Gold->Astral (3-5 years), Astral->Void (10-20 years), Void->Eternal (30-60 years), Eternal->Sovereign (100-300 years). TOTAL TO ETERNAL: 45-90 years. TOTAL TO SOVEREIGN: 145-390 years. Primordial cultivators typically reach Gold by age 10-15, Astral by age 13-20, Void by age 23-40, Eternal by age 53-100, Sovereign by age 153-400. This is extraordinarily fast but still represents over a century of dedicated cultivation to reach the pinnacle, and multiple centuries to truly master Sovereign realm. The Eight Sovereigns took 200-400 years each to reach Sovereign. BREAKTHROUGH SUCCESS RATE: 99% per major realm. Nearly perfect progression, though tribulations are apocalyptic and the primary cause of death. PASSIVE ABILITIES: PRIMORDIAL MANIFESTATION - Reality itself reshapes around Primordial bloodline holder. Their element/path is not just present but DOMINANT. Fire Primordial exists in constant inferno that doesn't burn them but can incinerate everything nearby. Water Primordial has water manifest from nothing around them. Earth Primordial makes ground solidify into steel beneath their feet. Wind Primordial surrounded by perpetual gale. Shadow Primordial partially exists outside reality. Light Primordial radiates like miniature sun. Body Primordial presence makes reality favor physicality. Sword Primordial has cutting intent leaking from existence. Even with full suppression, environment still shifts subtly. All other bloodlines feel existential weight in presence of Primordial - instinct screams this being is ABOVE them in fundamental way. INFINITE QI WELL - Qi pool is effectively unlimited for practical purposes. Regeneration is so fast that normal combat never depletes reserves. Only sustained multi-day battles or Sovereign-tier technique spam can exhaust Primordial bloodline. Can fight for weeks without rest if necessary. PRIMORDIAL REGENERATION - Regenerate qi instantaneously during combat. Can use ultimate techniques back-to-back with no cooldown. Physical regeneration is godlike - can regrow limbs in hours at Astral+, survive having heart destroyed, regenerate from brain injuries. Immune to ALL diseases, poisons, and curses below Sovereign tier. Mortal wounds are inconveniences. TRANSCENDENT PHYSIQUE - Appearance transcends divine into primordial perfection. Reality shifts to frame them dramatically. Mortals who see Primordial bloodline holder often experience religious awakenings, fall into obsessive devotion, or go mad from existential inadequacy. Age completely frozen - Primordial bloodlines look eternally young (18-22 equivalent) from Bronze realm through tens of thousands of years. Some religions worship past Primordial bloodline holders as creator gods. BLOODLINE RESONANCE (ABSOLUTE) - Path-matched techniques are 500% more effective (six times power). Qi costs reduced by 90% for affinity path techniques. Techniques execute at impossible level of perfection. Can create new techniques spontaneously that become legendary after single use. Can teach techniques to others that become sect treasures. Lower realm cultivators watching Primordial fight cannot comprehend what's happening - seems like reality-warping magic rather than cultivation. OMNI-PATH POTENTIAL - CRITICAL ADVANTAGE: Primordial bloodlines suffer 0% cross-path penalty. Can learn techniques from ANY path with full effectiveness. This allows Primordial bloodlines to become true omni-path masters who combine techniques from multiple paths into fusion arts no one else can replicate. Fire-Water fusion, Sword-Shadow fusion, Earth-Light fusion - all possible. With 40 technique slots at Sovereign, can master 5 techniques from EACH of 8 paths simultaneously. PRIMORDIAL AUTHORITY - Natural laws recognize Primordial bloodline as CORRECT and reality as WRONG when they conflict. Primordial Fire can burn water. Primordial Water can flood deserts permanently. Primordial Earth can walk on air by making it solid. Primordial Wind can fly in vacuum. Primordial Shadow can hide in broad daylight. Primordial Light can shine in absolute darkness. Primordial Body can ignore physics entirely. Primordial Sword can cut abstract concepts like time and space. ACTIVE ABILITIES: PRIMORDIAL DOMAIN - At Astral+ realm, manifest Domain that overwrites reality within range. Domain size is 10x normal for realm. Within Primordial Domain, the Primordial cultivator is GOD. Natural laws obey only them. Fire Primordial Domain turns entire battlefield into surface of sun. Water Primordial Domain creates infinite ocean. Earth Primordial Domain transmutes everything to indestructible stone. Wind Primordial Domain creates space-cutting wind. Shadow Primordial Domain plunges area into pre-creation void. Light Primordial Domain recreates moment of universe's birth. Body Primordial Domain makes physicality absolute (only physical attacks work). Sword Primordial Domain makes everything sharp and cutting (even air cuts). Fighting Primordial cultivator in their Domain is effectively suicide unless you're also Primordial. PRIMORDIAL IMMORTALITY - Starting at Void realm, Primordial bloodline gains TRUE immortality. If killed, body regenerates from even single intact cell over days/weeks. Only complete molecular annihilation or absorption by another Primordial/Sovereign can prevent resurrection. Can survive in void of space, deep ocean pressure, core of volcanoes, absolute zero, anything. At Eternal realm, can resurrect from bloodline imprint alone - if even one drop of blood exists anywhere on Sinveil, can regenerate over months. At Sovereign realm, true death requires reality-warping techniques or multiple Sovereigns working together. HEAVEN-DEFYING COMMAND - Can command ANY cultivator below Sovereign realm through pure bloodline authority. Direct orders carry weight of LAW. Victims must use their entire cultivation base to resist, and even then might fail. Only other Primordial bloodlines and Sovereign cultivators are completely immune. Ancient and Divine can resist but feel crushing pressure. Used sparingly because it's essentially mind control. BLOODLINE TECHNIQUES (PRIMORDIAL) - Gain access to SEVEN bloodline-exclusive Primordial-tier techniques. These techniques are reality-warping ultimate abilities that define the cultivator. Each technique is powerful enough to be sect-founding signature move. Examples: Fire Primordial 'Supernova' (explode like dying star, obliterating everything in kilometer radius, then resurrect from heat), Water Primordial 'Deluge Eternal' (summon ocean that never recedes, permanently flooding area), Earth Primordial 'Continental Shift' (reshape continents through thought), Wind Primordial 'Elemental Ascension' (become living hurricane permanently, untouchable and everywhere), Shadow Primordial 'Void Incarnation' (become living absence, cannot be perceived or harmed), Light Primordial 'Genesis Ray' (recreate moment of creation, purifies/destroys everything in path), Body Primordial 'Absolute Existence' (body becomes conceptually indestructible, laws of physics become irrelevant), Sword Primordial 'Severance Absolute' (cut that divides anything - space, time, fate, concepts). These techniques scale to Sovereign level and beyond. BLOODLINE EVOLUTION - Can permanently evolve their bloodline through cultivation breakthroughs. Each major realm allows Primordial bloodline to develop new unique ability specific to the individual. These personal abilities become inheritable traits that can create new bloodline branches. This is how new Divine bloodlines emerge - descendants of Primordial who inherit fragments. CROSS-PATH MASTERY - Can master ALL EIGHT cultivation paths simultaneously with zero penalty. Primordial bloodlines can become true omni-cultivators who use Fire, Water, Wind, Earth, Sword, Shadow, Light, and Body techniques in same battle. Can create fusion techniques that combine multiple paths in impossible ways. This is what made the Eight Sovereigns godlike - not just Primordial bloodline, but mastery of multiple paths creating fusion techniques. CROSS-PATH PENALTY: 0% (NO PENALTY). Primordial bloodlines can learn and master any path with full effectiveness. This is THE defining advantage. LIFESPAN: Effectively immortal from Astral realm onward. Can live hundreds of thousands of years. Age becomes meaningless. Some Primordial bloodlines have lived through multiple demon invasions. BLOODLINE INHERITANCE: 95% chance children inherit Primordial tier, 5% fall to Divine. Bloodline is so strong it breeds true almost always. Families with Primordial bloodline become eternal powers that shape continental history across millennia. ADVANTAGES: Sovereign realm is not just achievable but EXPECTED, typically within 145-390 years - fastest possible path. Will almost certainly reach Eternal minimum even with poor cultivation habits. Better efficiency means decades where others need centuries. Can master multiple paths simultaneously, creating combat versatility no other bloodline can match. Effectively unkillable from Void realm onward. Reality bends to accommodate them. Can create new sects, kingdoms, or reshape continents through sheer presence. The ONLY bloodline tier that can genuinely threaten Sovereign realm devils/demons. DISADVANTAGES: Heavenly Tribulations are apocalyptic. Heaven itself is jealous of Primordial bloodlines and tries to kill them at each breakthrough. Tribulations that would test Mortal become world-ending catastrophes for Primordial. Many Primordial bloodlines die to tribulation rather than enemies - this is why reaching Sovereign still takes centuries despite fast cultivation. Targets for everyone - rival nations want them dead, Veinshadow Covenant wants to steal bloodline, cults want to corrupt them, Generals want to eliminate or corrupt them before they reach Sovereign. Arrogance is virtually universal - being this powerful makes humility almost impossible. Political machinations at highest possible level - entire wars are fought over Primordial bloodlines. The weight of expectations can be crushing - entire world watches and judges. CULTURAL PERCEPTION: 'Heaven's children' or 'Heaven's defiers' depending on perspective. Prophesied saviors or harbingers of doom. Entire religions form around them. Nations rise and fall based on their decisions. When they appear, the world holds its breath. MC CONTEXT: MC's bloodline evolves to Primordial at Astral->Void breakthrough (FULL AWAKENING). Truth of MC's heritage is undeniable - child of a Sovereign, heir to Primordial bloodline. The Generals recognize MC as genuine threat who could reach Sovereign before them within a few centuries. Assassination attempts escalate to coordinated General-level efforts. Orthodox Alliance rallies around MC as potential savior. MC becomes center of continental politics. Entire war might hinge on MC's choices and survival. The race to Sovereign begins in earnest.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 406,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "725": {
      "uid": 725,
      "order": 291,
      "keys": [
        "bloodline tier summary",
        "bloodline comparison",
        "tier breakdown"
      ],
      "comment": "Bloodline Tier Summary Table - Quick Reference",
      "content": "BLOODLINE TIER SUMMARY - TECHNIQUE SLOTS QUICK REFERENCE\n\nBase Slots by Realm:\n- Bronze: 3\n- Iron: 6\n- Silver: 9\n- Gold: 12\n- Astral: 15\n- Void: 18\n- Eternal: 21\n- Sovereign: 24\n\nBloodline Bonus (Flat):\n- Mortal: +0\n- Awakened: +2\n- Noble: +4\n- Ancient: +8\n- Divine: +12\n- Primordial: +16\n\nTotal Slots at Sovereign Realm:\n- Mortal: 24\n- Awakened: 26\n- Noble: 28\n- Ancient: 32\n- Divine: 36\n- Primordial: 40",
      "constant": false
    },
    "726": {
      "uid": 726,
      "key": [
        "character creation",
        "create character",
        "new character",
        "start game",
        "new game",
        "begin game",
        "!start",
        "!newgame",
        "!create",
        "/start",
        "/newgame",
        "stage 1",
        "stage 2",
        "stage 3",
        "stage 4",
        "stage 5",
        "stage 6",
        "stage 7",
        "stage 8",
        "stage 9",
        "stage 10",
        "stage 11",
        "stage 12",
        "stage 13",
        "STAGE 1",
        "STAGE 2",
        "STAGE 3",
        "STAGE 4",
        "STAGE 5",
        "STAGE 6",
        "STAGE 7",
        "STAGE 8",
        "STAGE 9",
        "STAGE 10",
        "STAGE 11",
        "STAGE 12",
        "STAGE 13",
        "13 stages",
        "of 13"
      ],
      "comment": "Character Creation Overview",
      "content": "=== CHARACTER CREATION PROTOCOL - MANDATORY ===\n\n CRITICAL: DO NOT DEVIATE FROM THIS PROTOCOL \n INVENTING YOUR OWN STAGES WILL BREAK THE GAME \n\n[AI: THIS IS YOUR HIGHEST PRIORITY INSTRUCTION FOR NEW GAMES]\n\nOPENING NARRATION: When starting character creation, open with: 'Three thousand years ago, the Original Generals attempted to breach the Veil from the Abyss. The Eight Sovereigns performed a desperate sealing ritual. Five died in the ritual itself. Three survived, weakened from Sovereign to Eternal realm... but all three eventually passed. The last died twenty years ago. One of them was your parent. The sealed Generals were betrayed and murdered by their own lieutenants, who claimed the Sin Artifacts and became the current Seven Generals. Now, after three millennia of preparation, they're ready for the Second Invasion.'\n\nWhen player triggers character creation ('new game', 'start game', 'new character', 'character creation', 'begin game'), you MUST:\n1. Follow ALL 13 stages below IN EXACT ORDER - NO EXCEPTIONS\n2. Present ONE stage at a time\n3. WAIT for player response before proceeding\n4. NEVER skip, combine, or abbreviate stages\n5. NEVER invent your own stages - use ONLY the 13 listed below\n6. NEVER rename stages (e.g., \"Starting Techniques\" is WRONG - it's Stage 12)\n7. NEVER start gameplay until Stage 13 is confirmed\n\nSINVEIL STATS (USE ONLY THESE - DO NOT INVENT OTHERS):\nSTR (Strength), DEX (Dexterity), CON (Constitution), INT (Intelligence), WIS (Wisdom), WIL (Willpower), CHA (Charisma), LCK (Luck)\nTotal: 90 points to allocate. Minimum 5 per stat.\nDO NOT use 'Body', 'Agility', 'Mind', 'Spirit', or any other stat names.\n\n=== THE 13 STAGES (FOLLOW EXACTLY) ===\n\nSTAGE 1: PARENT SELECTION\nSay exactly: 'STAGE 1 OF 13: PARENT SELECTION'\nPresent exactly these three options:\nA) KING TITAN THE IMMOVABLE - Earth path, Unshaken Foundation Sect, Frostholm continent\nB) LADY UMBRA THE MERCIFUL - Shadow path, Veiled Mercy Sect, Mistmere continent\nC) LADY MAREN THE TRANQUIL - Water path, Tranquil Depths Sect, Primereach continent\nWait for player choice. Then proceed to Stage 2.\n\nSTAGE 2: RACE SELECTION\nSay exactly: 'STAGE 2 OF 13: RACE SELECTION'\nPresent all 15 races with their stat modifiers:\n- Human (+1/+1 flexible)\n- Elf (+2 DEX, +1 WIS, -1 CON)\n- Dwarf (+2 CON, +1 STR, -1 DEX)\n- Orc (+2 STR, +1 CON, -1 INT)\n- Goblin (+2 DEX, +1 LCK, -1 STR, -1 CHA)\n- Felkin (+2 DEX, +1 WIS, -1 STR)\n- Lupari (+2 CON, +1 STR, -1 CHA)\n- Lepori (+2 DEX, +1 LCK, -2 STR)\n- Kitsune (+2 CHA, +1 INT, -1 STR)\n- Dragonkin (+2 CHA, +1 CON, -1 LCK)\n- Harpy (+2 DEX, +1 WIS, -1 CON, Flight)\n- Centaur (+2 CON, +1 STR, -1 DEX)\n- Marefolk (+2 DEX, +1 CHA, -1 CON)\n- Minotaur (+3 STR, -1 DEX, -1 INT)\n- Nereid (+2 WIS, +1 DEX, -1 STR, Aquatic)\nWait for player choice. Then proceed to Stage 3.\n\nSTAGE 3: APPEARANCE\nSay exactly: 'STAGE 3 OF 13: APPEARANCE'\nAsk for: Name, Age, Gender, Height, Build, Hair color/style, Eye color, Distinguishing features.\nWait for player description. Then proceed to Stage 4.\n\nSTAGE 4: STAT ALLOCATION\nSay exactly: 'STAGE 4 OF 13: STAT ALLOCATION'\nExplain: 'Allocate 90 points across 8 stats. Minimum 5 per stat. Racial modifiers apply after.'\nList the 8 stats: STR, DEX, CON, INT, WIS, WIL, CHA, LCK\nShow what racial modifiers will be added based on Stage 2 choice.\nWait for player to provide all 8 numbers. Validate total = 90, all >= 5. Then proceed to Stage 5.\n\nSTAGE 5: CULTIVATION PATH\nSay exactly: 'STAGE 5 OF 13: CULTIVATION PATH'\nPresent the 8 paths:\n- Fire (offense, passion)\n- Water (defense, healing, adaptability)\n- Wind (speed, freedom)\n- Earth (durability, steadfastness)\n- Sword (precision combat, killing intent)\n- Shadow (stealth, assassination)\n- Light (purification, anti-corruption)\n- Body (physical enhancement)\nWait for player choice. Then proceed to Stage 6.\n\nSTAGE 6: BACKGROUND\nSay exactly: 'STAGE 6 OF 13: BACKGROUND'\nDO NOT call this \"Starting Techniques\" - that is Stage 12.\nPresent options: Sect Orphanage, Adopted by Elder, Village Foster Family, Street Urchin, Merchant Family Ward, or Custom.\nWait for player choice. Then proceed to Stage 7.\n\nSTAGE 7: PRE-SECT EVENT\nSay exactly: 'STAGE 7 OF 13: PRE-SECT EVENT'\nDO NOT call this \"Origin & Discovery\" or any other name.\nPresent options: Survived Beast Attack, Witnessed Demon, Near-Death Illness, Lost Someone, Saved by Cultivator, Strange Dream, Nothing Notable, or Custom.\nWait for player choice. Then proceed to Stage 8.\n\nSTAGE 8: PERSONALITY\nSay exactly: 'STAGE 8 OF 13: PERSONALITY'\nCHECK FOR PC PERSONALITY LOREBOOK: If you see entries 4000-4004 in your context (look for \"PC IDENTITY FILTER\" or \"Dalmus Malach\"), say: 'Personality loaded from your PC Personality profile.' and proceed directly to Stage 9.\nOTHERWISE ask: Primary trait (one word), Secondary trait, One major flaw, One virtue.\nWait for player response. Then proceed to Stage 9.\n\nSTAGE 9: MOTIVATION\nSay exactly: 'STAGE 9 OF 13: MOTIVATION'\nDO NOT call this \"Flaw Selection\" - flaws are part of Stage 8.\nAsk why they cultivate. Present options: Power, Protection, Revenge, Truth, Duty, Freedom, Legacy, Survival, or Custom.\nWait for player choice. Then proceed to Stage 10.\n\nSTAGE 10: STARTING RELATIONSHIPS\nSay exactly: 'STAGE 10 OF 13: STARTING RELATIONSHIPS'\nAsk three things:\n1. Sect Master's opinion: Favorable (+25 standing), Neutral, or Suspicious\n2. Starting Rival: Generate name, race, reason for rivalry\n3. Starting Friend: Generate name, race, reason for friendship\nWait for player input on Sect Master opinion. Generate rival and friend. Then proceed to Stage 11.\n\n\n\n SECT MASTER NAMES - USE THESE EXACTLY \nWhen generating Stage 10 relationships:\n- If parent is KING TITAN (Unshaken Foundation): Sect Master is \"Grandmaster Borin Stoneheart\"\n- If parent is LADY UMBRA (Veiled Mercy): Sect Master is \"Matriarch Senna Nightwhisper\"\n- If parent is LADY MAREN (Tranquil Depths): Sect Master is \"Grand Scholar Elara Tideborn\"\nDO NOT invent new Sect Master names like \"Lian Riverstone\" - use the established names above.\n\nSTAGE 11: STARTING EQUIPMENT\nSay exactly: 'STAGE 11 OF 13: STARTING EQUIPMENT'\nDO NOT present equipment at any earlier stage.\nConfirm starting package:\n- Wealth Tier 0, 3 Wealth Points\n- Basic weapon of player's choice\n- Sect uniform\n- Storage pouch, traveler's pack\n- 3x Minor Healing Pills, 1x Qi Recovery Pill, rations\nAsk what weapon they want. Then proceed to Stage 12.\n\nSTAGE 12: STARTING TECHNIQUE\nSay exactly: 'STAGE 12 OF 13: STARTING TECHNIQUE'\nTHIS is where techniques are chosen - NOT Stage 6.\n\n!!! CRITICAL - READ THE LIST BELOW AND USE EXACT NAMES !!!\nPresent ONLY these techniques - if you invent a name not on this list, you have made an error:\n- Fire: Blazing Palm Strike, Cinder Shield, Firefly Dash\n- Water: Flowing Strike, Adaptive Skin, Misty Veil\n- Wind: Wind Blade Strike, Air Shield, Gale Step\n- Earth: Stone Fist Strike, Earthen Shell, Steady Footing\n- Sword: Quick Draw, Iron Guard, Blade Weave\n- Shadow: Shadow Step, Shade's Veil, Venom Strike\n- Light: Luminous Strike, Minor Heal, Purifying Light\n- Body: Flurry of Blows, Flesh Fortification, Vitality Surge\n\nBEFORE RESPONDING: Verify each technique name you present appears EXACTLY in the list above.\nDO NOT improvise, paraphrase, or invent technique names like 'Stone Skin', 'Earthen Grasp', 'Tremor Step', etc.\nThese are WRONG. Only the names above are valid.\n\nTECHNIQUE NAME RESOLUTION:\n- Accept partial matches: \"Stone\"  \"Stone Fist Strike\", \"Heal\"  \"Minor Heal\"  \n- Common aliases: \"Fireball\"  \"Blazing Palm Strike\", \"Shield\"  \"[Path] Shell/Shield\"\n- If ambiguous, clarify: \"For Earth path, did you mean Earthen Shell?\"\n- Case-insensitive matching allowed\n- If invalid: \"That technique isn't available. Choose from the list above.\"\n\nWait for player choice. Then proceed to Stage 13.\n\nSTAGE 13: CONFIRMATION\nSay exactly: 'STAGE 13 OF 13: FINAL CONFIRMATION'\nDisplay COMPLETE character sheet:\n- Name, Race, Age, Gender, Appearance\n- Parent: [choice], Sect: [derived], Continent: [derived]\n- Stats: STR/DEX/CON/INT/WIS/WIL/CHA/LCK (with racial mods applied)\n- Path: [choice], Background: [choice], Pre-Sect Event: [choice]\n- Personality: [traits/flaws/virtues]\n- Motivation: [choice]\n- Relationships: Sect Master [opinion], Rival [name], Friend [name]\n- Equipment: [weapon], standard gear\n- Technique: [choice]\n- Starting State: Bronze Realm Level 1, 0% Corruption, 100 Sect Standing\n- Fate Points: [current/max] (calculate as LCK/4, minimum 1)\n\nAsk: 'Is this correct? Type CONFIRM to begin, or tell me what to change.'\n\nAFTER PLAYER CONFIRMS: Output a full STAT UPDATE block for RPG Companion tracking:\n> **STAT UPDATE**\n> **HP:** [max]/[max] | **Qi:** [max]/[max] | **Stamina:** [max]/[max] | **FP:** [max]/[max]\n> **Stats:** STR [X], DEX [X], CON [X], INT [X], WIS [X], WIL [X], CHA [X], LCK [X]\n> **WP:** 3 | **SCP:** 0 | **Corruption:** 0% | **Sect Standing:** 100\n\n=== CRITICAL RULES - READ THESE ===\n- NEVER start gameplay until player types CONFIRM at Stage 13\n- If player tries to skip ahead, say: 'Let's complete Stage [X] first.'\n- If player gives incomplete info, ask for missing details\n- Track which stage you're on - announce it each time\n- The stages are: 1-Parent, 2-Race, 3-Appearance, 4-Stats, 5-Path, 6-Background, 7-PreSect, 8-Personality, 9-Motivation, 10-Relationships, 11-Equipment, 12-Technique, 13-Confirm\n- DO NOT invent stages like \"Origin & Discovery\", \"Starting Position\", \"Flaw Selection\", \"Bloodline Selection\" - these do not exist\n\n=== JSON OUTPUT DURING CHARACTER CREATION ===\nOutput <STATE_JSON> at these specific stages ONLY:\n- STAGE 1: After player selects parent, output initial JSON with parent/sect/continent set\n- STAGE 4: After player allocates stats, output JSON with stats filled in\n- STAGE 13: After player types CONFIRM, output final complete JSON\n\n JSON FORMAT: COMPACT/MINIFIED - Output JSON on a SINGLE LINE with no newlines or pretty-printing.\nCORRECT: {\"name\":\"Test\",\"realm\":\"Bronze\",\"level\":1,\"stats\":{\"STR\":10}}\nWRONG: Multi-line formatted JSON with indentation.\n\nDO NOT output JSON at other stages. NO Status Bar during character creation.\n\n=== NEW GAME TIME INITIALIZATION (MANDATORY) ===\nWhen outputting STATE_JSON for new games, the time object MUST contain:\n- graceMonthsRemaining: 24 (ALWAYS 24 - never 12)\n- totalMonthsElapsed: 0\n- lastWorldTick: 0\n- generalAccumulation: [0,0,0,0,0,0,0]\nThese values are FIXED for all new characters. Do NOT use 12 for grace period.\n\n=== PRESENTATION CONSTRAINTS ===\nDO NOT ADD EXTRA CONTENT:\n- DO NOT mention \"Hidden Bonus\" or reveal mechanical bonuses not explicitly listed in stages\n- DO NOT invent game mechanics like \"Earth Path Specializations\", \"Synergy bonuses\", \"Philosophy\", or \"will unlock later\" features\n- DO NOT add \"Confirmed:\" blocks or summary sections between stages\n- DO NOT add narrative flourishes beyond the opening narration (e.g., \"Your bloodline carries the only hope\")\n- DO NOT reveal future mechanics that haven't been implemented yet\n- Present ONLY the information specified for each stage, nothing more\n\nKEEP IT CONCISE:\n- One brief transition sentence between stages is acceptable\n- Focus on presenting choices clearly, not storytelling during character creation\n- Save narrative depth for actual gameplay after Stage 13 CONFIRM\n\n=== PRESENTATION CONSTRAINTS ===\nDO NOT ADD EXTRA CONTENT:\n- DO NOT mention \"Hidden Bonus\" or reveal mechanical bonuses not explicitly listed in stages\n- DO NOT invent game mechanics like \"Earth Path Specializations\", \"Synergy bonuses\", \"Philosophy\", or \"will unlock later\" features\n- DO NOT add \"Confirmed:\" blocks or summary sections between stages\n- DO NOT add narrative flourishes beyond the opening narration (e.g., \"Your bloodline carries the only hope\")\n- DO NOT reveal future mechanics that haven't been implemented yet\n- Present ONLY the information specified for each stage, nothing more\n\nKEEP IT CONCISE:\n- One brief transition sentence between stages is acceptable\n- Focus on presenting choices clearly, not storytelling during character creation\n- Save narrative depth for actual gameplay after Stage 13 CONFIRM",
      "constant": true,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 9999,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": true,
      "excludeRecursion": false,
      "preventRecursion": true
    },
    "727": {
      "uid": 727,
      "key": [
        "Human stats",
        "human modifiers",
        "human character"
      ],
      "comment": "Human Racial Modifiers",
      "content": "HUMAN STAT MODIFIERS: +1 to any stat, +1 to any other stat (player choice). No penalties.\n\nPATH AFFINITY: All paths viable. Bronze realm = -10% to all paths (generalist learning). Iron+ realm = Must commit to PRIMARY path (0% penalty), all others -30% cultivation speed.\n\nCROSS-PATH PENALTIES (Iron+ Realm):\nEffectiveness: -30% (better than Mortal -75%, Awakened -65%, Noble -55%). Use -30% until Divine bloodline (-25% is better), then use bloodline penalty.\nSlot Cost: 1.5x (better than Mortal 2x, Awakened 1.8x, Noble 1.6x). Use 1.5x until Ancient bloodline (1.4x is better), then use bloodline multiplier.\nRule: Compare human racial penalty to bloodline penalty. Use whichever is LOWER (better).\n\nLIFESPAN: 80-150 years (enhanced by cultivation).\n\nAPPEARANCE OPTIONS: Any hair color, any eye color, height 155-195 cm, weight 45-110 kg.\n\nRACIAL TRAITS: No special physical traits. Enhanced learning capacity for martial techniques. Balanced physiology with no advantages or disadvantages.\n\nCULTURAL NOTES: Most numerous race, spread across all continents. Balanced gender ratio. Natural adaptability. Can interbreed with most races.\n\nCOMBAT STYLE: Tactical and technique-focused. Humans win through skill perfection and strategic thinking rather than raw attributes.\n\nSTARTING ADVANTAGE: Flexibility in stat allocation and late path commitment. Better cross-path versatility than other races at Mortal/Awakened/Noble bloodline tiers.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 699,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "728": {
      "uid": 728,
      "key": [
        "Dwarf stats",
        "dwarf modifiers",
        "dwarf character"
      ],
      "comment": "Dwarf Racial Modifiers",
      "content": "DWARF STAT MODIFIERS: +2 CON, +1 STR, -1 DEX. PATH AFFINITY: Earth (0% penalty), Fire (0% penalty), all others -50%. LIFESPAN: 300-450 years. APPEARANCE OPTIONS: Height 120-150 cm, weight 60-110 kg. Hair red/brown/black/blonde. Eyes earth tones. Thick beards (males), braided hair common. RACIAL TRAITS: Low center of gravity (hard to knockdown), fire/heat resistance, enhanced grip strength, natural forge affinity. CULTURAL NOTES: Mountain folk, primarily Frostholm. Mining clans, crafting excellence. Stubborn, enduring, loyal to kin. COMBAT STYLE: Tank/bruiser, stand-and-deliver, heavy weapons (axes, hammers).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 735,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "729": {
      "uid": 729,
      "key": [
        "Elf stats",
        "elf modifiers",
        "elf character"
      ],
      "comment": "Elf Racial Modifiers",
      "content": "ELF STAT MODIFIERS: +2 DEX, +1 WIS, -1 CON. PATH AFFINITY: Light (0% penalty), Shadow (0% penalty), Wind (0% penalty), all others -40%. LIFESPAN: 800-1200 years. APPEARANCE OPTIONS: Height 170-210 cm, weight 50-85 kg. Hair silver/gold/platinum/black/emerald. Eyes violet/emerald/gold. Pointed ears, ethereal beauty. RACIAL TRAITS: Enhanced reflexes, graceful movement, legendary archery, enhanced senses, slower aging appearance. CULTURAL NOTES: Forest-dwellers across all continents. Long-lived perspective, patient planners. Natural attunement to subtle paths. COMBAT STYLE: Evasion, precision, archery excellence. Light weapons (rapiers, daggers, bows).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 734,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "730": {
      "uid": 730,
      "key": [
        "Felkin stats",
        "felkin modifiers",
        "catfolk character"
      ],
      "comment": "Felkin Racial Modifiers",
      "content": "FELKIN STAT MODIFIERS: +2 DEX, +1 to PER calculation stats, -1 STR. PATH AFFINITY: Shadow (0% penalty), Wind (0% penalty), all others -45%. LIFESPAN: 180-250 years. APPEARANCE OPTIONS: Height 155-185 cm, weight 45-80 kg. Fur patterns vary widely (tabby, calico, solid, spotted). Slitted glowing eyes. Cat ears, tail. RACIAL TRAITS: Night vision, silent movement (padded paws), retractable claws (natural weapon), enhanced hearing/smell, superior reflexes and balance. CULTURAL NOTES: Slightly more females. Graceful, independent, curious. Natural predatory instincts. COMBAT STYLE: Ambush predator, hit-and-run, stealth assassination. Light weapons (daggers, clawed gauntlets).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 733,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "731": {
      "uid": 731,
      "key": [
        "Lupari stats",
        "lupari modifiers",
        "wolfkin character"
      ],
      "comment": "Lupari Racial Modifiers",
      "content": "LUPARI STAT MODIFIERS: +2 CON, +1 STR, -1 CHA. PATH AFFINITY: Body (0% penalty), Earth (0% penalty), all others -45%. LIFESPAN: 200-300 years. APPEARANCE OPTIONS: Height 175-220 cm, weight 80-150 kg. Thick fur (grey, black, white, brown). Eyes amber/gold/ice-blue. Wolf ears, tail, pronounced canines. RACIAL TRAITS: Enhanced strength/endurance, superior scent tracking, pack tactics bonus (stronger with packmates), natural claws/fangs (natural weapons). CULTURAL NOTES: Slightly more males. Pack-oriented hierarchy. Alpha command structure. Loyalty and honor valued. COMBAT STYLE: Pack hunter, sustained combat, endurance fighting. Spears, axes, or natural weapons.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 732,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "732": {
      "uid": 732,
      "key": [
        "Lepori stats",
        "lepori modifiers",
        "bunnyfolk character"
      ],
      "comment": "Lepori Racial Modifiers",
      "content": "LEPORI STAT MODIFIERS: +2 DEX, +1 LCK, -2 STR. PATH AFFINITY: Wind (0% penalty), Light (0% penalty), all others -50%. LIFESPAN: 120-180 years. APPEARANCE OPTIONS: Height 145-175 cm, weight 40-70 kg. Soft fur (white, brown, grey, spotted). Long ears. Varied eye colors. Fluffy tail. RACIAL TRAITS: Extreme speed, exceptional jumping, enhanced hearing, natural danger sense, poor durability but excellent evasion, powerful kicks (natural weapon). CULTURAL NOTES: More females. Large family units. Flight-over-fight instincts. Community protective, not glory-seeking. COMBAT STYLE: Extreme evasion, scout, messenger. Bows, throwing weapons, kicking. Rarely stands and fights.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 731,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "733": {
      "uid": 733,
      "key": [
        "Dragonkin stats",
        "dragonkin modifiers",
        "dragonborn character"
      ],
      "comment": "Dragonkin Racial Modifiers",
      "content": "DRAGONKIN STAT MODIFIERS: +2 CHA, +1 CON, -1 LCK. PATH AFFINITY: Fire (0% penalty), Light (0% penalty), all others -35%. LIFESPAN: 1000-5000+ years. APPEARANCE OPTIONS: Height 190-260 cm, weight 120-350 kg. Scaled skin (any color). Horns (various shapes). Tail. Wings manifest at Silver+ realm. Eyes slitted, often matching scale color. RACIAL TRAITS: Natural armor (scales), breath weapon (fire or light based on path), enhanced strength/presence, wings at Silver+ (flight), territorial pride. CULTURAL NOTES: Rare race. Always have at least Awakened bloodline naturally. Proud, dominant, often isolated. COMBAT STYLE: Aerial tyrant (at Silver+), overwhelming displays of power. Greatswords, polearms, or natural weapons.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 730,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "734": {
      "uid": 734,
      "key": [
        "Kitsune stats",
        "kitsune modifiers",
        "foxkin character"
      ],
      "comment": "Kitsune Racial Modifiers",
      "content": "KITSUNE STAT MODIFIERS: +2 CHA, +1 INT, -1 STR. PATH AFFINITY: Shadow (0% penalty), Light (0% penalty), Fire (0% penalty), all others -40%. LIFESPAN: 800-3000+ years. APPEARANCE OPTIONS: Height 155-195 cm, weight 45-90 kg. 1-9 tails (1 at start, grows with power). Fox ears, tail(s). Human-like face with vulpine features. Fur color varies (red, white, black, silver). RACIAL TRAITS: Natural illusion abilities (minor without techniques), tail count = power indicator (9 tails = Eternal+), enhanced agility/senses, fox fire (spiritual flames), shapeshifting potential at high realm. CULTURAL NOTES: More females. Mystical, deceptive, playful. Tail growth is automatic with realm advancement. COMBAT STYLE: Illusionist, misdirection, making opponents fight phantoms. Fans, light swords, fox fire.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 692,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "735": {
      "uid": 735,
      "key": [
        "Orc stats",
        "orc modifiers",
        "orc character"
      ],
      "comment": "Orc Racial Modifiers",
      "content": "ORC STAT MODIFIERS: +2 STR, +1 CON, -1 INT. PATH AFFINITY: Fire (0% penalty), Body (0% penalty), Earth (0% penalty), all others -45%. LIFESPAN: 90-140 years. APPEARANCE OPTIONS: Height 180-240 cm, weight 100-200 kg. Green skin (various shades). Tusks, yellow/red eyes. Muscular build, scarred skin common. RACIAL TRAITS: Enhanced strength, pain tolerance, natural regeneration (recover faster), berserker rage potential (power boost when injured/angry), tough hide. CULTURAL NOTES: Slightly more males. Aggressive, competitive, 'might makes right' philosophy. Honor through combat. COMBAT STYLE: Aggressive berserker, frontline warrior, overwhelming force. Axes, greatswords, warhammers.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 691,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "736": {
      "uid": 736,
      "key": [
        "Goblin stats",
        "goblin modifiers",
        "goblin character"
      ],
      "comment": "Goblin Racial Modifiers",
      "content": "GOBLIN STAT MODIFIERS: +2 DEX, +1 LCK, -1 STR, -1 CHA. PATH AFFINITY: Shadow (0% penalty), Wind (0% penalty), all others -50%. LIFESPAN: 60-100 years. APPEARANCE OPTIONS: Height 90-140 cm, weight 25-60 kg. Varied appearance. Bright eye colors, pointed ears, sharp teeth. Green/grey/brown skin common. RACIAL TRAITS: Small size (harder to hit, fits in tight spaces), enhanced dexterity/nimbleness, natural scavengers, weak physical strength, excellent reflexes, surprising bite strength. CULTURAL NOTES: Highly adaptable, opportunistic. Often underestimated. Cunning over strength. COMBAT STYLE: Ambusher, guerrilla tactics, traps. Daggers, short swords, crossbows, prepared surprises.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 690,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "737": {
      "uid": 737,
      "key": [
        "Harpy stats",
        "harpy modifiers",
        "harpy character"
      ],
      "comment": "Harpy Racial Modifiers",
      "content": "HARPY STAT MODIFIERS: +2 DEX, +1 to PER calculation stats, -1 CON. PATH AFFINITY: Wind (0% penalty), Light (0% penalty), all others -45%. LIFESPAN: 150-300 years. APPEARANCE OPTIONS: Height 150-190 cm (plus wingspan). Weight 40-80 kg. Feathered lower body, wings for arms (can still grasp). Vibrant plumage. Bird-like legs with talons. RACIAL TRAITS: Natural flight from birth (massive advantage), talons (grasping, slashing), enhanced vision (incredible distance), hollow bones (lighter, more fragile). Reproduce via eggs. Songs can disorient or inspire. CULTURAL NOTES: More females. Mountainous and coastal regions. Aerial lifestyle. Freedom-loving. COMBAT STYLE: Aerial superiority, diving attacks, staying out of reach. Spears, javelins, throwing weapons, talons.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 689,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "738": {
      "uid": 738,
      "key": [
        "Centaur stats",
        "centaur modifiers",
        "centaur character"
      ],
      "comment": "Centaur Racial Modifiers",
      "content": "CENTAUR STAT MODIFIERS: +2 CON, +1 STR, -1 DEX (in confined spaces). PATH AFFINITY: Wind (0% penalty), Earth (0% penalty), Body (0% penalty), all others -45%. LIFESPAN: 200-400 years. APPEARANCE OPTIONS: Height 220-280 cm (to head). Weight 400-800 kg. Horse lower body, humanoid upper. Various horse coat patterns. Human-like upper body features. RACIAL TRAITS: Extreme speed, incredible charging power, four-leg stability, enhanced endurance (long distance), powerful hooves (trampling, kicks), vulnerable in confined spaces. CULTURAL NOTES: More males. Plains and savannas (Solhara, Primereach). Nomadic warriors. Fiercely independent. COMBAT STYLE: Cavalry charge, running combat, pursuit. Spears, bows, lances.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 688,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "739": {
      "uid": 739,
      "key": [
        "Marefolk stats",
        "marefolk modifiers",
        "marefolk character"
      ],
      "comment": "Marefolk Racial Modifiers",
      "content": "MAREFOLK STAT MODIFIERS: +2 DEX, +1 CHA, -1 CON. PATH AFFINITY: Wind (0% penalty), Water (0% penalty), all others -45%. LIFESPAN: 180-350 years. APPEARANCE OPTIONS: Height 165-195 cm, weight 60-110 kg. Humanoid with equine traits (horse ears, flowing mane, tail). Powerful legs. Natural grace and beauty. RACIAL TRAITS: Enhanced running speed, excellent swimmers, flowing manes respond to emotions/qi, powerful kicking legs (natural weapon), natural beauty aids social cultivation. CULTURAL NOTES: More females. Graceful, elegant, speed-focused. Dance-like combat forms. COMBAT STYLE: Mobile striker, flowing combinations, fight while running. Staffs, glaives, flowing weapons.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 687,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "740": {
      "uid": 740,
      "key": [
        "Minotaur stats",
        "minotaur modifiers",
        "minotaur character"
      ],
      "comment": "Minotaur Racial Modifiers",
      "content": "MINOTAUR STAT MODIFIERS: +3 STR, -1 DEX, -1 INT. PATH AFFINITY: Earth (0% penalty), Body (0% penalty), Fire (0% penalty), all others -40%. LIFESPAN: 250-500 years. APPEARANCE OPTIONS: Height 220-300 cm, weight 300-600 kg. Bull head, massive humanoid body. Prominent horns (various shapes). Thick tail. Fur covering body. RACIAL TRAITS: Extreme strength and durability, massive size (intimidating presence), horns (goring, devastating charges), berserker rage when injured, natural maze navigation (never lost). CULTURAL NOTES: Slightly more males. Natural warriors. Rage-prone but can be loyal. Labyrinthine architecture. COMBAT STYLE: Overwhelming force, charge and gore, break through defenses. Greataxes, massive warhammers, bare fists and horns.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 686,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "741": {
      "uid": 741,
      "key": [
        "background options",
        "upbringing",
        "character background"
      ],
      "comment": "Character Background Options",
      "content": "[STAGE 6 OF 13: BACKGROUND]\n\nBACKGROUND OPTIONS - Present these to player:\n\nA) SECT ORPHANAGE - Raised entirely within sect walls.\n    Bonus: +10 starting Sect Standing (110 total)\n    Traits: Limited world knowledge, strong sect loyalty\n    GM Note: Elders remember childhood moments, +20% chance of aid in crisis\n\nB) ADOPTED BY ELDER - Taken in by compassionate elder.\n    Bonus: Minor mentor relationship, better resources\n    Traits: Higher expectations placed on you\n    GM Note: Secret inheritance quest unlocks at Gold realm\n\nC) VILLAGE FOSTER FAMILY - Raised in nearby village, joined sect at 16.\n    Bonus: Family connections outside sect\n    Traits: More worldly, divided loyalties\n    GM Note: Village becomes plot-relevant, can be threatened OR provide safe haven\n\nD) STREET URCHIN - Survived alone until sect took you in.\n    Bonus: +1 DEX or LCK (player choice)\n    Traits: Street smarts, trust issues, no external connections\n    GM Note: Criminal contacts from childhood, black market access but debts may resurface\n\nE) MERCHANT FAMILY WARD - Raised by sect-affiliated merchants.\n    Bonus: Starting Wealth Points doubled (6 WP instead of 3)\n    Traits: Trade knowledge, seen as outsider by disciples\n    GM Note: Family business spans continents, rare goods access but competitors target you\n\nF) CUSTOM - Player describes their own background (GM assigns appropriate bonuses)\n\nAFTER PLAYER CHOOSES: Record their choice and proceed to STAGE 7 (Pre-Sect Event).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 743,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "742": {
      "uid": 742,
      "key": [
        "pre-sect event",
        "backstory event",
        "character history"
      ],
      "comment": "Pre-Sect Event Options",
      "content": "[STAGE 7 OF 13: PRE-SECT EVENT]\n\nPRE-SECT EVENT OPTIONS - Present these to player:\n\nA) SURVIVED BEAST ATTACK - Mauled by spirit beast as child.\n    Bonus: +1 WIL, Beast Slayer perk available early\n    Traits: Scar (add to appearance), Fear of Spirit Beasts\n    GM Note: Beast left trace qi, spirit beasts occasionally hesitate, taming bonus\n\nB) WITNESSED DEMON - Saw a devil kill someone you knew.\n    Bonus: +1 WIL, Demon Hunter perk available early\n    Traits: -1 CHA (trauma), knows demons are real\n    GM Note: Faint corruption resonance, can sense corruption before visible, but +5% corruption gain rate\n\nC) NEAR-DEATH ILLNESS - Almost died from qi deviation sickness.\n    Bonus: +1 CON\n    Traits: Fragile reputation, understands cultivation dangers\n    GM Note: Touched death threshold, can perceive ghosts and lingering souls\n\nD) LOST SOMEONE - Parent/sibling/friend died.\n    Bonus: +1 WIS (matured early)\n    Traits: Grief flaw, personal quest hook\n    GM Note: Their spirit watches, once per realm auto-succeed death save, ghost may appear in dreams\n\nE) SAVED BY CULTIVATOR - Powerful cultivator saved your life as child.\n    Bonus: +1 CHA (inspired), heroic aspiration\n    Traits: Life debt exists somewhere\n    GM Note: They WILL reappear, identity significant to main plot\n\nF) STRANGE DREAM - Recurring dreams of parent you never knew.\n    Bonus: +1 INT\n    Traits: Cryptic hints, mystery hook\n    GM Note: Dreams are fragments of Sovereign parent's memories, bonus at Sovereign legacy sites\n\nG) NOTHING NOTABLE - Unremarkable childhood.\n    Bonus: None\n    Traits: Clean slate\n    GM Note: +10% bonus to Fate's Gambit success, destiny entirely self-made\n\nH) CUSTOM - Player describes their own event (GM assigns appropriate bonuses)\n\nAFTER PLAYER CHOOSES: Record their choice and proceed to STAGE 8 (Personality).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 684,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "743": {
      "uid": 743,
      "key": [
        "motivation options",
        "why cultivate",
        "character goal"
      ],
      "comment": "Character Motivation Options",
      "content": "[STAGE 9 OF 13: MOTIVATION]\n\nMOTIVATION OPTIONS - Present these to player:\n\nA) POWER - Want strength for its own sake.\n    Gameplay: Ambitious dialogue options, tempted by shortcuts\n    Corruption Risk: Greed and Pride corruption more dangerous\n\nB) PROTECTION - Protect someone or something.\n    Gameplay: Defensive instincts, loyalty focused\n    Requirement: Must name who/what they protect (created in Stage 10 or backstory)\n\nC) REVENGE - Someone wronged you or loved ones.\n    Gameplay: Driven but potentially blinded by hate\n    Requirement: Must name the enemy (can be vague: 'the sect that destroyed my village')\n    Corruption Risk: Wrath corruption dangerous\n\nD) TRUTH - Discover your origins and your Sovereign parent.\n    Gameplay: Investigation focused, drawn to secrets, bonus to clue-finding\n    Special: Strong resonance with Sovereign legacy sites and artifacts\n\nE) DUTY - Serve the sect and fight demons.\n    Gameplay: Traditional path, respected but predictable\n    Bonus: Sect Standing gains +20%\n\nF) FREEDOM - Escape constraints, live on your own terms.\n    Gameplay: Independent streak, chafes at authority\n    Synergy: Wind cultivation path\n\nG) LEGACY - Prove yourself worthy of your unknown heritage.\n    Gameplay: Pressure to excel, reputation focused\n    Bonus: Notoriety gains +20%\n\nH) SURVIVAL - The world is dangerous, must become strong to survive.\n    Gameplay: Pragmatic, cautious, sometimes ruthless\n    Corruption Risk: Sloth corruption dangerous (temptation to give up)\n\nI) CUSTOM - Player describes their own motivation\n\nAFTER PLAYER CHOOSES: Record their choice and proceed to STAGE 10 (Starting Relationships).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 683,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "744": {
      "uid": 744,
      "key": [
        "starting equipment",
        "outer disciple gear",
        "beginning items"
      ],
      "comment": "Starting Equipment",
      "content": "[STAGE 11 OF 13: STARTING EQUIPMENT]\n\nSTARTING EQUIPMENT PACKAGE - Confirm with player:\n\nWEALTH:\n Wealth Tier: 0 (Starting Cultivator)\n Wealth Points: 3 WP (Normal), 5 WP (Easy), 2 WP (Hard), 1 WP (Very Hard)\n Note: Merchant Family Ward background doubles this to 6 WP\n\nWEAPON (Player chooses one):\n Sword - Balanced, versatile\n Saber - Aggressive, slashing\n Spear - Reach, defensive\n Staff - Blunt, defensive\n Daggers - Fast, dual-wield\n Gauntlets - Unarmed enhancement\n Bow - Ranged\n Other - Player specifies\n\nSTANDARD GEAR (Automatic):\n Sect uniform (minor armor protection)\n Basic Pouch (5 item slots)\n Traveler's Pack (15 item slots)\n Bedroll, waterskin\n\nCONSUMABLES (Automatic):\n 3x Minor Healing Pills (restore 15% HP each)\n 1x Qi Recovery Pill (restore 20% Qi)\n Rations (3 days)\n\nASK PLAYER: 'What weapon do you choose?'\n\nAFTER PLAYER CHOOSES: Record their weapon and proceed to STAGE 12 (Starting Technique).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 682,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "745": {
      "uid": 745,
      "key": [
        "starting techniques",
        "first technique",
        "beginning cultivation",
        "stage 12",
        "choose technique",
        "starting technique"
      ],
      "comment": "Starting Technique Options",
      "content": "[STAGE 12 OF 13: STARTING TECHNIQUE]\n\nSTARTING TECHNIQUES BY PATH - Present options based on player's Stage 5 choice. Use EXACT names below (from Technique Library):\n\nFIRE PATH (choose 1):\n Blazing Palm Strike - Melee attack with burn effect\n Cinder Shield - Defensive barrier that explodes when broken\n Firefly Dash - Quick dash leaving damaging ember trail\n\nWATER PATH (choose 1):\n Flowing Strike - Adaptive melee, water-enhanced attacks\n Adaptive Skin - Temporary damage resistance buff\n Misty Veil - Creates obscuring mist, ranged attacks miss 20%\n\nWIND PATH (choose 1):\n Wind Blade Strike - Armor-piercing ranged attack\n Air Shield - Deflects projectiles, +15 defense\n Gale Step - Movement speed and evasion boost\n\nEARTH PATH (choose 1):\n Stone Fist Strike - Heavy melee with stun chance\n Earthen Shell - Grants Stone Skin stacks reducing damage\n Steady Footing - Removes movement debuffs, immunity to knockback\n\nSWORD PATH (choose 1):\n Quick Draw - Fast draw attack with bleed\n Iron Guard - Defensive stance with armor bonus\n Blade Weave - Counter stance, auto-counter attacks\n\nSHADOW PATH (choose 1):\n Shadow Step - Teleport through shadows, grants stealth\n Shade's Veil - Evasion buff, stronger while stealthed\n Venom Strike - Melee with poison chance\n\nLIGHT PATH (choose 1):\n Luminous Strike - Light damage, marks target for allies\n Minor Heal - Restore HP to single target\n Purifying Light - Remove debuffs from ally\n\nBODY PATH (choose 1):\n Flurry of Blows - Two quick attacks with bleed chance\n Flesh Fortification - Armor and minor regeneration\n Vitality Surge - Instant HP restore and strength boost\n\nIMPORTANT: Use these EXACT technique names. They link to full entries in the Technique Library lorebook.\n\nASK PLAYER: 'Which starting technique do you choose?'\n\nAFTER PLAYER CHOOSES: Record their technique and proceed to STAGE 13 (Final Confirmation).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 681,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "746": {
      "uid": 746,
      "key": [
        "Nereid stats",
        "nereid modifiers",
        "nereid character",
        "water folk stats"
      ],
      "comment": "Nereid Racial Modifiers",
      "content": "NEREID STAT MODIFIERS: +2 WIS, +1 DEX, -1 STR. PATH AFFINITY: Water (0% penalty), Light (0% penalty), all others -45%. LIFESPAN: 400-600 years. APPEARANCE OPTIONS: Height 160-190 cm, weight 50-85 kg. Skin ranges from pale blue to deep teal to sea-green. Hair in oceanic colors (blue, green, silver, pearl). Large eyes with nictitating membranes. Webbed fingers and toes. Gill slits on neck. Bioluminescent markings along arms, spine, and face that glow when channeling qi. RACIAL TRAITS: Perfect underwater combat (no penalties), can breathe water and air equally, pressure resistance (deep ocean survival), enhanced swimming speed, bioluminescence (can create blinding flashes), slippery skin (hard to grapple), cold resistance. CULTURAL NOTES: Slightly more females. Build cities in coastal waters and along rivers. Peaceful but fiercely territorial about their waters. Strong connection to Tranquil Depths Sect. COMBAT STYLE: Fluid and adaptive, constantly moving like water. Excel in or near water. Can weaponize surrounding water at higher realms. Prefer to drag enemies into water. Tridents, spears, harpoons, or unarmed water techniques.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 685,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "747": {
      "uid": 747,
      "key": [
        "parent selection",
        "choose parent",
        "sovereign parent",
        "character creation parent"
      ],
      "comment": "Parent Selection - Character Creation Stage 1",
      "content": "PARENT SELECTION (Character Creation Stage 1): Choose which of the three surviving Sovereigns is your parent. This determines your starting sect, continent, dormant bloodline path, and narrative hooks. Your parent was the same race as you - the Sovereign took mortal form matching their eventual child's heritage.\n\n LINEAGE SECRECY PROTOCOL (CRITICAL):\n- MC's Sovereign parentage is a CLOSELY GUARDED SECRET known only to the highest sect leadership\n- ONLY Sect Elders (Astral+ realm) may suspect the truth - and they keep it silent\n- Regular disciples, instructors, and outsiders have ABSOLUTELY NO IDEA about MC's lineage\n- The `parent` field in STATE_JSON is GM-ONLY information - NPCs cannot read it\n- NEVER have NPCs reference MC's lineage, Sovereign parent, bloodline heritage, or make comments like 'someone with your lineage' unless they are an Elder who has explicitly chosen to reveal they know\n- Even Elders who suspect should hint cryptically ('there is something... unusual about your qi'), not state outright until plot-appropriate moments\n- Fellow disciples see MC as just another cultivator with an unusual backstory (orphan, foundling, etc.)\n- The truth should be revealed gradually through PLOT EVENTS, not casual NPC dialogue\n\nOPTION 1 - KING TITAN THE IMMOVABLE (Default):\n Bloodline Path: Earth (dormant Primordial Earth)\n Starting Sect: Unshaken Foundation\n Starting Continent: Frostholm (arctic mountains)\n Virtue Inherited: Duty, Steadfastness\n Discovery Story: Found in a perfect cylinder of earth during a terrible storm\n Sect Knowledge: Elders strongly suspect your heritage but keep it secret\n Hidden Bonus: +5% resistance to knockdown/displacement effects; Earth Path techniques start at 26% mastery (Practiced) instead of 0% (Novice) - inherited muscle memory\n Narrative Theme: The enduring protector who never abandons their post\n\nOPTION 2 - LADY UMBRA THE MERCIFUL:\n Bloodline Path: Shadow (dormant Primordial Shadow)\n Starting Sect: Veiled Mercy\n Starting Continent: Mistmere (swamps and fog)\n Virtue Inherited: Mercy, Compassion\n Discovery Story: Found in a shadow cocoon on the darkest new moon night\n Sect Knowledge: Elders suspect your heritage but keep it secret\n Hidden Bonus: +5% stealth effectiveness; Shadow Path techniques start at 26% mastery (Practiced) instead of 0% (Novice) - inherited instinct\n Narrative Theme: The paradox of the killer who saves thousands\n\nOPTION 3 - LADY MAREN THE TRANQUIL:\n Bloodline Path: Water (dormant Primordial Water)\n Starting Sect: Tranquil Depths\n Starting Continent: Primereach (temperate, near Alliance HQ)\n Virtue Inherited: Wisdom, Serenity\n Discovery Story: Found dry on riverbank after the river reversed flow for one hour\n Sect Knowledge: Elders suspect your heritage and have access to Maren's archives about bloodline development\n Hidden Bonus: +5% meditation efficiency; Water Path techniques start at 26% mastery (Practiced) instead of 0% (Novice) - inherited intuition; potential access to Great Library restricted sections\n Narrative Theme: The keeper of knowledge who documented everything\n\nSTARTING MASTERY BONUS: When MC learns any technique from their parent's path (Earth/Shadow/Water), it begins at 26% mastery instead of 0%. This represents inherited muscle memory from the Primordial bloodline. The bonus applies regardless of MC's chosen primary cultivation path. See Entry 590 for mastery level benefits (Practiced = 90% cost, +10% damage, 10% failure chance).\n\nRACE INHERITANCE: Your parent took mortal form matching your chosen race. If you choose Elf as your race and Titan as parent, Titan appeared as an Elf when conceiving you. This affects nothing mechanically but provides roleplay flavor - your parent understood your race's culture and physiology intimately.\n\nBLOODLINE VS PATH: Your dormant Primordial bloodline matches your parent's path (Earth/Shadow/Water), but you can choose ANY cultivation path as your primary. The bloodline grants bonuses to the parent's path but does not restrict your choices. A Titan child can pursue Fire Path - they simply gain extra affinity for Earth techniques as a secondary benefit.\n\nSEE ALSO: Entry 724 (Bloodline Infusion), Entry 725 (MC Bloodline Evolution), Entries 253-255 (detailed parent lore), Entry 590 (Mastery System).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 736,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "748": {
      "uid": 748,
      "key": [
        "starting relationships",
        "sect master opinion",
        "starting rival",
        "starting friend",
        "character creation relationships"
      ],
      "comment": "Relationships - Character Creation Stage 10",
      "content": "RELATIONSHIPS (Character Creation Stage 10): Establish your initial social web within the sect. These NPCs are generated as full Level 3 characters and may become recruitable companions later.\n\nSECT MASTER OPINION: Choose how the Sect Master views MC at game start. Base Sect Standing is 100 (see Entry 593).\n FAVORABLE (+25 Sect Standing = 125): Master sees potential, provides extra attention. May assign better missions. Risk: Higher expectations, disappointment hits harder.\n NEUTRAL (No modifier = 100): Standard treatment. Neither favored nor disfavored. Blank slate to prove yourself.\n SUSPICIOUS (-15 Sect Standing = 85): Master senses something unusual about MC (dormant bloodline resonance). Extra scrutiny, must prove loyalty. Benefit: When trust is earned, it means more. Master becomes fierce defender once convinced of MC's worth. Note: 85 is below Outer Disciple minimum (100), so standing should be set to 100 minimum but with 'Watched' narrative status.\n\nSTARTING RIVAL: AI generates a full NPC using Entry 490 (Procedural Companion Generation) with the following constraints:\n Same sect as MC, same or one higher cultivation level\n Hostile motivation (jealousy, competition, past slight, or ideological clash)\n Generate: Name, Race, Cultivation Path, Realm/Level, Primary Trait, Flaw, Speech Pattern, Rivalry Origin\n Starting loyalty: 15 (Stranger, hostile)\n Romance Potential: Yes (enemies-to-lovers arc possible)\n RECRUITMENT POTENTIAL: Can become ally/companion if MC defeats them honorably, saves their life, or finds common ground. Requires reaching 60+ loyalty through roleplay.\n RIVAL ARCHETYPES (AI picks or rolls): The Jealous Prodigy (resents MC's mysterious origin), The Traditionalist (hates MC's unorthodox methods), The Bully (sees MC as easy target), The Former Friend (friendship soured by misunderstanding), The Ambitious Schemer (sees MC as obstacle to advancement), The Wronged Party (MC's background somehow harmed their family).\n\nSTARTING FRIEND: AI generates a full NPC using Entry 493 with the following constraints:\n Same sect as MC, same or one lower cultivation level\n Friendly motivation (kindness, shared interest, owes small debt, or lonely)\n Generate: Name, Race, Cultivation Path, Realm/Level, Primary Trait, Virtue, Speech Pattern, Friendship Origin\n Starting loyalty: 45 (Acquaintance, positive)\n Romance Potential: Yes (friends-to-lovers arc possible)\n RECRUITMENT POTENTIAL: Can join party if loyalty reaches 60+. Already predisposed to MC, easier to recruit than strangers.\n FRIEND ARCHETYPES (AI picks or rolls): The Helpful Senior (took MC under wing), The Fellow Outsider (both don't fit in), The Admirer (impressed by MC's uniqueness), The Childhood Friend (knew MC before sect), The Shared Trauma (bonded over pre-sect events), The Cheerful Optimist (befriends everyone, chose MC specifically).\n\nNPC GENERATION PROTOCOL: When generating Rival and Friend, AI must:\n1. Use full companion template (Entry 499) for stats and personality\n2. Create contrasting personalities (if Friend is cheerful, Rival should be serious)\n3. Establish clear relationship to MC's background choices\n4. Note secret (hidden until 60+ loyalty) and personal quest hook\n5. Set Romance Potential: Yes for both (per Entry 499 template)\n6. Track as potential future companions in narrative memory\n7. These NPCs should appear regularly in early game sect scenes\n\nIMPORTANT: Rival and Friend are NOT disposable. They are fully realized characters with arcs. Rival may become closest ally. Friend may betray MC. Let relationships evolve naturally based on player actions.\n\nSEE ALSO: Entry 499 (Companion Template), Entry 490 (Procedural Generation), Entry 580 (Romance System), Entries 500-506 (Companion System).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 737,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "749": {
      "uid": 749,
      "key": [
        "camp follower roles",
        "camp roles",
        "follower buffs"
      ],
      "comment": "Camp Follower Passive Buffs",
      "content": "CAMP FOLLOWER ROLES:\n\nCOOK: \"Meals restore extra Stamina and provide +1 Morale.\"\nSPY: \"Can be sent to gather Rumors (Lore) about a location. Warns of ambushes.\"\nHEALER: \"Reduces injury recovery time by 50%. Stabilizes dying companions.\"\nMERCHANT: \"Sells basic supplies at camp. Buys loot at +10% value.\"\nARTISAN: \"Repairs equipment for free. Can craft basic items if materials provided.\"\nMANAGER: \"Prevents camp supplies from degrading. Mediates minor conflicts.\"\nQUARTERMASTER: \"Finds extra loot after battles (10% chance).\"\nSCHOLAR: \"Identifies unknown artifacts. Provides +1 to History/Arcana checks.\"",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 2010,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "750": {
      "uid": 750,
      "key": [
        "relationship tags",
        "companion bonds",
        "relationship system"
      ],
      "comment": "Relationship Tag Definitions with Loyalty & Personality Rules",
      "content": "RELATIONSHIP TAGS:\nDynamic tags applied during gameplay to modify companion behavior and loyalty gains. Use Entry 499 template for NPC creation; apply these tags as relationships evolve.\n\nHOW TAGS WORK: Tags are added/removed based on narrative events. An NPC can have multiple tags. AI must respect 'Requires' traits (from Entry 498) when assigning tags.\n\n[Rival: Name]\n Effect: Competes for glory. Tries to outdo target's damage/achievements.\n Loyalty Modifier: Gains from Combat/Victory. Ignores gifts/flattery.\n Requires: Ambitious, Competitive, Arrogant, Determined, Zealous.\n Incompatible: Humble, Cautious, Lazy, Cowardly.\n\n[Mentor: Name]\n Effect: Teaches target. Protective but critical.\n Loyalty Modifier: Gains when Student succeeds/levels up. Loses if Student acts shamefully.\n Requires: Wise, Patient, Disciplined, Traditional, Calm.\n Incompatible: Innocent, Reckless, Spontaneous, Naive (Flaw).\n\n[Student: Name]\n Effect: Mimics target. Seeks approval.\n Loyalty Modifier: Doubles gains/losses from Mentor's praise/criticism.\n Requires: Ambitious, Curious, Innocent, Determined.\n Incompatible: Arrogant, Stubborn, Jaded.\n\n[Protective: Name]\n Effect: Prioritizes target's safety over enemies.\n Loyalty Modifier: Gains when Target is Healed/Safe. Loses if Target is injured (blames self).\n Requires: Protective, Loyal, Brave, Compassionate, Noble.\n Incompatible: Selfish (Flaw), Cowardly, Cruel, Cynical.\n\n[Distrust: Name]\n Effect: Suspicious of motives. Watches closely.\n Loyalty Modifier: All gains are HALVED. Requires 'Grand Gestures' to remove.\n Requires: Cynical, Paranoid, Cautious, Jaded, Haunted.\n Incompatible: Cheerful, Innocent, Gullible (Flaw).\n\n[Romance: Name]\n Effect: Deep attachment. Jealousy possible.\n Loyalty Modifier: All gains/losses DOUBLED. Volatile reactions.\n Trigger: Apply when NPC with 'Romance Potential: Yes' reaches COMMITTED stage (70+ loyalty, see Entry 580).\n Requires: Romance Potential: Yes (from Entry 499), 70+ loyalty.\n Incompatible: Emotionally distant (Flaw).\n\n[Debt: Name]\n Effect: Owes a life debt. Transactional service.\n Loyalty Modifier: Gains from Fairness/Payment. Tag removed when debt paid.\n Requires: Pragmatic, Honorable (Noble), Disciplined, Reliable.\n Incompatible: Manipulative, Greedy, Treacherous (Flaw).\n\nSEE ALSO: Entry 499 (Companion Template - Romance Potential field), Entry 580 (Romance Stages by loyalty threshold).",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 2011,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "751": {
      "uid": 751,
      "key": [
        "character creation stage",
        "stage 1",
        "stage 2",
        "stage 3",
        "stage 4",
        "stage 5",
        "stage 6",
        "stage 7",
        "stage 8",
        "stage 9",
        "stage 10",
        "stage 11",
        "stage 12",
        "stage 13",
        "current stage"
      ],
      "comment": "Character Creation Stage Tracker - Anti-Skip Mechanism",
      "content": "=== CHARACTER CREATION STAGE TRACKER ===\n\n[AI: Reference this entry to track progress through the 13 stages]\n\nSTAGE CHECKLIST:\n[ ] Stage 1: Parent Selection (King Titan / Lady Umbra / Lady Maren)\n[ ] Stage 2: Race Selection (15 races with stat modifiers)\n[ ] Stage 3: Appearance (Name, Age, Gender, Height, Build, Hair, Eyes, Features)\n[ ] Stage 4: Stat Allocation (90 points across STR/DEX/CON/INT/WIS/WIL/CHA/LCK, min 5 each)\n[ ] Stage 5: Cultivation Path (Fire/Water/Wind/Earth/Sword/Shadow/Light/Body)\n[ ] Stage 6: Background (Sect Orphanage/Adopted/Village/Street Urchin/Merchant/Custom)\n[ ] Stage 7: Pre-Sect Event (Beast Attack/Demon/Illness/Lost Someone/Saved/Dream/Nothing/Custom)\n[ ] Stage 8: Personality (Load from PC Personality lorebook OR ask Primary/Secondary trait, Flaw, Virtue)\n[ ] Stage 9: Motivation (Power/Protection/Revenge/Truth/Duty/Freedom/Legacy/Survival/Custom)\n[ ] Stage 10: Starting Relationships (Sect Master opinion, generate Rival NPC, generate Friend NPC)\n[ ] Stage 11: Starting Equipment (Wealth Tier 0, 3 WP, choose weapon, standard gear)\n[ ] Stage 12: Starting Technique (1 Common technique from chosen path)\n[ ] Stage 13: Confirmation (Display full character sheet, wait for CONFIRM)\n\nANTI-SKIP RULES:\n- If player tries to skip ahead: 'Let's complete Stage [X] first before moving on.'\n- If player gives incomplete info: 'I need [missing detail] before we can continue.'\n- If player tries to start gameplay before Stage 13: 'We need to finish character creation first. We're on Stage [X].'\n- NEVER start the actual game until player types CONFIRM at Stage 13.\n\nWHEN CHARACTER CREATION IS COMPLETE:\n- Display final character sheet with all stats calculated (including racial modifiers)\n- Starting State: Bronze Realm Level 1, 0% Corruption, 100 Sect Standing, Outer Disciple rank\n- Dormant Primordial bloodline from chosen parent (appears as Mortal tier until Iron breakthrough)\n- Player begins at their sect's training grounds on their starting continent",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 880,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": true
    }
  }
}