{
  "entries": {
    "500": {
      "uid": 500,
      "key": [
        "Unshaken Foundation Sect",
        "Ironpeak Citadel",
        "Foundation Sect capital",
        "Titan's sect"
      ],
      "keysecondary": [],
      "comment": "Unshaken Foundation Sect Capital - Ironpeak Citadel",
      "content": "SECT: Unshaken Foundation Sect (Earth Path, Duty/Steadfastness). LOCATION: Ironpeak Citadel, carved into the tallest mountain in the Skyreach range, Frostholm. ARCHITECTURE: Massive stone fortress built directly into living rock. Five-tiered structure ascending the mountain - outer walls at base, training grounds mid-level, elder halls upper-tier, Sect Master's peak chamber at summit. Everything constructed from reinforced granite and jade. Designed to withstand siege indefinitely. SECT MASTER: Grandmaster Borin Stoneheart (male dwarf, peak Void realm, age 847). Gruff, pragmatic, deeply loyal. Knew King Titan personally in final decades. Has strong suspicions about MC's parentage but keeps it secret. Leads the 'Investigating' faction - neither dismissing nor fully accepting demon threat reports. NOTABLE ELDERS: Elder Mira Earthborn (female human, mid Void, head of outer disciples, stern but fair), Elder Tharn Deeproot (male minotaur, low Void, master of formations and defensive techniques), Elder Kessa Ironvein (female dwarf, peak Astral, treasurer and logistics, secretly worried about missing mining caravans). KEY LOCATIONS: Titan's Rest (pilgrimage site where King Titan's essence remains), the Bedrock Archives (ancient technique library), the Adamant Training Yards (harshest conditioning grounds), the Earthblood Forges (legendary weapon smiths). CULTURE: Emphasis on endurance, discipline, and protecting others. Students learn through hardship - extreme physical conditioning, fasting, exposure to elements. 'The mountain does not bend' is their creed. CURRENT STATUS: Investigating demon reports. Grandmaster Borin has dispatched scouts to verify mining town disappearances. Sect is preparing defenses but not mobilizing for war. Recent tension with Iron Body Sect over resource allocation. UNIQUE FEATURES: Every disciple must complete the 'Hundred Day Meditation' - meditating motionless on exposed mountainside through a full winter. The sect maintains the largest network of underground tunnels and emergency shelters. STANCE: Cautious investigation. Borin won't commit without proof, but he's quietly preparing.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 101,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "501": {
      "uid": 501,
      "key": [
        "Veiled Mercy Sect",
        "Shadowhaven",
        "Mercy Sect capital",
        "Umbra's sect"
      ],
      "keysecondary": [],
      "comment": "Veiled Mercy Sect Capital - Shadowhaven",
      "content": "SECT: Veiled Mercy Sect (Shadow Path, Mercy/Compassion). LOCATION: Shadowhaven, hidden deep within the Gloomwater Bogs of Mistmere. Exact location known only to sect members and refugees they've saved. Accessible only by hidden waterways through the marsh. ARCHITECTURE: Built on and between ancient cypress trees above the swamp water. Wooden walkways connect dozens of platforms and structures. Everything designed for concealment - buildings blend into foliage, can be quickly dismantled, escape routes everywhere. The Shadow's Rest shrine (where Lady Umbra died) is the spiritual center. SECT MASTER: Matriarch Senna Nightwhisper (female elf, low Eternal realm, age 892). Appears young despite age. Warm but haunted. Lost family to demons 1,000 years ago, present when Lady Umbra died protecting her village. Absolute believer in demon threat. Runs extensive refugee network. NOTABLE ELDERS: Elder Kaine Morrow (male human, peak Void, spymaster, coordinates intelligence on demon activity), Elder Lysara Duskwalker (female felkin, mid Void, assassination specialist, trains core disciples in lethal arts), Elder Ven Shadowmeld (male goblin, low Void, runs the refugee underground railroad). KEY LOCATIONS: Shadow's Rest (Lady Umbra's death site, radiates shadow qi), the Veiled Archives (gathered intelligence on all seven Generals), the Mercy Houses (refugee safe houses scattered across Mistmere), the Silent Pools (assassination training grounds). CULTURE: 'The shadow that shields the candle' philosophy. Trains disciples in both lethal shadow arts AND humanitarian aid. All members learn stealth, disguise, and killing techniques alongside medicine and diplomacy. Disciples often serve dual roles - assassins who also rescue refugees. CURRENT STATUS: Fully mobilized against demons. Matriarch Senna has operatives embedded in multiple corrupted areas gathering intelligence. The sect is stretched thin protecting scattered refugees while fighting covert war against Morvane and Elowen's forces. UNIQUE FEATURES: Every graduate completes the 'Mercy Trial' - must save a life while killing a threat, same mission. The sect maintains shadow-touched ravens for communication across continents. Secret sign language used for silent coordination. STANCE: Absolute believers. Fighting the invasion alone if necessary.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 99,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "502": {
      "uid": 502,
      "key": [
        "Tranquil Depths Sect",
        "Great Library",
        "Azure Spire",
        "Depths Sect capital",
        "Maren's sect"
      ],
      "keysecondary": [],
      "comment": "Tranquil Depths Sect Capital - The Azure Spire",
      "content": "SECT: Tranquil Depths Sect (Water Path, Wisdom/Serenity). LOCATION: The Azure Spire, built on an island in the center of the Clearwater Lake near Ebonspire, Primereach. Connected to shore by a single elegant bridge. The Great Library stands beside the sect headquarters. ARCHITECTURE: Graceful towers of blue-white stone rising from the water like lotus stems. Circular buildings with flowing curved lines, extensive gardens with meditation pools, indoor waterfalls throughout. The Great Library is the largest structure - seven stories of accumulated knowledge from across 3,000 years. SECT MASTER: Grand Scholar Elara Tideborn (female human, mid Eternal realm, age 1,247). Elderly in appearance, serene, thoughtful. Lady Maren's last direct disciple. Most politically influential sect leader due to Library access and Primereach location. Leads the 'Investigating' faction - using Library resources to research demon patterns. NOTABLE ELDERS: Elder Caius Riverflow (male elf, peak Void, head librarian, discovered references to Bloodline Infusion in ancient texts), Elder Nina Depthsinger (female marefolk, mid Void, combat instructor, focuses on water techniques), Elder Rook Clearwater (male human, low Void, diplomatic liaison to Orthodox Alliance). KEY LOCATIONS: The Great Library (most comprehensive cultivation knowledge repository), the Reflection Pools (scrying and meditation chambers), the River Gate (where MC was found as baby), the Tidewell Archives (Maren's personal journals, heavily restricted). CULTURE: Emphasis on learning, contemplation, and sharing knowledge. 'Wisdom flows like water to all who seek it' is their creed. Students spend equal time studying texts and practicing cultivation. Extensive training in diplomacy and mediation. The sect serves as neutral ground for Alliance negotiations. CURRENT STATUS: Investigating through research. Elder Caius has teams cross-referencing current demon activity with First Sin War records. The sect has identified pattern similarities but lacks hard proof. Political pressure from both skeptic and believer factions. Growing tension as some believe they're hoarding knowledge. UNIQUE FEATURES: The Librarian's Oath - graduates swear to preserve and share knowledge. The sect maintains the 'Thousand Scrolls Repository' containing cultivation techniques from all eight paths. Monthly 'Open Forums' where any Alliance member can request research assistance. STANCE: Methodical investigation. Won't act without evidence but actively searching for it.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 98,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "503": {
      "uid": 503,
      "key": [
        "Blazing Heart Sect",
        "Sunforge Citadel",
        "Heart Sect capital",
        "Pyrrhus's sect"
      ],
      "keysecondary": [],
      "comment": "Blazing Heart Sect Capital - Sunforge Citadel",
      "content": "SECT: Blazing Heart Sect (Fire Path, Passion/Courage). LOCATION: Sunforge Citadel, built within a massive active volcano crater in the Sunfire Desert, Solhara. Accessible by bridges across lava flows. The Ardor Shrine (where Lord Pyrrhus fell) forms the spiritual heart. ARCHITECTURE: Red-gold stone and obsidian fortifications. Buildings designed to channel volcanic heat for forges and cultivation chambers. Open-air training arenas withstand extreme temperatures. The Pyrrhic Flame - an eternal fire burning at the crater's center - powers the entire complex. Everything radiates heat and light. SECT MASTER: Flame Lord Kaelen Ashborn (male dragonkin, low Eternal realm, age 743). Passionate, aggressive, short-tempered. Red-scaled with smoldering eyes. Absolute believer in demon threat and furious at skeptic sects' inaction. Pushes for immediate Alliance military action. Barely restrains himself from acting alone. NOTABLE ELDERS: Elder Pyra Emberheart (female human, peak Void, weapons master, forges legendary flame-attuned blades), Elder Taron Cinderborn (male orc, mid Void, cavalry commander, leads fire-drake mounted units), Elder Seraphine Sunforge (female harpy, low Void, teaches aerial fire techniques). KEY LOCATIONS: The Ardor Shrine (Pyrrhus's volcanic glass remains, pilgrims test courage by approaching), the Sunforge Armories (legendary weapon production), the Inferno Yards (disciples train in extreme heat), the Ashborn Towers (cultivation chambers heated by magma). CULTURE: 'Never retreat, never surrender' mentality. Values courage, passion, and decisive action above all. Students learn through confrontation - constant sparring, fire-walking trials, facing fear directly. The sect produces the Alliance's finest weapons and most aggressive warriors. Disciples expected to be first into battle, last to withdraw. CURRENT STATUS: Fully mobilized and frustrated. Kaelen has sect forces patrolling Solhara borders, engaging demon warbands on sight. Growing conflict with Calderon's forces in northern Solhara. Kaelen openly criticizes skeptic sects at Alliance meetings, causing political rifts. The sect is effectively at war already. UNIQUE FEATURES: The 'Trial by Fire' - final test requiring disciples to retrieve an object from active lava flow using only qi protection. The sect breeds and trains fire-drakes as mounts. Annual 'Courage Festival' where disciples compete in dangerous challenges. STANCE: Absolute believers and already fighting. Barely held back from declaring formal war.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 97,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "504": {
      "uid": 504,
      "key": [
        "Righteous Blade Sect",
        "Judgment's Edge",
        "Blade Sect capital",
        "Honorus's sect"
      ],
      "keysecondary": [],
      "comment": "Righteous Blade Sect Capital - Judgment's Edge",
      "content": "SECT: Righteous Blade Sect (Sword Path, Justice/Honor). LOCATION: Judgment's Edge, fortress-city on the eastern border of Primereach, positioned to defend against threats from any continent. The Blade of Sealing (Honorus's embedded sword) serves as both courthouse and spiritual center. ARCHITECTURE: Military fortress designed for defense and projection of force. Severe rectangular buildings, high walls, multiple layers of defensive formations. The Blade of Sealing rises from central plaza - impossible to miss or ignore. Barracks, training halls, and armories dominate. Everything speaks of discipline and martial law. SECT MASTER: Sword Saint Aldric Steelblade (male human, low Eternal realm, age 982). Cold, uncompromising, absolutely certain of right and wrong. Silver-haired with sword-sharp eyes. Absolute believer in demon threat. Has investigated demon reports personally, executed several confirmed corrupted cultivators. Commands Alliance military forces nominally, but faces resistance from skeptic sects. NOTABLE ELDERS: Elder Vera Coldheart (female elf, peak Void, leads Demon Hunter division, has highest confirmed devil kills), Elder Marcus Ironvow (male human, mid Void, chief investigator, uncovers corruption and cults), Elder Lin Swiftblade (female kitsune, low Void, trains core disciples in killing techniques). KEY LOCATIONS: The Blade of Sealing (courthouse where serious Alliance judgments rendered), the Execution Grounds (where confirmed demon collaborators face justice), the Sword Forest (ten thousand practice blades embedded in stone), the Vow Chamber (where disciples swear their binding oaths). CULTURE: 'Justice without mercy is cruelty, mercy without justice is weakness' philosophy. Disciples learn both righteous combat and investigation. Every member swears binding oath to hunt evil, protect innocent, and execute justice. The sect serves as Alliance's military arm and investigative force. Reputation for being harsh but fair. No corruption tolerated - even accusations are investigated thoroughly. CURRENT STATUS: Fully mobilized and hunting. Elder Vera's Demon Hunter teams operate across all continents, tracking cult activity and demon sightings. Multiple confirmed kills of corrupted cultivators have created political tension - some sects accuse them of overreach. Aldric has evidence of Pride corruption in Alliance Council but faces political barriers to action. UNIQUE FEATURES: The 'Oath of Blades' - binding vow that grants slight power boost but kills oath-breaker if they betray it. The sect maintains 'Wanted' lists of criminals and demons posted publicly. Trial by combat still used for certain cases. STANCE: Absolute believers and actively hunting demons and corruption.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 96,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "505": {
      "uid": 505,
      "key": [
        "Iron Body Sect",
        "Ascetic Peak",
        "Body Sect capital",
        "Adamant's sect"
      ],
      "keysecondary": [],
      "comment": "Iron Body Sect Capital - Ascetic Peak",
      "content": "SECT: Iron Body Sect (Body Path, Discipline/Fortitude). LOCATION: Ascetic Peak, isolated monastery at the summit of the most remote mountain in northern Frostholm. Deliberately difficult to reach - requires climbing sheer cliffs or navigating treacherous mountain passes. The Perfect Form (Monk Adamant's crystallized statue) stands in the central courtyard. ARCHITECTURE: Austere stone buildings, no decoration or comfort. Bare sleeping quarters with stone beds, open-air meditation platforms exposed to elements, training halls with minimal amenities. Everything designed to test physical endurance. The monastery can house 10,000 disciples but feels empty - most are in meditation or training outdoors. SECT MASTER: Grand Ascetic Theron Ironflesh (male human, mid Void realm, age 654). Appears middle-aged despite cultivating Body Path. Gaunt, muscular, with countless self-inflicted scars. Absolute skeptic of demon reports - believes they represent moral weakness and fear. Dismissive of 'soft' sects who rely on external power. Refuses to mobilize or even investigate. NOTABLE ELDERS: Elder Morag Stonefist (female dwarf, low Void, master of body conditioning, incredibly harsh), Elder Kael Painseeker (male orc, peak Astral, teaches disciples to embrace suffering), Elder Siva Perfectborn (female dragonkin, peak Astral, focuses on physical cultivation over combat). KEY LOCATIONS: The Perfect Form (Adamant's indestructible statue, radiates discipline aura), the Suffering Halls (extreme training chambers), the Fasting Courtyards (disciples go months without food), the Scarification Chamber (ritual self-harm for cultivation advancement). CULTURE: 'Perfection through suffering' philosophy. Disciples embrace extreme physical hardship as cultivation. Regular fasting, exposure to deadly cold, carrying impossibly heavy loads, self-inflicted pain as meditation. The sect rejects 'weakness' like pleasure, comfort, or emotional bonds. Students who cry or complain are expelled. Produces the most physically durable cultivators but often socially maladjusted. CURRENT STATUS: Isolated and dismissive. Theron has refused to send representatives to recent Alliance emergency meetings. The sect continues normal operations - meditation, conditioning, isolation. Growing tensions with Unshaken Foundation Sect (same continent) over resource sharing. Some younger disciples secretly question leadership's denial. UNIQUE FEATURES: The 'Trial of Endurance' - disciples must survive alone on frozen peak for one month without food, water, or shelter. The sect maintains the 'Thousand Scars' tradition - each significant breakthrough marked by ritual scarring. Physical cultivation manual considered most comprehensive but brutal. STANCE: Absolute skeptics. Believe demon reports are exaggerated or represent moral failures.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 95,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "506": {
      "uid": 506,
      "key": [
        "Soaring Freedom Sect",
        "Windrider Archipelago",
        "Freedom Sect capital",
        "Aeris's sect"
      ],
      "keysecondary": [],
      "comment": "Soaring Freedom Sect Capital - Windrider Archipelago",
      "content": "SECT: Soaring Freedom Sect (Wind Path, Freedom/Joy). LOCATION: The Windrider Archipelago, a network of floating islands suspended by ancient wind formations above Stormcrown Island in the Scattered Isles. Islands drift in predictable patterns, can only be reached by flight or wind-walking. ARCHITECTURE: Light, airy structures that seem to defy gravity. Open-air pavilions, hanging gardens, gossamer bridges between floating platforms. Buildings designed for free movement - minimal walls, maximum sky access. No single 'capital' building - the sect is decentralized across dozens of floating islands. Clifftop shrines to Lady Aeris scattered everywhere. SECT MASTER: Skymother Lyra Windborn (female harpy, peak Void realm, age 421). Young for a sect master, believes in personal liberty above all. Charismatic and joy-filled, but perhaps naive. Skeptical of demon reports - thinks they're exaggerated by militaristic sects trying to consolidate power. Focuses sect resources on trade and exploration instead of military preparation. NOTABLE ELDERS: Elder Zephyr Stormchaser (male human, mid Void, leads merchant fleet operations), Elder Aria Cloudwalker (female elf, low Void, teaches flight and aerial combat), Elder Swift Windrider (male felkin, peak Astral, manages the intelligence network through merchant contacts). KEY LOCATIONS: The Drifting Gardens (cultivation areas blessed by Aeris's essence), the Windport Markets (largest air-trade hub in Scattered Isles), the Storm's Eye (where disciples learn true flight), the Messenger Roosts (trained wind-hawks for communication). CULTURE: 'The wind goes where it wills' philosophy. Values personal freedom, trade, and joy in life. Students learn through exploration and experience - encouraged to travel, meet other cultures, and find their own path. The sect maintains the largest merchant network, operates sky-ships between continents. Disciples often serve as merchants, explorers, or couriers. Least militaristic sect. CURRENT STATUS: Skeptical and distracted. Lyra has dismissed demon reports as typical border violence or bandit activity. The sect continues normal trade operations. Their merchant network has reported increased disappearances and strange cult activity, but sect leadership attributes this to normal criminal elements. Some traveling disciples have encountered demons directly and returned with warnings - largely ignored. UNIQUE FEATURES: The 'Flight of Freedom' - graduation requires flying solo between all five major islands of Scattered Isles. The sect maintains the only fleet of sky-ships capable of intercontinental travel. Annual 'Festival of Winds' celebrating freedom and joy. No formal ranks - all members considered equal. STANCE: Skeptics. Believe reports are exaggerated power grabs by militant sects.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 94,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "507": {
      "uid": 507,
      "key": [
        "Eternal Dawn Sect",
        "Dawnspire Cathedral",
        "Dawn Sect capital",
        "Celestine's sect"
      ],
      "keysecondary": [],
      "comment": "Eternal Dawn Sect Capital - Dawnspire Cathedral",
      "content": "SECT: Eternal Dawn Sect (Light Path, Hope/Faith). LOCATION: Dawnspire Cathedral, built at the site of the Eternal Dawn on Dawnhaven Island in the Scattered Isles. The location where Saint Celestine's power created permanent golden light - the sun never fully sets here, bathing everything in perpetual dawn. ARCHITECTURE: Magnificent white-gold cathedral dominating a coastal city. Soaring spires, stained glass depicting the Eight Sovereigns, vast prayer halls that hold thousands. Everything designed to inspire awe and faith. Extensive hospital and healing wards. Surrounding city grew around cathedral - pilgrims constantly arriving. Most beautiful and peaceful of all sect capitals. SECT MASTER: High Luminary Aldrin Brightshield (male human, mid Void realm, age 531). Elderly, kind, deeply faithful but perhaps too trusting. Believes in the fundamental goodness of people and the power of hope to overcome darkness. Skeptical of demon invasion - thinks reports reflect loss of faith and moral failures, not actual coordinated demonic force. Focuses on healing and inspiration over military preparation. NOTABLE ELDERS: Elder Celeste Dawnbringer (female elf, low Void, high priestess, leads purification rituals), Elder Thomas Lightbearer (male human, peak Astral, head of healing wards, treats thousands), Elder Serina Faithkeeper (female kitsune, peak Astral, exorcism specialist, one of few who takes demon threat seriously). KEY LOCATIONS: The Eternal Dawn (pilgrimage site of perpetual light), the Cathedral of Hope (central prayer hall), the Healing Sanctum (largest medical facility on Scattered Isles), the Lightforge (creates light-attuned weapons and artifacts). CULTURE: 'Faith illuminates darkness' philosophy. Disciples serve as priests, healers, and inspirational figures. Heavy emphasis on charity, helping others, and spreading hope. Students learn purification techniques, healing arts, and how to inspire faith in others. The sect operates free hospitals and orphanages across multiple continents. Least combat-focused sect - many members never learn fighting techniques. CURRENT STATUS: Skeptical and unprepared. Aldrin interprets demon reports as spiritual crises requiring faith and healing, not military action. The sect continues humanitarian work, treating increasing numbers of refugees but not asking why they're fleeing. Elder Serina has repeatedly warned about Vespera's proximity (Dawnhaven is near Vespera's portal) but is dismissed as alarmist. Growing cult presence in surrounding city largely unnoticed. UNIQUE FEATURES: The 'Blessing of Light' - sect members can perform mass purification rituals. The perpetual dawn provides unique cultivation advantages for Light Path. Annual 'Pilgrimage of Hope' draws believers from across Sinveil. Free healing for all who request it. STANCE: Skeptics. See reports as spiritual problems, not military threats.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 93,
      "position": 0,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "508": {
      "uid": 508,
      "key": [
        "Ebonspire",
        "Alliance capital",
        "largest city",
        "Primereach capital"
      ],
      "keysecondary": [],
      "comment": "Ebonspire - Alliance Headquarters & Largest City",
      "content": "LOCATION: Central Primereach, situated at the confluence of three major rivers (Clearwater, Goldvein, Ironflow). Built around massive black spire of unknown origin that predates all civilizations. POPULATION: 2.3 million permanent residents, swells to 3+ million with travelers and diplomats. Most diverse city in Sinveil - all 15 playable races represented in significant numbers. GOVERNANCE: Technically independent city-state governed by Merchant Council, but effectively controlled by Orthodox Alliance diplomatic headquarters. Alliance Council Chamber located in the Black Spire itself. DISTRICTS: (1) Spire District - Alliance headquarters, embassy row, high sect presence, political center. (2) Mercantile Quarter - largest market in Sinveil, trade from all five continents, banking district. (3) Cultivation Heights - wealthy cultivator estates, prestigious academies, sect branch offices. (4) Artisan's Ward - craftsmen, formation specialists, artifact workshops. (5) Harbor District - river docks, warehouses, shipping companies. (6) Common Quarters - residential areas for majority population. (7) Outer Ring - newer construction, fastest growing, poorest district. ECONOMY: Trade nexus of entire continent. Continental currencies can be exchanged here. Major exports: refined formation arrays, enchanted artifacts, political influence. Imports everything else. GDP larger than some small nations. DEFENSES: Triple layer of city walls (outer, middle, inner), extensive formation arrays, garrison of 50,000 Alliance soldiers, each of the Eight Sects maintains military presence (200-500 disciples each). Multiple escape tunnels and teleportation arrays for evacuation. THREAT LEVEL: HIGH - Lord Vaelen (Pride) opened Continental Gate only 30 kilometers south five years ago. His forces conduct subtle infiltration and corruption rather than direct assault. Multiple Alliance council members suspected of Pride corruption. City is on high alert but most citizens unaware of true danger. NOTABLE LOCATIONS: The Black Spire (pre-history monument, now Alliance HQ), Council Chamber (where sect leaders meet), The Grand Exchange (largest market), Formation Academy of Ebonspire (prestigious non-sect school), The Vault District (banking and secure storage), Cultivation Bazaar (technique scrolls and cultivation resources). TRAVEL TIMES: To Azure Spire (Tranquil Depths) - 2 hours by boat. To Judgment's Edge (Righteous Blade) - 1 day by horse. To any coast - 3-5 days. To other continents - 2-4 weeks by ship. [ location(Central Primereach); population(2.3 million); type(Trade Hub/Political Capital); threat(Vaelen nearby - infiltration); status(High alert but functional); importance(Highest); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 500,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "509": {
      "uid": 509,
      "key": [
        "Goldport",
        "Solhara trade city",
        "tropical trade hub"
      ],
      "keysecondary": [],
      "comment": "Goldport - Solhara's Major Trade City",
      "content": "LOCATION: Southern coast of Solhara, major port connecting to Scattered Isles and southern shipping lanes. Built around natural deep-water harbor. POPULATION: 800,000. Majority human, dragonkin, and harpy. Significant marefolk population in harbor district. ECONOMY: Major trade hub specializing in tropical goods, exotic cultivation resources, fire-attuned materials. Largest slave market in Sinveil (legal but controversial - Blazing Heart Sect opposes but lacks political power to ban). Exports: fire crystals from Sunfire Desert, tropical fruits, rare beast parts. Imports: metal, lumber, ice-attuned resources. GOVERNANCE: Merchant oligarchy of Seven Families (three human, two dragonkin, one harpy, one marefolk). Blazing Heart Sect maintains significant presence but doesn't directly govern. THREAT LEVEL: MEDIUM-HIGH - Located between Duke Calderon (Wrath) in north and Baron Glut (Gluttony) in far south. Demon raids increasing on outskirts. Several merchant ships have disappeared. City proper remains safe due to strong defenses and Blazing Heart garrison. Rumors of Wrath cult activity in slum districts. DEFENSES: Coastal fortifications, naval fleet of 200+ ships (mix of merchant and military), garrison of 10,000 city guard plus 800 Blazing Heart disciples. Multiple fire-path formation arrays. NOTABLE LOCATIONS: The Golden Exchange (slave auctions and luxury trade), Flameheart Docks (largest harbor), Drake's Roost (dragonkin district built on cliffsides), The Crucible (gladiator arena), Fire Crystal Bazaar. TRAVEL TIMES: To Sunforge Citadel - 5 days through desert. To Scattered Isles - 1-2 weeks by ship. To Primereach ports - 3 weeks by ship. [ location(Southern Solhara coast); population(800k); type(Trade Hub/Port City); threat(Between two Continental Gates); status(Fortified but vulnerable); importance(High); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 501,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "510": {
      "uid": 510,
      "key": [
        "Ironforge",
        "Frostholm mining city",
        "dwarf city"
      ],
      "keysecondary": [],
      "comment": "Ironforge - Frostholm's Mining Capital",
      "content": "LOCATION: Central Frostholm, deep in the Skyreach Mountains. Built into and under the mountain itself. POPULATION: 600,000. Majority dwarf (70%), significant human and orc presence. Largest concentration of dwarves in Sinveil. ECONOMY: Mining and metalwork. Produces majority of Sinveil's iron, steel, mithril, and rare cultivation metals. Famous for legendary smiths and formation-inscribed weapons. Near-monopoly on high-grade metal cultivation resources. Exports: weapons, armor, raw ore, cultivation artifacts. Imports: food, lumber, luxury goods. GOVERNANCE: Clan Council of Seven (all dwarf). Unshaken Foundation Sect has strong influence but doesn't directly rule. Iron Body Sect also maintains significant presence. Political tension between the two sects over resource allocation. THREAT LEVEL: CRITICAL - Lady Aurex (Greed) opened her Continental Gate in nearby mountains five years ago specifically targeting this region's wealth. Multiple mining outposts have gone completely silent. Entire mining clans have disappeared. Aurex's forces conducting systematic conquest of mines while creating cult networks among greedy miners. The city itself remains secure but outlying regions are demon territory. Several deep mines have been permanently sealed after demonic corruption detected. DEFENSES: Mountain fortress with only three accessible entrances (all heavily fortified). Extensive underground tunnel network. Garrison of 20,000 warriors (mix of city guard and clan warriors) plus 1,200 Unshaken Foundation disciples and 600 Iron Body disciples. Earth-path and body-reinforcement formations throughout. NOTABLE LOCATIONS: The Deep Forges (legendary smith district), Mithril Vaults (secure storage), The Foundry (massive smelting complex), Clan Halls (seven major dwarf clans), The Crystal Mines (highest quality ore), Aurex's Vault (nickname for her Continental Gate location - 50km northeast). TRAVEL TIMES: To Titan's Rest - 3 days by mountain path. To Perfect Form monastery - 5 days. To Ironpeak Citadel - 2 days. To coast - 1 week. [ location(Central Frostholm mountains); population(600k); type(Mining City/Fortress); threat(Aurex close - active siege warfare); status(Under siege); importance(Critical - metal production); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 502,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "511": {
      "uid": 511,
      "key": [
        "Stormhaven",
        "Scattered Isles hub",
        "naval capital"
      ],
      "keysecondary": [],
      "comment": "Stormhaven - Scattered Isles Trading Capital",
      "content": "LOCATION: Stormcrown Island (largest island in Scattered Isles), natural harbor protected by surrounding reefs. POPULATION: 500,000. Most diverse population in Scattered Isles - all races present. Significant harpy and wind-blessed populations. ECONOMY: Naval trade and shipping. Hub connecting all five major islands and serving as waypoint for intercontinental trade. Famous for shipbuilding, navigation tools, and wind-cultivation resources. Sky-ship construction headquarters. Exports: ships, navigation arrays, wind techniques, island goods. Imports: everything else. GDP entirely based on trade facilitation. GOVERNANCE: Harbor Council (mixed race, elected by merchant guilds). Soaring Freedom Sect has strong presence but prefers minimal interference. THREAT LEVEL: HIGH - Caught between Countess Vespera (Temptation) near Dawnhaven to south and Sister Elowen (Envy) near Frostshore to north. Many small surrounding islands have fallen to cults. Vespera's corruption spreading through promises of power and forbidden knowledge - particularly effective on ambitious island lords and merchants. Several prominent families suspected of corruption. Pirates (possibly demon-backed) increasing attacks on shipping. DEFENSES: Naval fleet of 500+ ships (largest in Sinveil). Garrison of 8,000 marines plus 600 Soaring Freedom disciples. Wind-path formation arrays. Multiple sky-ship defensive batteries. Strong city walls but primary defense is naval power. NOTABLE LOCATIONS: The Skyport (sky-ship docks), Grand Harbor (deep-water port for conventional ships), Wind Temple (Soaring Freedom branch), Shipwright's District, The Navigator's Guild, Stormcrown Palace (Harbor Council seat). TRAVEL TIMES: Between major islands - 1-3 days by ship. To any continent - 2-4 weeks depending on destination and winds. Sky-ships can halve travel time but are expensive. [ location(Stormcrown Island, Scattered Isles); population(500k); type(Naval Hub/Trade City); threat(Between two Continental Gates); status(Increasingly dangerous); importance(High - trade nexus); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 503,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "512": {
      "uid": 512,
      "key": [
        "Mistport",
        "Mistmere city",
        "swamp trade"
      ],
      "keysecondary": [],
      "comment": "Mistport - Mistmere's Only Major City",
      "content": "LOCATION: Eastern edge of Mistmere, where the marshlands meet the coast. Built on stilts and elevated platforms above the swamp. POPULATION: 200,000. Smallest major city but most important in Mistmere. Majority human, goblin, felkin. Significant refugee population fleeing inland demon activity. ECONOMY: Alchemical ingredients, shadow-cultivation resources, rare swamp herbs, exotic poisons. Hub for trade between isolated marsh communities. Famous for master alchemists and poison-makers. Exports: rare herbs, alchemical ingredients, poisons, antidotes, shadow techniques. Imports: food, metal, lumber. GOVERNANCE: Council of Shadows (mix of merchants and Veiled Mercy representatives). Veiled Mercy Sect has strongest presence here of any sect in any city - effectively runs the place. THREAT LEVEL: EXTREME - Caught between Lord Morvane (Sloth) in western reaches and Sister Elowen (Envy) in eastern marshes. Dozens of inland villages have fallen to despair or turned on each other. Massive refugee crisis. City itself protected by Veiled Mercy operatives but surrounding area is demon territory. Morvane's apathy mists have caused entire settlements to simply give up and waste away. Elowen's mirror-devils sow jealousy and paranoia. Cult activity rampant in refugee districts. DEFENSES: Shadow-path formation arrays make city extremely difficult to locate or approach without guidance. No walls (wouldn't work in swamp) but maze of waterways and kill zones. Garrison of 3,000 city guard plus 1,500 Veiled Mercy disciples (highest sect concentration anywhere). Evacuation plans to Shadowhaven if city falls. NOTABLE LOCATIONS: The Poison Markets (alchemical trade), Shadow's Refuge (massive refugee camp), The Moss Quarter (poorest district), Hidden Docks (secret waterways to Shadowhaven), Mercy Houses (Veiled Mercy safe houses). TRAVEL TIMES: To Shadowhaven - unknown to outsiders (3-5 days if you know the way). To coast - at coast. To Primereach by ship - 2-3 weeks. Inland travel nearly impossible due to demon activity. [ location(Eastern Mistmere coast); population(200k + refugees); type(Trade City/Refugee Hub); threat(Between two Continental Gates - active war zone); status(Crisis mode); importance(Medium but critical for Mistmere); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 504,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "513": {
      "uid": 513,
      "key": [
        "Vaelen's domain",
        "Pride Legion territory",
        "corrupted Primereach"
      ],
      "keysecondary": [],
      "comment": "DANGEROUS ZONE: Vaelen's Shadowlands (Southern Primereach)",
      "content": "LOCATION: 30 kilometers south of Ebonspire, centered on Vaelen's Continental Gate. Area of approximately 500 square kilometers showing demonic corruption. CORRUPTION TYPE: Pride/Superiority. Unlike other Generals who use brute force, Lord Vaelen (Pride, peak Eternal realm) conducts psychological warfare. The area appears superficially normal - villages still function, farms still produce - but subtle wrongness permeates everything. MANIFESTATIONS: Residents develop pathological arrogance and superiority complexes. Neighbors compete obsessively over petty matters. Violence erupts over perceived slights. Successful individuals become tyrants over their communities. Cultivation talent leads to insufferable superiority. The corrupted genuinely believe they are superior beings and deserve to rule. DEMOGRAPHICS: Population of 100,000+ before corruption, now estimated 70,000 (30% fled or killed). Multiple villages, three small towns. Unknown how many are corrupted vs. trapped. DEMON FORCES: Vaelen's Legion patrols the area. 2,000+ Pride Devils of various types (see enemy entries). They don't need to force anything - corrupted mortals enforce Pride naturally and fight to protect their 'superior' territory from 'inferior' outsiders. ORTHODOX RESPONSE: Quarantine zone. Righteous Blade Sect maintains perimeter but cannot risk major assault this close to Ebonspire. Rescue operations extremely difficult - corrupted fight to stay. Veiled Mercy operatives occasionally infiltrate to extract those who request help. Alliance deeply divided on response. STRATEGIC IMPORTANCE: Vaelen's placement is calculated insult and strategic masterstroke. Close enough to threaten Ebonspire directly if needed, but he doesn't need to - his corruption spreads into the city itself. Multiple Alliance council members suspected of Pride corruption. Vaelen is playing long game of inevitable superiority rather than quick conquest. DANGER LEVEL: EXTREME for most. Primordial bloodline holders and those with exceptional mental fortitude may resist corruption. Pride corruption is subtle - victims don't realize they're corrupted. Bronze-Gold cultivators should avoid entirely. [ location(Southern Primereach); size(500 sq km); type(Corrupted Territory - Pride); General(Vaelen); danger(Extreme - mental corruption); status(Quarantined but spreading); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 510,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "514": {
      "uid": 514,
      "key": [
        "Calderon's warzone",
        "Wrath Legion territory",
        "northern Solhara"
      ],
      "keysecondary": [],
      "comment": "DANGEROUS ZONE: The Burning Wastes (Northern Solhara)",
      "content": "LOCATION: Northern Solhara, centered on Duke Calderon's Continental Gate. Area of approximately 2,000 square kilometers of active war zone. CORRUPTION TYPE: Wrath/Violence. Duke Calderon (Wrath, mid Void realm) is the most overtly aggressive General. This is not subtle infiltration - this is open warfare and conquest. MANIFESTATIONS: Extreme aggression and violence. Minor irritations become murderous rage. Peace impossible - everyone constantly fights. Corrupted cannot control anger and attack anything nearby. Eventually self-destruct in berserker fury. Area is literal wasteland of burned settlements and corpses. DEMOGRAPHICS: Population of 300,000+ before corruption. Current population: UNKNOWN - presumed mostly dead or fled. Dozens of villages destroyed completely. Multiple small cities fallen. Few survivors. DEMON FORCES: Calderon's Legion actively campaigns. 5,000+ Wrath Devils conducting raids. Multiple warband platoons (100-500 devils each). They don't need to hold territory - they burn everything and move on. Blazing Heart Sect engaging in running battles. Open warfare for five years. ORTHODOX RESPONSE: Active military conflict. Blazing Heart Sect has mobilized fully and is fighting Calderon's forces directly. Flame Lord Kaelen personally leads disciples in battle. Multiple skirmishes weekly, several major battles. Alliance refuses to commit additional forces - only Blazing Heart fighting. Casualties mounting on both sides. STRATEGIC IMPORTANCE: Calderon's aggression is deliberate. He's forcing Blazing Heart to fight alone, proving Alliance won't help. When Blazing Heart falls (or is severely weakened), nothing protects Solhara. Calderon gambling that overwhelming violence will work before Alliance mobilizes. DANGER LEVEL: EXTREME. Active war zone. Bronze-Silver cultivators will die quickly. Gold-Astral can survive if skilled. Void+ needed to truly contribute. Wrath corruption spreads through injury - being wounded by Wrath Devil or corrupted cultist can infect victim with rage. [ location(Northern Solhara); size(2,000 sq km); type(War Zone - Wrath); General(Calderon); danger(Extreme - active combat); status(Open warfare); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 511,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "515": {
      "uid": 515,
      "key": [
        "Glut's devastation",
        "Gluttony Legion territory",
        "southern Solhara"
      ],
      "keysecondary": [],
      "comment": "DANGEROUS ZONE: The Consumed Lands (Southern Solhara)",
      "content": "LOCATION: Far southern Solhara, centered on Baron Glut's Continental Gate. Area of approximately 1,500 square kilometers of complete devastation. CORRUPTION TYPE: Gluttony/Consumption. Baron Glut (Gluttony, low Void realm) is least subtle of all Generals - his territory is simply GONE. Everything consumed. MANIFESTATIONS: Insatiable hunger that cannot be satisfied. Corrupted eat everything - food, plants, animals, each other. Eventually consume themselves. Nothing grows. Nothing survives. Area is barren wasteland. Not even corpses remain - everything eaten. DEMOGRAPHICS: Population of 200,000+ before corruption. Current population: ZERO. Multiple oasis towns, several large settlements - all gone. Completely consumed. No survivors found. Gluttony Legion leaves no witnesses. DEMON FORCES: Glut's Legion are all consumption-focused devils. 1,000+ Gluttony Devils (least organized legion but most destructive). They consume everything in path then move to next target. Leave complete devastation. Easiest to track (obvious wasteland trail) but hardest to stop (too hungry to negotiate or reason with). ORTHODOX RESPONSE: Area declared total loss. Blazing Heart Sect evacuated all settlements in path and established defensive perimeter 100 km from Consumed Lands. Multiple fortified checkpoints prevent expansion. Scorched earth policy - destroy anything Gluttony Legion could consume before they arrive. Works so far but expensive. STRATEGIC IMPORTANCE: Glut's strategy is simple attrition. Consume everything until there's nothing left. His legion is smallest and least organized (too hungry to coordinate well) but leaves permanent destruction. Unlike Wrath that can be rebuilt, Gluttony-corrupted land takes decades to recover even after demons cleared. DANGER LEVEL: EXTREME. Do not enter. There is nothing there - no resources, no people, no reason to go. Gluttony Devils will attack and attempt to consume anyone detected. Gluttony corruption spreads through consumption - eating anything from corrupted area can infect victim with insatiable hunger. [ location(Southern Solhara); size(1,500 sq km growing); type(Wasteland - Gluttony); General(Glut); danger(Extreme - consumption); status(Total loss); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 512,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "516": {
      "uid": 516,
      "key": [
        "Aurex's mines",
        "Greed Legion territory",
        "Frostholm mountains"
      ],
      "keysecondary": [],
      "comment": "DANGEROUS ZONE: The Silent Mines (Central Frostholm)",
      "content": "LOCATION: Central Frostholm mountains, centered on Lady Aurex's Continental Gate. Approximately 1,000 square kilometers of mining territory. CORRUPTION TYPE: Greed/Avarice. Lady Aurex (Greed, mid Eternal realm) conducts systematic conquest of valuable mining operations. Most sophisticated economic warfare of all Generals. MANIFESTATIONS: Pathological greed and hoarding. Corrupted obsess over wealth and resources. Families turn on each other over gold. Mining clans fight over claims. Eventually corrupted hoard treasure and starve rather than spend. Those most afflicted become living treasure guardians - they merge with their hoards and attack anything that approaches. DEMOGRAPHICS: Population of 150,000+ miners across dozens of mining towns and camps. Current status: 60% of settlements gone silent. Estimated 40,000+ dead or corrupted, 50,000+ fled, 60,000 holding out in fortified towns. Multiple entire mining clans have disappeared. DEMON FORCES: Aurex's Legion specializes in theft and hoarding. 3,000+ Greed Devils (see enemy entries - Gold-Hunger Raiders, Vault Wardens, Treasure Hoarders, etc.). They systematically seize mines, steal equipment, corrupt mine owners. Aurex herself maintains massive vault in her Continental Gate area filled with stolen treasure. Cult networks among greedy miners provide intelligence and sabotage. ORTHODOX RESPONSE: Mixed. Unshaken Foundation Sect and Iron Body Sect both responding but political tension between them hampers cooperation. Multiple fortified towns holding out. Ironforge sent relief forces but many ambushed in mountain passes. Elder Borin dispatched scouts to verify extent of corruption. Sect forces fighting defensive war to protect remaining mines. STRATEGIC IMPORTANCE: Aurex targets Sinveil's metal production. Frostholm provides majority of high-grade cultivation metals, weapons, and armor. If she controls mines, she controls military supply chain. Already causing shortages. Systematic, patient conquest - she's winning. DANGER LEVEL: HIGH to EXTREME depending on location. Fortified towns relatively safe. Open mountain passes and isolated mines are death traps. Greed corruption spreads through treasure - cursed gold and gems deliberately left as bait. [ location(Central Frostholm mountains); size(1,000 sq km); type(Corrupted Mining Region - Greed); General(Aurex); danger(High - ambush warfare); status(Slowly falling); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 513,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "517": {
      "uid": 517,
      "key": [
        "Morvane's dead zone",
        "Sloth Legion territory",
        "western Mistmere"
      ],
      "keysecondary": [],
      "comment": "DANGEROUS ZONE: The Gray Reaches (Western Mistmere)",
      "content": "LOCATION: Western Mistmere marshlands, centered on Lord Morvane's Continental Gate. Approximately 800 square kilometers of 'dead zone'. CORRUPTION TYPE: Sloth/Apathy. Lord Morvane (Sloth, peak Void realm) is most insidious General. His territory doesn't look dangerous - it looks peaceful. That's what makes it terrifying. MANIFESTATIONS: Complete loss of motivation and will. Corrupted simply... stop. They stop working, stop eating, stop caring. Villages still stand but nobody does anything. People sit motionless until they waste away. No violence, no struggle - they just give up. Morvane's apathy mists can cause entire villages to simultaneously lose will to live. DEMOGRAPHICS: Population of 100,000+ before corruption across numerous marsh settlements. Current status: 40+ villages affected. Estimated 30,000+ dead from simple neglect (starvation, exposure, preventable illness). 20,000+ fled. 50,000+ still in area but unknown how many corrupted vs. trapped. Veiled Mercy evacuating those who can still care enough to leave. DEMON FORCES: Morvane's Legion doesn't fight - they don't have to. 2,000+ Sloth Devils (Hollow Ones, Lethargic Shades, Entropy Cultists). They spread despair and apathy. Make effort seem pointless. Victims simply give up. Legion barely pursues fleeing refugees - too much effort. ORTHODOX RESPONSE: Veiled Mercy fighting covert war. Matriarch Senna has operatives trying to evacuate refugees and assassinate key devils. Extremely difficult - how do you fight an enemy that doesn't fight back? Killing devils doesn't help victims who've already lost will. Sect stretched thin trying to protect scattered refugees. STRATEGIC IMPORTANCE: Morvane's strategy is gradual absorption. His territory expands slowly as apathy spreads. He's patient - eventually all Mistmere will simply stop. Most insidious because by the time it's obvious, victims don't care enough to resist. Creates logistical nightmare - Alliance must actively rescue people who won't save themselves. DANGER LEVEL: MODERATE but INSIDIOUS. Physical danger is low - Sloth Devils rarely attack directly. Mental danger is extreme. Prolonged exposure to apathy mists can sap will even of strong cultivators. Bronze-Silver cultivators should avoid. Gold-Astral can resist temporarily. Void+ relatively safe. [ location(Western Mistmere); size(800 sq km growing slowly); type(Dead Zone - Sloth); General(Morvane); danger(Moderate but insidious - mental); status(Slowly spreading); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 514,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "518": {
      "uid": 518,
      "key": [
        "Elowen's mirror realm",
        "Envy Legion territory",
        "eastern Mistmere",
        "Frostshore"
      ],
      "keysecondary": [],
      "comment": "DANGEROUS ZONE: The Shattered Reflection (Eastern Mistmere & Frostshore Island)",
      "content": "LOCATION: Sister Elowen (Envy) uniquely opened TWO Continental Gates - one in eastern Mistmere marshes, one near Frostshore Island in Scattered Isles. Combined territory approximately 1,200 square kilometers. CORRUPTION TYPE: Envy/Jealousy. Sister Elowen (Envy, low Eternal realm) spreads jealousy and resentment. Her victims turn on each other over perceived advantages. MANIFESTATIONS: Pathological jealousy and resentment. Corrupted obsess over what others have. Neighbors become enemies over petty advantages. Communities self-destruct in paranoid infighting. Families turn on each other. Those most afflicted see everyone as enemy who possesses something they deserve. Elowen's mirror-devils create illusions showing victims what they 'could have' if not for others 'stealing' their opportunities. DEMOGRAPHICS: Eastern Mistmere - 60,000+ before corruption. Multiple marsh communities. Current: 20 villages fallen to paranoia and infighting. Estimated 20,000 dead in internal conflicts, 15,000 fled, 25,000 status unknown. Frostshore Island - 80,000+ before corruption. Three small port towns. Current: One town completely destroyed itself, second under quarantine, third evacuated. Estimated 30,000 dead, 30,000 fled, 20,000 corrupted or trapped. DEMON FORCES: Elowen's Legion in both locations. Approximately 2,500 Envy Devils total (Mirror-Devils, Reflection Wraiths, Jealousy Cultists, etc.). They don't need to fight - they show victims what others have and let jealousy do the work. Two separate forces compete with each other (even Elowen's own legion suffers Envy). ORTHODOX RESPONSE: Veiled Mercy fighting in eastern Mistmere (already stretched thin against Morvane). Soaring Freedom Sect and Eternal Dawn Sect both dismissive of Frostshore situation - attribute to 'normal' crime and social problems. Multiple villages self-destructed before sects realized demonic involvement. Elowen's corruption hardest to detect because it mimics human jealousy. STRATEGIC IMPORTANCE: Elowen's dual-gate strategy is unique. She's maximizing her influence by corrupting two regions simultaneously. Eastern Mistmere pressures Veiled Mercy's flank. Frostshore disrupts Scattered Isles naval power. Both locations sow discord that spreads beyond corrupted areas - jealousy is contagious. DANGER LEVEL: HIGH. Physical danger moderate, mental danger high. Envy corruption spreads through social interaction - even brief exposure to corrupted individuals can plant seeds of jealousy. Strong-willed cultivators can resist but prolonged exposure wears down defenses. Bronze-Silver vulnerable. [ location(Eastern Mistmere & Frostshore Island); size(1,200 sq km combined); type(Paranoia Zones - Envy); General(Elowen); danger(High - mental/social); status(Self-destructing); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 515,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "519": {
      "uid": 519,
      "key": [
        "Vespera's web",
        "Temptation Legion territory",
        "southern Scattered Isles"
      ],
      "keysecondary": [],
      "comment": "DANGEROUS ZONE: The Whispered Isles (Southern Scattered Isles)",
      "content": "LOCATION: Southern Scattered Isles near Dawnhaven, centered on Countess Vespera's Continental Gate. Approximately 30+ small islands (500-2,000 square kilometers of island territory). CORRUPTION TYPE: Temptation/Seduction. Countess Vespera (Temptation, low Eternal realm) is most sophisticated corrupter. Her victims don't realize they're corrupted until too late. MANIFESTATIONS: Promises of power and forbidden knowledge. Corrupted offered shortcuts to advancement. 'Just this once' compromises that escalate. Dark desires fulfilled. Power through corruption. Victims rationalize increasingly terrible choices as 'necessary' or 'justified'. Eventually completely corrupted but still functioning in society - most dangerous type. DEMOGRAPHICS: 30+ small islands with combined population of 150,000+ before corruption. Current status: Unknown how many corrupted vs. uncorrupted - that's the problem. Estimated 40% of island lords and prominent families corrupted to some degree. Unknown civilian corruption rate. Several entire islands declared independent and now worship Vespera openly. Others corrupted but hiding it. DEMON FORCES: Vespera's Legion most infiltrated. 4,000+ Temptation Devils (Succubi, Incubi, Whisperers, Chain Devils, etc.) spread across dozens of islands. Many disguised as mortals living in communities. Long-term corruption specialists - plant seeds and let them grow. Most sophisticated covert operation of all Generals. ORTHODOX RESPONSE: Largely oblivious. Eternal Dawn Sect (closest) dismisses reports as 'moral failings' rather than demonic corruption. Soaring Freedom Sect too busy with trade to investigate properly. Some traveling disciples encountered demons and returned with warnings - largely ignored. Growing cult presence mostly unnoticed. Several prominent families sponsor 'mystery schools' that are actually Temptation cult fronts. STRATEGIC IMPORTANCE: Vespera's strategy is complete infiltration. By the time orthodox sects realize how corrupted the region is, it'll be too late. She's building power base of willing collaborators who genuinely believe they made smart choices. When other Generals launch open attacks, southern Scattered Isles will 'surprisingly' ally with demons. Vespera particularly targets ambitious cultivators and island lords - exactly the people with power to act. DANGER LEVEL: EXTREME but SUBTLE. Physical danger appears low - islands seem normal. Mental danger is extreme. Temptation corruption spreads through promises and desires - everyone has something they want. Primordial bloodline holders slightly more resistant due to having legitimate power, but ambition still vulnerable. No realm is truly safe - even Void cultivators have desires. [ location(Southern Scattered Isles); size(30+ islands); type(Infiltrated Territory - Temptation); General(Vespera); danger(Extreme but subtle - everyone vulnerable); status(Heavily corrupted but hidden); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 516,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "520": {
      "uid": 520,
      "key": [
        "Abyssal ruins",
        "First Invasion remnants",
        "ancient demon sites"
      ],
      "keysecondary": [],
      "comment": "ANCIENT RUINS: First Invasion Remnants (Multiple Locations)",
      "content": "OVERVIEW: 3,000 years ago during the First Invasion, the Original Generals established multiple forward bases, ritual sites, and strongholds before the Sealing Ritual. Most were destroyed, but some ruins remain - dangerous, corrupted, and potentially containing valuable intelligence or artifacts. KNOWN MAJOR SITES: (1) THE BROKEN GATE (Primereach) - Remains of the original Veil breach location. Sealed by the Eight Sovereigns' ritual. Massive stone archway (50 meters tall) embedded in bedrock, covered in formation arrays and warning runes. Area radiates lingering corruption. Heavily guarded by Righteous Blade Sect - no unauthorized entry. Studying the formation patterns could provide insight into Veil mechanics. Danger: Extreme. Residual corruption can overwhelm Bronze-Gold cultivators instantly. (2) THE SCREAMING TOWERS (Northern Mistmere) - Seven obsidian towers that emit constant wailing sound (source of name). Original General ritual site for mass corruption ceremonies. Towers are indestructible - all attempts to destroy them have failed. Interior filled with trapped souls and lingering curse effects. Veiled Mercy Sect sealed entrances but cannot destroy. Danger: Extreme. Curses inside can kill even Void cultivators. Never explored beyond first chambers. (3) CORRUPTION CRATER (Western Solhara) - 5km wide crater where particularly powerful First Invasion battle occurred. Land still poisoned 3,000 years later - nothing grows. Occasional demon spawn manifest from lingering corruption. Blazing Heart Sect maintains perimeter but doesn't enter. Crater bottom contains ruins of demon fortress. Danger: High. Environmental corruption and spontaneous demon spawns. (4) THE DROWNED CITADEL (Eastern ocean near Primereach) - Underwater demon fortress that sank during First Invasion. Marefolk occasionally explore outer sections. Contains corrupted artifacts and texts. Tranquil Depths Sect prohibits civilian access. Danger: Extreme underwater. Corruption + water pressure + possible guardians. (5) SHATTERED ALTAR (Frostholm peaks) - Mountaintop ritual site used by Original Generals. Partially destroyed in Sealing Ritual. Stone altar cracked but intact, surrounded by ritualistic carvings. Area emanates cold that has nothing to do with temperature - spiritual cold that freezes qi. Unshaken Foundation Sect aware but considers inaccessible (requires Astral+ flight to reach). Danger: High. Spiritual cold and altitude. VALUE: These sites contain corrupted artifacts, demon texts (in Abyssal script), ritual knowledge, and potentially intelligence about demon cultivation methods. Extremely dangerous but potentially valuable for understanding enemy. Orthodox Alliance officially prohibits entry without sect authority. Reality: adventurous cultivators explore anyway. [ type(Ancient Ruins - First Invasion); locations(Multiple continents); danger(High to Extreme); value(Intelligence/Artifacts); status(Sealed or guarded); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 520,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "521": {
      "uid": 521,
      "key": [
        "pre-Sovereign ruins",
        "old civilization",
        "forgotten empire"
      ],
      "keysecondary": [],
      "comment": "ANCIENT RUINS: Pre-Sovereign Civilization Sites",
      "content": "OVERVIEW: The Eight Sovereigns lived 3,000+ years ago, but Sinveil's history extends far earlier. Archaeological evidence suggests advanced civilizations existed before recorded history. Their ruins scattered across all continents - sources of mystery, danger, and occasional treasure. CHARACTERISTICS: Pre-Sovereign ruins show sophisticated formation arrays and cultivation techniques that don't match current orthodox methods. Technology and magic mixed. Construction methods unknown - some structures defy modern understanding. Most sites partially collapsed or buried. Often contain dormant guardian constructs, sealed vaults, or trapped treasures. KNOWN MAJOR SITES: (1) THE BLACK SPIRE (Ebonspire, Primereach) - Massive black obelisk that predates all known civilizations. Utterly indestructible - survived First Invasion, Sealing Ritual, everything. Approximately 300 meters tall. Material unknown - not stone, not metal, doesn't register to cultivation senses. Covered in indecipherable glyphs. Orthodox Alliance built headquarters around it but cannot study it effectively. No entrance found. Danger: Unknown. (2) THE SUNKEN LIBRARIES (Multiple ocean locations) - At least seven confirmed underwater library complexes from pre-Sovereign era. Marefolk and Nereid explorers have mapped exteriors but few dare enter. Interior preservation formations still function after millennia. Contents unknown. Tranquil Depths Sect funds expeditions but success rate low. Danger: Extreme underwater. Guardian constructs still active. (3) THE CRYSTAL CAVES (Scattered Isles) - Cave system filled with naturally-forming qi crystals of impossible purity. Source unknown - crystals appear to grow from nothing. Pre-Sovereign structure detected deep in caves but unreachable due to spatial distortions. Soaring Freedom Sect harvests outer crystals but won't risk inner caves. Danger: High. Spatial distortions can trap or kill. (4) THE TITAN'S CROWN (Northern Frostholm) - Ring of standing stones on barren plateau. Not related to King Titan - predates him by millennia. Stones arranged in perfect circle 500 meters diameter. Astronomical alignment obvious but purpose unknown. Area has strange qi fluctuations during solstices. No treasure found but scholars believe it's ceremonial site. Danger: Low normally, Unknown during solstices. (5) THE WHISPERING DESERT (Central Solhara) - Square mile of desert where sand whispers in unknown language. Occasionally reveals buried structures then re-covers them. Multiple expeditions have found and lost same ruins repeatedly. Blazing Heart Sect considers it haunted or cursed. Some scholars think it's failed dimensional pocket. Danger: Moderate. Easy to get lost. VALUE: Pre-Sovereign ruins occasionally yield cultivation techniques, unique artifacts, or formation knowledge unavailable elsewhere. Most finds require significant scholarship to understand. Appeal to archaeologists, scholars, and treasure hunters despite dangers. [ type(Ancient Ruins - Pre-Sovereign); locations(Multiple continents); danger(Moderate to Extreme); value(Unique knowledge/artifacts); status(Mostly unexplored); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 521,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "522": {
      "uid": 522,
      "key": [
        "Sovereign inheritance",
        "hidden legacy",
        "Pyrrhus legacy"
      ],
      "keysecondary": [],
      "comment": "INHERITANCE SITE: The Crucible of Undying Flame (Solhara)",
      "content": "LOCATION: Deep within the Sunfire Desert, Solhara. Hidden underground chamber accessible only through secret passage known to Blazing Heart Sect elders. Approximately 200km from Sunforge Citadel. LEGEND: Lord Pyrrhus the Undying knew the Sealing Ritual would consume his power completely. In the years before the ritual, he secretly prepared this inheritance site for future Fire Path masters. Contains his personal cultivation insights, advanced Fire techniques (up to Sovereign-tier), and the Undying Core - a condensed fragment of his Sovereign cultivation base. TRIALS: Access requires passing three trials. (1) COURAGE TRIAL - Walk through corridor of true Sovereign-tier flames that will kill anyone below Astral realm or lacking absolute courage. Fear means death - flames sense hesitation. (2) PASSION TRIAL - Confront illusion showing what matters most to candidate, then choose to sacrifice it for greater good. Tests commitment. (3) BURNING HEART TRIAL - Cultivate Fire Path in sealed chamber with Sovereign-tier heat for three days without rest. Tests endurance and cultivation talent. REWARDS: Those who pass all three trials gain access to chamber containing: (1) Pyrrhus's Sovereign Manual (complete Fire Path cultivation up to Sovereign realm), (2) Seven Sovereign Fire Techniques (including 'Solar Cataclysm' and 'Undying Phoenix Rebirth'), (3) The Undying Core (can be absorbed by Eternal realm+ Fire cultivator to boost cultivation), (4) Pyrrhus's personal weapon (Flame Emperor's Blade - legendary artifact). CURRENT STATUS: Location known to Blazing Heart Sect Master (Flame Lord Kaelen) and three senior elders. Not public knowledge. Sect policy: only worthy disciples informed after reaching Void realm. In 3,000 years, only 12 cultivators have attempted trials. 7 died in Courage Trial. 2 failed Passion Trial. 2 passed all trials and became legendary Fire Path masters (both eventually reached Eternal realm). 1 currently attempting (entered 2 months ago, status unknown). DANGER LEVEL: LETHAL. Designed by Sovereign for Void+ cultivators. Bronze-Gold attempting would die instantly. Silver-Astral might survive Courage Trial with fire-immunity artifacts but likely fail Passion Trial. Void realm minimum recommendation, Eternal preferred. [ location(Sunfire Desert, Solhara); type(Sovereign Inheritance); path(Fire); danger(Extreme - for Void+ only); status(Hidden - sect secret); rewards(Sovereign Manual, techniques, artifacts); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 530,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "523": {
      "uid": 523,
      "key": [
        "Maren inheritance",
        "Water legacy",
        "Tranquil legacy"
      ],
      "keysecondary": [],
      "comment": "INHERITANCE SITE: The Depths of Eternal Wisdom (Primereach)",
      "content": "LOCATION: Beneath Clearwater Lake (where Tranquil Depths Sect headquarters sits), Primereach. Accessible through secret passage in the Great Library that leads to underwater cave system. Only sect elders know location. LEGEND: Lady Maren the Tranquil survived the Sealing Ritual and lived nearly 3,000 additional years. Before her death 500 years ago, she prepared comprehensive inheritance for future Water Path masters. Unlike Pyrrhus's combat-focused legacy, Maren's emphasizes wisdom, knowledge, and complete cultivation understanding. TRIALS: Access requires passing three trials. (1) WISDOM TRIAL - Solve series of increasingly complex philosophical and cultivation puzzles while submerged underwater. Tests intelligence and ability to think clearly under pressure. (2) SERENITY TRIAL - Meditate underwater for 7 days while formation arrays assault mind with every negative emotion (fear, anger, despair, etc.). Must maintain perfect serenity. Tests mental fortitude. (3) DEPTHS TRIAL - Navigate labyrinth of underwater caves while formations create illusions and distractions. Find true path using only cultivation insights. Tests perception and understanding. REWARDS: Those who pass gain access to Lady Maren's personal library containing: (1) The Tranquil Path Manual (complete Water Path cultivation to Sovereign realm), (2) Maren's Personal Journals (3,000 years of cultivation insights and philosophy), (3) Nine Sovereign Water Techniques (including 'Ocean's Embrace' and 'Tide of Inevitability'), (4) The Wisdom Pearl (artifact containing fragment of Maren's consciousness that can answer questions), (5) Bloodline Infusion documentation (theoretical notes on the forbidden technique - she researched it but never used it herself). CURRENT STATUS: Location known to Tranquil Depths Sect Master (Grand Scholar Elara) and head librarian (Elder Caius). Very select Void disciples informed. In 500 years since Maren's death, 8 cultivators have attempted trials. 2 failed Wisdom Trial. 3 failed Serenity Trial. 3 completed all trials - one became Eternal, two currently Void. Most valuable inheritance for scholars rather than pure warriors. Elder Caius personally completed trials 200 years ago - his knowledge comes partially from Wisdom Pearl. DANGER LEVEL: MODERATE to HIGH. Designed by survivor Sovereign who understood trials should test worthiness without automatic death. Astral cultivators can survive attempts (though unlikely to succeed). Void recommended. Main danger is drowning during extended underwater trials. [ location(Beneath Clearwater Lake, Primereach); type(Sovereign Inheritance); path(Water); danger(Moderate to High - for Astral+ ideally); status(Hidden - sect secret); rewards(Sovereign Manual, journals, techniques, Wisdom Pearl); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 531,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "524": {
      "uid": 524,
      "key": [
        "Titan inheritance",
        "Earth legacy",
        "Immovable legacy"
      ],
      "keysecondary": [],
      "comment": "INHERITANCE SITE: The Unbreakable Mountain (Frostholm)",
      "content": "LOCATION: Deep beneath the Titan's Rest (where King Titan died 20 years ago), Frostholm. Accessible through secret passage that only opens during earthquakes. Unshaken Foundation Sect aware of location but cannot access reliably. LEGEND: King Titan the Immovable survived the Sealing Ritual and led demon cleanup for nearly 3,000 years. Unlike other survivor Sovereigns, he prepared two inheritance sites - one for general cultivation knowledge (this one), and one personal legacy for his bloodline child (unknown location). This public inheritance focuses on Earth Path mastery and defensive cultivation. TRIALS: Access requires passing three trials. (1) ENDURANCE TRIAL - Carry progressively heavier boulders up mountain path while formations increase gravity. Weight eventually reaches Sovereign-tier. Tests physical strength and determination. Most fail here. (2) STEADFAST TRIAL - Stand motionless in sealed chamber while formations create earthquakes, attacks, illusions, and temptations. Must remain completely still for 7 days. Single movement fails trial. Tests discipline. (3) IMMOVABLE TRIAL - Defend fixed position against increasingly powerful golem attacks without retreating single step. Golems eventually reach Void-tier power. Must hold ground. Tests defensive skills. REWARDS: Those who pass gain: (1) The Immovable Manual (complete Earth Path cultivation to Sovereign realm), (2) Titan's Defensive Compendium (every defensive technique he learned in 3,000 years), (3) Eight Sovereign Earth Techniques (including 'Mountain's Wrath' and 'Earthen Immortality'), (4) Titan's personal armor (legendary artifact - increases defense by entire realm), (5) Duty's Weight (philosophical text about responsibility and protection). CURRENT STATUS: Location known to Unshaken Foundation Sect Master (Grandmaster Borin) and senior elders. Only accessible during earthquakes, which occur unpredictably (every 1-3 years in that region). In 20 years since Titan's death, entrance has opened 8 times. 6 cultivators attempted trials. 4 died in Endurance Trial (literally crushed under weight). 1 failed Steadfast Trial. 1 completed all trials 7 years ago - now peak Void elder of sect. DANGER LEVEL: EXTREME. Titan designed trials for those with absolute defensive focus. Endurance Trial will literally crush anyone without Void-tier body cultivation or excellent Earth techniques. Not accessible to attackers or speed-focused cultivators - must be defensive specialist. Void realm minimum, Eternal preferred. [ location(Beneath Titan's Rest, Frostholm); type(Sovereign Inheritance); path(Earth); danger(Extreme - for Void+ defensive specialists); status(Hidden - earthquake access only); rewards(Sovereign Manual, defensive techniques, armor); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 532,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "525": {
      "uid": 525,
      "key": [
        "Umbra inheritance",
        "Shadow legacy",
        "Merciful legacy"
      ],
      "keysecondary": [],
      "comment": "INHERITANCE SITE: The Shadow's Mercy (Mistmere)",
      "content": "LOCATION: Hidden within the Shadow's Rest (where Lady Umbra died 20-25 years ago), Mistmere. Only accessible to Shadow Path cultivators - Light Path literally cannot perceive entrance. Veiled Mercy Sect protects site but entrance shows itself to worthy individuals regardless of sect affiliation. LEGEND: Lady Umbra the Merciful survived Sealing Ritual and spent 2,000+ years as phantom protector - assassinating demon targets while saving refugees. Like King Titan, she prepared two inheritance sites before her death - this public one for Shadow Path masters, and personal legacy for her bloodline child (unknown location). This inheritance emphasizes the paradox she embodied: the killer who saves lives. TRIALS: Access requires passing three trials. (1) MERCY TRIAL - Navigate scenario where saving innocent requires killing someone else. Must make impossible choice and live with consequences. Tests moral complexity. (2) SHADOW TRIAL - Hunt and eliminate formation-generated targets while protecting simultaneous formation-generated innocents in same space. Targets hide among innocents. Killing innocent fails trial. Missing target who kills innocent fails trial. Tests precision and judgment. (3) COMPASSION TRIAL - Experience memories of everyone candidate has ever killed or failed to save. Forced to feel their fear, pain, regret. Must emerge with compassion intact despite understanding cost of actions. Tests whether candidate can kill without becoming monster. REWARDS: Those who pass gain: (1) The Merciful Shadow Manual (complete Shadow Path cultivation to Sovereign realm), (2) Umbra's Assassination Techniques (lethal shadow arts up to Sovereign-tier), (3) Umbra's Mercy Techniques (protection and rescue shadow arts), (4) The Phantom Cloak (legendary artifact - perfect invisibility below Eternal realm detection), (5) Umbra's Journals (2,000 years of philosophy about killing, mercy, and moral weight of violence). CURRENT STATUS: Location known to Veiled Mercy Sect leadership. Entrance reveals itself to worthy Shadow cultivators automatically - sect cannot control access. In 20-25 years since Umbra's death, entrance has appeared to 5 individuals. 1 refused to enter (couldn't face moral trials). 2 failed Mercy Trial (made wrong choice). 1 failed Compassion Trial (couldn't handle guilt). 1 completed trials 5 years ago - now senior Veiled Mercy operative. Matriarch Senna herself attempted 18 years ago and failed Compassion Trial (guilt over family's death broke her). DANGER LEVEL: HIGH but different type. Trials are psychologically devastating even if not physically lethal. Designed to test character rather than power. Astral realm can survive attempts. Void preferred. Real danger is mental/emotional trauma from trials. [ location(Shadow's Rest, Mistmere); type(Sovereign Inheritance); path(Shadow); danger(High - psychological); status(Hidden - shows itself to worthy); rewards(Sovereign Manual, techniques, Phantom Cloak, journals); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 533,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "526": {
      "uid": 526,
      "key": [
        "minor inheritances",
        "Sovereign caches",
        "hidden legacies"
      ],
      "keysecondary": [],
      "comment": "INHERITANCE SITES: Minor Sovereign Legacies",
      "content": "OVERVIEW: In addition to major inheritance sites, the Eight Sovereigns left smaller caches, hidden techniques, and personal items scattered across Sinveil. Some prepared deliberately, others lost in battles or left behind when they died. These minor inheritances offer valuable cultivation resources without full Sovereign legacies. KNOWN LOCATIONS: (1) AERIS'S WIND SHRINES (Various clifftops, Scattered Isles) - Lady Aeris left no central inheritance. Instead, followers built shrines wherever wind is strongest. Occasionally, shrine will activate during storm and offer vision of Aeris teaching Wind technique. Random, unpredictable, but profound when happens. Danger: Low. (2) HONORUS'S BLADE CACHES (Hidden across Primereach) - Blademaster Honorus scattered practice swords inscribed with technique instructions across Primereach. Finding one grants Sword technique (up to Astral-tier). Righteous Blade Sect seeks them but many remain hidden. Danger: Low to Moderate depending on location. (3) CELESTINE'S LIGHT VERSES (The Eternal Dawn, Scattered Isles) - Saint Celestine left carved verses throughout Eternal Dawn site. Meditating on verses can grant insights into Light cultivation. Non-dangerous but requires time and understanding. Danger: None. (4) ADAMANT'S TRIALS (Scattered mountain peaks, Frostholm) - Monk Adamant left smaller versions of his perfection trials on multiple mountain peaks. Completing one grants Body technique (up to Gold-tier). Iron Body Sect knows several locations. Danger: Moderate. (5) PYRRHUS'S FLAMES (Active volcanoes, Solhara) - Lord Pyrrhus left fragments of his flame essence in multiple volcanoes beyond main Ardor Shrine. Cultivating near them accelerates Fire training. Not formal inheritance but useful. Danger: High - volcanic environment. (6) MAREN'S POOLS (Hidden springs, various) - Lady Maren created several hidden meditation springs across continents. Cultivating at one accelerates Water training and grants insights. Tranquil Depths Sect searches for them. Danger: Low. (7) TITAN'S STONES (Battlefields, various) - King Titan left marked stones at significant battlefield locations. Finding one and meditating grants vision of that battle, teaching strategic lessons. Historical value. Danger: Low. (8) UMBRA'S SAFE HOUSES (Hidden, Mistmere) - Lady Umbra's refugee network included dozens of hidden safe houses. Some contain supplies, techniques, or artifacts she left for future protectors. Veiled Mercy Sect still discovering them. Danger: Low to Moderate. VALUE: Minor inheritances offer techniques up to Astral-tier (occasionally Void), artifacts, or cultivation insights. More accessible than major Sovereign sites. Appeal to Gold-Void cultivators seeking advancement. Significantly less dangerous than full inheritance trials but also less rewarding. [ type(Minor Inheritances - Various Sovereigns); locations(Multiple continents); danger(Low to Moderate); value(Techniques, insights, artifacts up to Void-tier); status(Some known, many hidden); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 534,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "527": {
      "uid": 527,
      "key": [
        "trade routes",
        "continental shipping",
        "intercontinental travel"
      ],
      "keysecondary": [],
      "comment": "TRAVEL INFRASTRUCTURE: Major Trade Routes",
      "content": "OVERVIEW: Five continents require extensive trade networks. Three primary methods: land routes (within continents), sea routes (between continents), and sky-ships (expensive but fast). MAJOR INTERCONTINENTAL ROUTES: (1) THE GOLDEN LANE (Solhara -> Primereach) - Busiest shipping route. Regular merchant convoys by sea (2-3 weeks). Sky-ships available (1 week, 10x cost). Relatively safe historically but increasing pirate/demon activity last 5 years. Goldport to Primereach eastern ports. Volume: 500+ ships monthly. (2) THE IRON PATH (Frostholm -> Primereach) - Land and sea combined. Merchant caravans travel overland where possible, sea for gaps (3-4 weeks total). Sky-ships rare (mountainous = dangerous winds). Ironforge metal exports to Primereach. Increasing demon ambush danger in mountain passes. Volume: 200+ caravans monthly. (3) THE SCATTERED TRADE WEB (Scattered Isles -> everywhere) - Complex network of island-hopping routes. Stormhaven hub connects to all continents. To Primereach: 2 weeks. To Solhara: 2 weeks. To Frostholm: 3 weeks (cold waters dangerous). To Mistmere: 2.5 weeks. Sky-ships thrive here (islands = safe harbors). Volume: 1,000+ ships monthly (busiest sea lanes). (4) THE SHADOW CURRENT (Mistmere -> Primereach) - Lesser route due to swamp difficulty. Mostly by sea from Mistport. 2-3 weeks. Low volume but valuable alchemical trade. Demon activity making route increasingly dangerous. Volume: 50+ ships monthly. LAND ROUTES (WITHIN CONTINENTS): (1) Primereach - Best road network. Ebonspire to any major city: 3-7 days by horse/cart. Well-maintained, regularly patrolled by Alliance forces. Safest roads in Sinveil. (2) Solhara - Desert travel dangerous but established caravan routes. Sunforge Citadel to Goldport: 5 days through desert (experienced guides required). Coastal roads better maintained. (3) Frostholm - Mountain passes treacherous. Roads exist but weather and terrain dangerous. Ironforge to coast: 1 week minimum. Winter travel sometimes impossible. Currently demon ambushes added danger. (4) Mistmere - Terrible infrastructure. Marsh travel requires boats and guides. Most settlements accessible only by water. Mistport to interior villages: days to weeks depending on destination. (5) Scattered Isles - No land routes (islands). All travel by ship or sky-ship between islands. Within large islands: 1-3 days between settlements. SKY-SHIP ADVANTAGES/COSTS: Sky-ships powered by Wind cultivation formations. Speed: 2-3x faster than sea, 5-10x faster than land. Cost: 10x conventional travel. Capacity: Limited (50-100 passengers max). Availability: Only major cities have sky-ports. Soaring Freedom Sect monopoly on construction/operation. Safety: Very safe from conventional threats, vulnerable to demon aerial attacks (increasing concern). Luxury option for wealthy/urgent travel. TRAVEL TIMES SUMMARY (Conventional): - Within continent: 1-7 days (major cities). - Between adjacent continents: 2-3 weeks by sea. - Cross-world travel: 4-6 weeks (ex: Frostholm to Scattered Isles). - Sky-ships: Cut time by 50-70% but expensive. [ type(Trade Routes); methods(Land, sea, sky-ship); times(Days to weeks); status(Increasingly dangerous); importance(Critical for economy); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 540,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "528": {
      "uid": 528,
      "key": [
        "random encounters",
        "wilderness danger",
        "travel hazards"
      ],
      "keysecondary": [],
      "comment": "TRAVEL HAZARDS: Random Encounter Zones",
      "content": "OVERVIEW: Wilderness travel in Sinveil has always been dangerous. Beasts, bandits, and natural hazards threaten travelers. Last 5 years, demon activity added new threat category. Encounter likelihood varies by region and route. ENCOUNTER CATEGORIES: (1) NORMAL WILDLIFE - Bronze-Gold tier beasts. Dangerous to mortals and low-rank cultivators. Common in all wilderness areas. Can usually be avoided or scared off by Gold+ cultivators. (2) BANDITS/ROGUES - Bronze-Silver tier criminals. Human and other races. Target merchant caravans and lone travelers. Common on trade routes and near cities. Combat avoidable through negotiation or intimidation by Astral+ cultivators. (3) SPIRIT BEASTS - Silver-Astral tier intelligent beasts. Rare but extremely dangerous. Territorial. Found in deep wilderness. Even Void cultivators should be cautious. (4) DEMON WARBANDS - Bronze-Void tier devils conducting raids. NEW THREAT last 5 years. Unpredictable. Always hostile. Cannot be negotiated with. Increasing frequency near Continental Gates. (5) CORRUPTED MORTALS - Bronze-Gold tier cultists and collaborators. Spread Sin corruption. Appear normal until they attack. Common near demon territories. Dangerous because unexpected. (6) NATURAL HAZARDS - Environmental dangers (storms, avalanches, quicksand, etc.). Depend on terrain. Kill Bronze-Gold cultivators regularly. Astral+ usually safe unless extreme. REGIONAL DANGER LEVELS: PRIMEREACH: - Major roads: VERY LOW (Alliance patrols, safe for mortals). - Minor roads: LOW (occasional bandits). - Wilderness: MODERATE (spirit beasts, bandits). - Near Vaelen's territory: HIGH (demon patrols, corrupted). SOLHARA: - Coastal roads: LOW (city guard patrols). - Desert caravan routes: MODERATE (natural hazards, bandits). - Northern regions (near Calderon): EXTREME (active war zone). - Southern regions (near Glut): EXTREME (consumption zone). FROSTHOLM: - Main passes: MODERATE (weather, occasional avalanche). - Mining roads: HIGH (Aurex's demon ambushes). - Deep wilderness: HIGH (harsh environment, spirit beasts). - Central mountains (near Aurex): EXTREME (demon territory). MISTMERE: - Coastal routes: MODERATE (limited infrastructure). - Interior waterways: HIGH (difficult navigation, isolated). - Western marshes (near Morvane): EXTREME (apathy zone). - Eastern marshes (near Elowen): EXTREME (paranoia zone). SCATTERED ISLES: - Major sea lanes: MODERATE (pirates, storms). - Between major islands: MODERATE (well-traveled). - Minor islands: HIGH (demon cults, isolation). - Southern islands (near Vespera): EXTREME (heavy corruption). - Northern islands (near Elowen): EXTREME (paranoia/betrayal). ENCOUNTER FREQUENCY: Safe roads (major cities): 1 encounter per 10 days travel (usually harmless). Moderate roads: 1 encounter per 3 days (mix of dangerous/harmless). Wilderness: 1-2 encounters per day (often dangerous). Near demon territory: Multiple encounters per day (usually hostile). SURVIVAL TIPS: (1) Travel in groups - Solo Bronze-Silver cultivators vulnerable. (2) Hire guards - Gold+ cultivators as caravan guards common. (3) Stick to major routes - Wilderness shortcuts often more dangerous than longer safe routes. (4) Check sect advisories - Sects post updated danger warnings. (5) Avoid demon territories - No treasure worth your life/soul. [ type(Encounter Zones); dangers(Wildlife, bandits, demons, environment); frequency(Varies by region); survival(Groups, guards, major routes); status(Increasing danger from demons); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 541,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "529": {
      "uid": 529,
      "key": [
        "sect outposts",
        "waystation",
        "cultivation stops"
      ],
      "keysecondary": [],
      "comment": "TRAVEL INFRASTRUCTURE: Sect Outposts and Waystations",
      "content": "OVERVIEW: Eight major sects maintain networks of outposts, waystations, and branch offices across their home continents and major trade routes. Provide services to traveling disciples and cultivators. TYPES OF FACILITIES: (1) MAJOR BRANCH OFFICES - Established in major cities away from sect capitals. 100-500 disciples stationed. Full cultivation facilities, training halls, libraries. Offer missions and contracts. Serve as regional headquarters. (2) WAYSTATIONS - Small fortified posts along trade routes and wilderness paths. 10-50 disciples stationed. Basic services: lodging, supplies, emergency healing. Patrol surrounding areas. Safe havens for travelers. (3) OUTPOSTS - Remote locations in dangerous areas. 5-20 disciples stationed. Military focus - monitoring threats, conducting patrols. Spartan facilities. (4) SAFE HOUSES - Hidden refuges (Veiled Mercy specialty). Unknown locations to outsiders. Emergency evacuation points and spy network hubs. SECT COVERAGE: RIGHTEOUS BLADE SECT (Sword Path, Primereach): 12 major branches, 40 waystations, 30 outposts. Focus: Law enforcement and demon hunting. Heaviest coverage in Primereach. Patrols major roads aggressively. BLAZING HEART SECT (Fire Path, Solhara): 8 major branches, 25 waystations, 50 outposts. Focus: Military presence and border security. Heavily fortified against Calderon and Glut. War footing. UNSHAKEN FOUNDATION SECT (Earth Path, Frostholm): 7 major branches, 30 waystations, 20 outposts. Focus: Mine protection and mountain pass security. Fortified against Aurex. Recently increased outpost count. IRON BODY SECT (Body Path, Frostholm): 6 major branches, 15 waystations, 35 outposts. Focus: Harsh environment training posts. Many outposts double as trials for disciples. Lighter infrastructure (ascetic philosophy). VEILED MERCY SECT (Shadow Path, Mistmere): 5 major branches, 20 waystations, 100+ safe houses. Focus: Covert network and refugee protection. Safe house locations secret. Heaviest intelligence network. TRANQUIL DEPTHS SECT (Water Path, Primereach): 10 major branches, 35 waystations, 15 outposts. Focus: Diplomatic presence and scholar exchanges. Least military, most academic facilities. SOARING FREEDOM SECT (Wind Path, Scattered Isles): 15 major branches, 50 waystations, 10 outposts. Focus: Trade facilitation and merchant protection. Sky-ship ports at all major facilities. Largest commercial network. ETERNAL DAWN SECT (Light Path, Scattered Isles): 12 major branches, 40 waystations, 5 outposts. Focus: Healing stations and pilgrim services. Medical facilities at all branches. Least military presence. SERVICES OFFERED: - Lodging (free for sect members, affordable for others). - Basic supplies and equipment. - Mission boards (contracts and bounties). - Emergency healing. - Information and maps. - Escort services (hire disciples as guards). - Cultivation resource trade. - Formation array maintenance. - Letter/message relay. CURRENT STATUS: Demon activity last 5 years has stressed all sect networks. Waystations near demon territories abandoned or reinforced. Increased patrol frequency. Many outposts requesting reinforcements. Believer sects (Righteous Blade, Veiled Mercy, Blazing Heart) on high alert. Skeptic sects still operating normally. [ type(Sect Infrastructure); facilities(Branches, waystations, outposts); services(Lodging, healing, missions, supplies); coverage(All continents); status(Stressed by demon threat); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 542,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "530": {
      "uid": 530,
      "key": [
        "teleportation arrays",
        "instant travel",
        "formation network"
      ],
      "keysecondary": [],
      "comment": "TRAVEL INFRASTRUCTURE: Teleportation Arrays (Limited)",
      "content": "OVERVIEW: Teleportation arrays exist but are extremely rare, expensive to operate, and limited in function. Not standard travel method. Reserved for emergencies and VIPs. PRE-REQUISITES FOR TELEPORTATION: (1) Paired Arrays - Requires formation array at both source and destination. Cannot teleport to unmarked location. (2) Massive Qi Cost - Single teleportation consumes qi equivalent to Astral cultivator's full reserves. Requires multiple Void+ cultivators powering array OR pre-charged qi crystals (expensive). (3) Distance Limitations - Maximum effective range approximately 1,000 km. Intercontinental teleportation theoretically possible but prohibitively expensive. (4) Passenger Limits - Most arrays transport 1-5 people maximum. Large-scale troop transport impossible. (5) Formation Maintenance - Arrays require constant maintenance by expert formation masters. EXISTING TELEPORTATION NETWORK: ORTHODOX ALLIANCE EMERGENCY NETWORK: 8 arrays (one at each sect capital). Used for: - Emergency sect master meetings. - Critical Alliance business. - Disaster response. Cost: 1,000 gold per person per teleport (funded by Alliance treasury). Heavily restricted access - sect masters and approved elders only. Usage: Average 10 teleportations per month across entire network. EBONSPIRE COMMERCIAL ARRAY: Single public teleportation array. Destination: Three paired arrays in major Primereach cities within 500km. Purpose: Wealthy merchant express travel. Cost: 5,000 gold per person. Usage: 20-30 teleportations per day. Profitable but serves tiny fraction of population. SECT PRIVATE ARRAYS: Several sects maintain 1-2 private arrays for internal use. Typically connect sect capital to important resource sites or hidden facilities. Not accessible to public or other sects. THEORETICAL INTERCONTINENTAL: Intercontinental teleportation possible in theory but requires: - Eternal realm+ cultivators powering array (multiple). - Or 100,000+ gold in qi crystals per teleport. - Perfectly maintained paired arrays at both ends. - Multiple formation masters on site. Currently no intercontinental arrays exist. Alliance has discussed building Ebonspire -> each continent hub but cost prohibitive (millions in initial construction, hundreds of thousands annual maintenance). STRATEGIC IMPLICATIONS: Teleportation arrays are strategic targets. If demons captured/corrupted arrays, could enable instant demon invasions of protected areas. Righteous Blade Sect guards all Alliance arrays heavily. Multiple contingency protocols to destroy arrays if capture imminent. PLAYER ACCESSIBILITY: Bronze-Gold cultivators: Cannot afford commercial array, wouldn't be allowed on Alliance arrays. Silver-Astral cultivators: Could use commercial array for 5,000 gold if desperate. Might gain Alliance array access for critical missions. Void+ cultivators: Might gain routine Alliance array access if high-ranking. Could possibly power arrays themselves if multiple Void cultivators cooperate. Eternal+ cultivators: Full array access, can power arrays solo. CONCLUSION: Teleportation is luxury/emergency option, not standard travel. 99.9% of travel done conventionally. Arrays exist to show magic system has teleportation but deliberately limited to prevent it trivializing geography. [ type(Teleportation Arrays); availability(Extremely limited); cost(Prohibitively expensive); range(1,000 km max practical); usage(Emergency/VIP only); status(Rare and heavily guarded); ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 543,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false
    },
    "550": {
      "uid": 550,
      "key": [
        "Primereach village",
        "Primereach town",
        "Primereach settlement",
        "travel Primereach",
        "stop in Primereach",
        "rest in Primereach"
      ],
      "keysecondary": [
        "village",
        "town",
        "settlement",
        "waypoint",
        "inn",
        "tavern"
      ],
      "comment": "REGIONAL GENERATOR: Primereach Settlements",
      "content": "PRIMEREACH SETTLEMENT GENERATOR - The Civilized Heart\n\nCLIMATE/TERRAIN: Temperate forests, fertile farmlands, winding rivers, rolling hills. Four distinct seasons. Highest population density on Sinveil.\n\nNAMING CONVENTIONS:\n- Prefixes: River-, Oak-, Gold-, East-, West-, North-, South-, Stone-, Clear-, Green-\n- Suffixes: -ford, -bridge, -watch, -market, -haven, -spire, -crossing, -hollow, -vale, -gate\n- Examples: Riverwatch, Eastford, Oakhaven, Goldbridge, Northmarket, Stonecrossing, Clearhollow, Greenvale\n\nSETTLEMENT TYPES:\n- Village (50-500): Farming communities with central well, small shrine, single inn. Governed by elected elder council.\n- Town (500-5000): Trade centers with market square, Alliance patrol station, multiple inns, craftsmen guilds. Mayor appointed by regional lord.\n- Outpost (10-100): Watchtowers, river toll stations, road checkpoints. Staffed by Alliance guards or sect disciples.\n\nARCHITECTURE:\n- Materials: Whitewashed stone, timber frames, blue-grey slate roofs\n- Style: Orderly streets, central squares, clock towers, covered markets\n- Defenses: Stone walls for towns, wooden palisades for villages, Alliance patrol towers\n\nCOMMON FEATURES:\n- Landmarks: River docks, grain mills, Alliance notice boards, Sovereign shrines\n- Services: Stables, general goods, blacksmith, healer, message courier\n- Atmosphere: Bustling trade, orderly governance, watchful Alliance presence\n\nLOCAL PROBLEMS (Roll d6):\n1. Corrupt tax collector demanding extra payments (Pride influence)\n2. Trade dispute between merchant families threatening violence\n3. Smugglers using river routes, Alliance seeking informants\n4. Missing travelers on nearby road, bandits suspected\n5. Grain shortage causing price gouging and unrest\n6. Strange dreams plaguing townsfolk, possible cult activity\n\nINN/TAVERN NAMES:\nThe Gilded Cup, The Merchant's Rest, Three Rivers Inn, The Stone Hearth, The Blue Roof, The Honest Trader, The Riverside, The Market Bell, The Traveler's Welcome, The Golden Sheaf\n\nCOMMON NPC TYPES:\n- Village Elder: Practical farmer-administrator, knows everyone, cautiously helpful to strangers\n- Innkeeper: Gossip-savvy businessperson, trades information for coin, knows local rumors\n- Guard/Militia: Alliance-trained patrol, professional but stretched thin, follows protocol\n- Local Merchant: Shrewd trader, fair prices for repeat customers, wary of cultivator trouble",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 550,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "551": {
      "uid": 551,
      "key": [
        "Solhara village",
        "Solhara town",
        "Solhara settlement",
        "travel Solhara",
        "stop in Solhara",
        "rest in Solhara",
        "oasis"
      ],
      "keysecondary": [
        "village",
        "town",
        "settlement",
        "waypoint",
        "inn",
        "tavern"
      ],
      "comment": "REGIONAL GENERATOR: Solhara Settlements",
      "content": "SOLHARA SETTLEMENT GENERATOR - The Sun-Scorched Lands\n\nCLIMATE/TERRAIN: Golden deserts, scorching heat, scattered oases, tropical coastlines, savanna grasslands. Extreme temperature swings between day and night.\n\nNAMING CONVENTIONS:\n- Prefixes: Sun-, Sand-, Drake-, Dry-, Cool-, Red-, Shade-, Oasis-, Dust-, Fire-\n- Suffixes: -well, -sands, -rest, -shade, -pyre, -scorch, -spring, -hollow, -rock, -haven\n- Examples: Sun's Anvil, Drywell, Drake's Rest, Scorchwind, Coolshade, Sandhollow, Firerock, Oasis Spring\n\nSETTLEMENT TYPES:\n- Village (50-500): Oasis communities with central well/spring, date palm groves, underground cisterns. Governed by water-keeper elder.\n- Town (500-5000): Walled trading posts with covered bazaars, caravanserai, underground market halls. Water rights determine social hierarchy.\n- Outpost (10-100): Desert watchtowers, oasis guard stations, caravan waypoints. Often half-underground for heat protection.\n\nARCHITECTURE:\n- Materials: Thick adobe and mudbrick, sandstone, palm wood\n- Style: Flat roofs for sleeping, subterranean cellars, wind-catchers for cooling, shaded courtyards\n- Defenses: High walls against sandstorms, watchtowers for Gluttony raiders, fire-drake patrol roosts\n\nCOMMON FEATURES:\n- Landmarks: Central well/oasis, covered bazaar, Blazing Heart shrine, caravan yards\n- Services: Water sellers, desert guides, heat-resistant supplies, beast handlers\n- Atmosphere: Harsh survival mentality, water precious as gold, hospitality tradition for travelers\n\nLOCAL PROBLEMS (Roll d6):\n1. Water shortage - well running low, rationing in effect\n2. Gluttony raiders spotted nearby, caravan guards needed\n3. Blazing Heart sect press-ganging young cultivators\n4. Heat sickness outbreak, healer overwhelmed\n5. Sandstorm damaged buildings, labor shortage for repairs\n6. Mysterious beast attacks on livestock, spirit beast suspected\n\nINN/TAVERN NAMES:\nThe Shaded Palm, The Cool Cellar, Cactus Flower, Oasis Rest, The Desert Rose, The Scorched Kettle, Sandman's Refuge, The Cooling Wind, The Night's Comfort, Drake's Shadow\n\nCOMMON NPC TYPES:\n- Village Elder (Water-keeper): Controls water distribution, respected authority, judges disputes over water rights\n- Innkeeper: Underground cellar operator, sells cool rooms at premium, knows caravan schedules\n- Guard/Militia: Desert-hardened, fire-resistant gear, watches for Gluttony raiders and sandstorms\n- Local Merchant: Caravan trader, deals in preserved goods and water, haggles aggressively",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 551,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "552": {
      "uid": 552,
      "key": [
        "Frostholm village",
        "Frostholm town",
        "Frostholm settlement",
        "travel Frostholm",
        "stop in Frostholm",
        "rest in Frostholm",
        "mining town"
      ],
      "keysecondary": [
        "village",
        "town",
        "settlement",
        "waypoint",
        "inn",
        "tavern"
      ],
      "comment": "REGIONAL GENERATOR: Frostholm Settlements",
      "content": "FROSTHOLM SETTLEMENT GENERATOR - The Iron North\n\nCLIMATE/TERRAIN: Rugged mountains, highland valleys, alpine forests, northern tundra. Cool year-round, harsh winters with deep snow. Rich mineral deposits.\n\nNAMING CONVENTIONS:\n- Prefixes: Iron-, Deep-, Stone-, Snow-, Frost-, Mithril-, Cold-, Grey-, Hard-, Black-\n- Suffixes: -delve, -crag, -hold, -vein, -forge, -frost, -gate, -peak, -mine, -hollow\n- Examples: Deepcrag, Mithril-Hold, Snowblind, Ironvein, Frostgate, Stoneforge, Coldhollow, Greypeak\n\nSETTLEMENT TYPES:\n- Village (50-500): Mining communities built into cliff faces, communal heating halls, shared supplies. Governed by mine foreman or clan elder.\n- Town (500-5000): Valley trade centers with forges, ore markets, guild halls. Thick walls against cold and threats. Clan councils rule.\n- Outpost (10-100): Mountain pass guardposts, mine entrance checkpoints, avalanche watch stations. Built for survival in extreme conditions.\n\nARCHITECTURE:\n- Materials: Reinforced granite, iron-bound timber, slate roofs built for snow load\n- Style: Angular, fortress-like buildings, heated floors via underground furnaces, iron-shod doors\n- Defenses: Thick walls, multiple defensive layers, chokepoint designs, avalanche barriers\n\nCOMMON FEATURES:\n- Landmarks: Central forge-hall, clan meeting house, ore processing yards, Foundation/Body sect shrines\n- Services: Smiths, miners' guild, warm lodging, mountain guides, equipment repair\n- Atmosphere: Hardy, stoic people, clan loyalties, suspicion of outsiders, respect for strength\n\nLOCAL PROBLEMS (Roll d6):\n1. Mine collapse trapped workers, rescue efforts underway\n2. Greed corruption rumors - foreman hoarding ore, refusing fair shares\n3. Avalanche blocked main pass, supplies running low\n4. Clan feud escalating over mining rights, violence imminent\n5. Supply caravan overdue, Greed cultists suspected\n6. Strange sounds from deep mine tunnels, workers refusing to descend\n\nINN/TAVERN NAMES:\nThe Hearthfire, The Miner's Pick, Warmblood Tavern, Stone & Ale, The Iron Kettle, The Frozen Hearth, Deepdelve Rest, The Forge's Glow, Mountain's Shadow, The Clan Hall\n\nCOMMON NPC TYPES:\n- Village Elder (Clan Chief): Grizzled veteran miner, protective of clan, judges by strength and loyalty\n- Innkeeper: Runs heated common room, serves warming spirits, knows which clans are feuding\n- Guard/Militia: Clan warriors, heavy armor, trained against both cold and Greed raiders\n- Local Merchant: Ore buyer or equipment supplier, hard bargainer, respects direct dealing",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 552,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "553": {
      "uid": 553,
      "key": [
        "Mistmere village",
        "Mistmere town",
        "Mistmere settlement",
        "travel Mistmere",
        "stop in Mistmere",
        "rest in Mistmere",
        "swamp village",
        "marsh town"
      ],
      "keysecondary": [
        "village",
        "town",
        "settlement",
        "waypoint",
        "inn",
        "tavern"
      ],
      "comment": "REGIONAL GENERATOR: Mistmere Settlements",
      "content": "MISTMERE SETTLEMENT GENERATOR - The Veiled Marshes\n\nCLIMATE/TERRAIN: Endless swamps, foggy marshlands, dark bogs, twisted forests. Perpetual mist, damp and gloomy year-round. Treacherous waterways.\n\nNAMING CONVENTIONS:\n- Prefixes: Frog-, Grey-, Rot-, Mist-, Still-, Murk-, Bog-, Reed-, Shadow-, Gloom-\n- Suffixes: -hollow, -water, -fen, -mire, -reed, -rot, -shade, -pool, -marsh, -bank\n- Examples: Frog-Hollow, Greywater, Rotwood, Mistfen, Stillwater, Murkpool, Bogshade, Reedbank\n\nSETTLEMENT TYPES:\n- Village (50-500): Stilt communities above swamp water, connected by rope bridges and boardwalks. Governed by hereditary marsh-warden.\n- Town (500-5000): Platform networks across multiple elevated areas, covered walkways, floating market barges. Council of marsh-wardens rules.\n- Outpost (10-100): Watchtowers on stilts, toll stations at navigable channels, Veiled Mercy safe houses. Often hidden from casual view.\n\nARCHITECTURE:\n- Materials: Treated swamp wood, woven reeds, tar-sealed surfaces\n- Style: Buildings on stilts, rope bridges between platforms, hanging lanterns for navigation, moss-covered surfaces\n- Defenses: Hidden location, confusing waterways, early warning bells, escape routes into deeper marsh\n\nCOMMON FEATURES:\n- Landmarks: Central platform with lantern tower, communal fire-pit (rare dry spot), Veiled Mercy shrine, boat moorings\n- Services: Marsh guides, waterproof supplies, medicinal herbs, boat repair\n- Atmosphere: Secretive, insular communities, suspicious of outsiders, fiercely protective of own\n\nLOCAL PROBLEMS (Roll d6):\n1. Sloth apathy spreading - villagers losing motivation, crops rotting\n2. Foundations sinking, emergency repairs needed before buildings collapse\n3. Envy feud between families, accusations and sabotage escalating\n4. Missing persons - people vanishing into deeper marsh, search parties failing\n5. Disease outbreak from stagnant water, healer overwhelmed\n6. Refugee influx from fallen village, resources strained\n\nINN/TAVERN NAMES:\nThe Lantern, Dry Plank, The Foggy Bottom, Murk & Mire, The Reed Rest, Stilthouse, The Warm Light, Marsh's Edge, The Floating Board, Shadow's Comfort\n\nCOMMON NPC TYPES:\n- Village Elder (Marsh-warden): Knows every waterway, protective of village secrets, tests strangers before trusting\n- Innkeeper: Offers dry rooms at premium, trades in information, knows refugee movements\n- Guard/Militia: Marsh-trained, silent movement, knows hidden paths, watches for Sloth/Envy corrupted\n- Local Merchant: Trades in preserved foods, medicinal herbs, waterproofing supplies, suspicious of new faces",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 553,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "554": {
      "uid": 554,
      "key": [
        "Scattered Isles village",
        "Scattered Isles town",
        "Scattered Isles settlement",
        "travel Scattered Isles",
        "stop in Scattered Isles",
        "rest in Scattered Isles",
        "island village",
        "port town"
      ],
      "keysecondary": [
        "village",
        "town",
        "settlement",
        "waypoint",
        "inn",
        "tavern"
      ],
      "comment": "REGIONAL GENERATOR: Scattered Isles Settlements",
      "content": "SCATTERED ISLES SETTLEMENT GENERATOR - The Vertical East\n\nCLIMATE/TERRAIN: Vast archipelago, dramatic cliffs, varied island climates (volcanic, jungle, cold, tropical). Strong winds, dramatic tides, vertical terrain.\n\nNAMING CONVENTIONS:\n- Prefixes: High-, Storm-, Gull's-, Tide-, Cliff-, Wind-, Salt-, Anchor-, Crow's-, Sea-\n- Suffixes: -port, -roost, -cliff, -tide, -perch, -anchor, -haven, -rock, -point, -cove\n- Examples: Highroost, Stormport, Gull's Cry, Tidebreak, Cliffside, Windperch, Saltcove, Anchor Point\n\nSETTLEMENT TYPES:\n- Village (50-500): Cliff-face communities with carved homes, rope ladder access, small fishing harbors. Governed by harbor-master or elder.\n- Town (500-5000): Port settlements with multiple docks, warehouse districts, vertical construction up cliff faces. Merchant councils rule.\n- Outpost (10-100): Lighthouse stations, cliff-top watchtowers, hidden pirate coves, sky-ship landing platforms. Often isolated and self-sufficient.\n\nARCHITECTURE:\n- Materials: Driftwood, cliff stone, salvaged ship timber, rope and canvas\n- Style: Vertical construction carved into cliffs, suspension bridges, rope ladders, terraced buildings\n- Defenses: Difficult cliff access, hidden harbors, early warning from high vantage, escape routes by sea\n\nCOMMON FEATURES:\n- Landmarks: Harbor/dock, lighthouse or signal tower, cliff-carved shrine, market terrace\n- Services: Ship repair, fishing supplies, navigation charts, messenger birds, rope and climbing gear\n- Atmosphere: Independent, freedom-loving, suspicious of authority, strong maritime traditions\n\nLOCAL PROBLEMS (Roll d6):\n1. Temptation cult recruiting young islanders with promises of power\n2. Pirates demanding 'protection' payments, threatening harbor\n3. Storm damage extensive, building materials desperately needed\n4. Falling debris from upper cliffs, structural concerns\n5. Fishing yields declining, competition between villages intensifying\n6. Isolation - supply ship overdue, rationing beginning\n\nINN/TAVERN NAMES:\nThe Sky Deck, Captain's Table, Windy Perch, The Crow's Nest, The Salt Spray, High Harbor, The Cliffside, Storm's End, The Gull's Rest, Anchor & Rope\n\nCOMMON NPC TYPES:\n- Village Elder (Harbor-master): Manages dock and fishing rights, knows ship schedules, practical and weather-wise\n- Innkeeper: Former sailor, trades in rumors from passing ships, serves seafood and strong drink\n- Guard/Militia: Cliff-trained, rope and climbing skills, watches for pirates and storms\n- Local Merchant: Ship supplier or fish trader, knows cargo values, contacts across multiple islands",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 554,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "555": {
      "uid": 555,
      "key": [
        "waystation",
        "outpost",
        "crossroads",
        "mining town",
        "refugee camp",
        "military post",
        "checkpoint",
        "resource town",
        "transit hub"
      ],
      "keysecondary": [
        "settlement type",
        "town type",
        "village type"
      ],
      "comment": "SETTLEMENT ARCHETYPES: Modifiers for Regional Generators",
      "content": "SETTLEMENT ARCHETYPE SYSTEM\n\nLayer these modifiers onto regional generators (Entries 550-554) based on route context.\n\nRESOURCE NODE - Built around mine/farm/forest/quarry\n- Atmosphere: Busy, focused, insular. Workers rise early, sleep hard. Strangers tolerated but not welcomed.\n- Services: Basic supplies, specialized resource goods (ore, timber, grain), simple lodging for workers.\n- Problems: Resource disputes, worker exhaustion, supply chain issues, exploitation by overseers.\n- NPCs: Focused on extraction - foremen, haulers, guild representatives, tired workers.\n\nTRANSIT NODE - Crossroads/bridge/waystation/trade hub\n- Atmosphere: Transient, anonymous, busy at all hours. Mix of travelers, merchants, opportunists.\n- Services: Full inn services, merchant variety, stables, message boards, information brokers.\n- Problems: Theft, crowding, wild rumors, con artists, price gouging during busy periods.\n- NPCs: Diverse travelers - merchants, pilgrims, adventurers, refugees, criminals passing through.\n\nMILITARY NODE - Fort/patrol base/checkpoint/garrison\n- Atmosphere: Strict, orderly, tense. Curfews enforced, papers checked, weapons registered.\n- Services: Limited civilian access. Military supplies, restricted lodging, official messages only.\n- Problems: Curfews, inspections, suspicion of travelers, martial law, supply requisitions.\n- NPCs: Soldiers, officers, quartermasters. Civilians are support staff - cooks, smiths, healers.\n\nCRISIS NODE - Refugee camp/disaster area/plague zone\n- Atmosphere: Desperate, overcrowded, charitable or predatory depending on leadership.\n- Services: Overwhelmed - long waits, rationed supplies, overtired healers, makeshift everything.\n- Problems: Disease, food rationing, crime from desperation, missing persons, grief.\n- NPCs: Refugees with stories, overwhelmed officials, charitable volunteers, opportunistic criminals.\n\nUSAGE: When generating a settlement, pick regional generator (Entries 550-554) + archetype modifier. Example: Frostholm (Entry 552) + Resource Node = Mining town with clan structure, heated halls, focused on ore extraction.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 555,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "556": {
      "uid": 556,
      "key": [
        "Goldbridge",
        "Eastford",
        "Riverwatch",
        "Oakhaven",
        "Clearhollow",
        "Northspire",
        "Greenvale",
        "Southport",
        "Primereach waypoint",
        "named waypoint"
      ],
      "keysecondary": [
        "Primereach travel",
        "waypoint",
        "minor settlement"
      ],
      "comment": "NAMED WAYPOINTS: Primereach Anchor Locations",
      "content": "PRIMEREACH NAMED WAYPOINTS - Anchor Locations for Travel\n\nThese pre-defined settlements provide consistent reference points for travel narration within Primereach.\n\nGOLDBRIDGE (Transit Node)\nLocation: 4 days north of Ebonspire along the North Road\nDescription: Major river crossing where the Golden River meets the North Road. Famous stone bridge with gilded railings (hence the name). Three large inns compete for merchant traffic.\nNotable: Merchant's Guild chapter house, Alliance customs checkpoint, largest horse market in northern Primereach.\nRumor Hook: Bridge tolls have tripled recently - the new toll-master is suspected of Pride corruption.\n\nEASTFORD MARKET (Transit Node)\nLocation: 3 days east of Ebonspire toward Judgment's Edge\nDescription: Sprawling market town at a shallow river ford. Hosts monthly trade fair attracting merchants from across Primereach.\nNotable: Righteous Blade Sect recruiting station, famous for blade-quality steel imports, covered market spans both riverbanks.\nRumor Hook: A merchant's daughter went missing during the last fair - the family is offering 500 gold for information.\n\nRIVERWATCH (Military Node)\nLocation: 4 days southwest of Ebonspire, on the safe route bypassing Vaelen's territory\nDescription: Fortified garrison town overlooking the confluence of three rivers. Alliance naval patrol headquarters for river traffic. Key checkpoint on the western route to the southern coast.\nNotable: Alliance officer academy, shipyard for river patrol vessels, strict curfew enforced, refugee processing from Vaelen's zone.\nRumor Hook: River pirates have been too well-informed lately - someone in the garrison may be selling patrol schedules.\n\nOAKHAVEN (Resource Node)\nLocation: 2 days west of Ebonspire toward the western forests\nDescription: Prosperous logging and woodworking town surrounded by ancient oak forests. Known for master carpenters and furniture.\nNotable: Woodworker's Guild headquarters, shrine to the Forest Spirits, lumber auction house.\nRumor Hook: Loggers are refusing to enter the deep forest - they claim the trees have started \"watching back.\"\n\nCLEARHOLLOW (Transit Node)\nLocation: 1 day from Ebonspire at the crossroads of four major roads\nDescription: Busy waystation where travelers heading in any direction spend their first night out of the capital. Never truly sleeps.\nNotable: Largest stable complex in Primereach, 24-hour message courier service, Alliance information board.\nRumor Hook: A traveling cultivator was found dead in his room last week - poison suspected, no witnesses.\n\nNORTHSPIRE (Transit Node)\nLocation: 8 days north of Ebonspire in the northern highlands\nDescription: Last major town before the northern coast. Stone-built against harsh highland winds, famous for wool trade.\nNotable: Highland Wool Exchange, watchtower with signal fires to Ebonspire, Tranquil Depths Sect waystation.\nRumor Hook: Ships from Frostholm have stopped arriving at the northern ports - storms, or something worse?\n\nGREENVALE (Resource Node)\nLocation: 6 days east of Ebonspire in the farming heartland\nDescription: Heart of Primereach's grain belt. Rolling fields of wheat and barley surround this prosperous farming town.\nNotable: Grain Exchange, Alliance granary (emergency reserves), annual Harvest Festival draws thousands.\nRumor Hook: This year's harvest is the best in decades - but farmers are uneasy. \"Soil this rich isn't natural,\" they whisper.\n\nSOUTHPORT (Transit Node / Port City)\nLocation: 10 days from Ebonspire via the southwestern route (bypasses Vaelen's territory), on the southern coast\nDescription: Primereach's primary port for intercontinental sea travel. Bustling harbor serves ships to Solhara, Mistmere, and the Scattered Isles. The safe route from Ebonspire goes southwest through Riverwatch to avoid Vaelen's domain.\nNotable: Harbor Master's Tower, Merchant Marine Guild, sky-ship dock (expensive passage to other continents), foreign quarter with traders from all five continents.\nRumor Hook: A Solharan merchant ship arrived with its entire crew dead at their posts - the cargo hold was empty but the manifest listed \"live specimens.\"\n\nUSAGE: When players travel through Primereach, reference these waypoints by name for consistency. Each location can expand into side quests using the rumor hooks provided.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 556,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "557": {
      "uid": 557,
      "key": [
        "Oasis Spring",
        "Sandhollow",
        "Drake's Rest",
        "Coolshade",
        "Dustwell",
        "Sunhaven",
        "Solhara waypoint",
        "named waypoint"
      ],
      "keysecondary": [
        "Solhara travel",
        "waypoint",
        "minor settlement"
      ],
      "comment": "NAMED WAYPOINTS: Solhara Anchor Locations",
      "content": "SOLHARA NAMED WAYPOINTS - Anchor Locations for Travel\n\nThese pre-defined settlements provide consistent reference points for travel narration within Solhara. All continents are separated by ocean - sea travel required to reach other continents.\n\nOASIS SPRING (Transit Node)\nLocation: 2 days east of Sunforge Citadel along the main caravan route\nDescription: Largest oasis in the Sunfire Desert. Natural spring feeds a small lake surrounded by date palms. Three caravanserai compete for merchant traffic.\nNotable: Blazing Heart Sect waystation, water market (prices fluctuate daily), fire-drake stables for messenger service.\nRumor Hook: The spring's flow has increased dramatically this season - the water-keepers say something is wrong with the earth below.\n\nSANDHOLLOW (Resource Node)\nLocation: 4 days south of Sunforge Citadel in the central desert\nDescription: Mining settlement built around fire crystal deposits. Half the town is underground to escape the heat. Known for high-quality cultivation crystals.\nNotable: Fire Crystal Exchange, underground cultivation chambers naturally heated by crystal deposits, Blazing Heart prospector office.\nRumor Hook: A mining team broke into an ancient sealed chamber last week - they won't talk about what they found, but three of them have quit.\n\nDRAKE'S REST (Military Node)\nLocation: 5 days north of Sunforge Citadel, last safe settlement before the Burning Wastes\nDescription: Fortified garrison town serving as the southern defense line against Calderon's Wrath Legion. Constant military presence.\nNotable: Blazing Heart forward command, refugee processing center, fire-drake breeding grounds, military supply depot.\nRumor Hook: A Wrath warband was spotted closer than ever before - and they retreated without attacking. The commanders are worried about what they're planning.\n\nCOOLSHADE (Transit Node)\nLocation: 3 days inland from Goldport on the savanna trade route\nDescription: Prosperous town built in the shadow of a massive rock formation that provides afternoon shade. Famous for its cool evening markets.\nNotable: Goldplain Merchant Guild chapter, exotic beast auction (fire-drakes, sand serpents), largest date wine production in Solhara.\nRumor Hook: A merchant caravan from the north arrived with gold coins that burn anyone who touches them - Wrath-cursed currency spreading south.\n\nDUSTWELL (Resource Node)\nLocation: 5 days west of Sunforge Citadel near the western coast\nDescription: Agricultural town in a rare fertile valley. Grows most of Solhara's grain and vegetables using ancient irrigation techniques.\nNotable: Granary complex (strategic food reserve), water engineer guild, terrace farming visible for miles.\nRumor Hook: The irrigation channels are running red - not blood, but some kind of mineral runoff. The crops taste strange this harvest.\n\nSUNHAVEN (Transit Node / Port Town)\nLocation: On Solhara's eastern coast, 4 days from Goldport by coastal road\nDescription: Secondary port serving eastern shipping lanes. Smaller than Goldport but less crowded and with lower tariffs.\nNotable: Dragonkin shipwright district (famous for heat-resistant vessel designs), tropical fruit export market, passenger ferries to Scattered Isles.\nRumor Hook: A ship arrived from the Scattered Isles with every crew member aged fifty years overnight - they babble about 'mirrors in the mist.'\n\nUSAGE: When players travel through Solhara, reference these waypoints by name for consistency. Each location can expand into side quests using the rumor hooks provided. Note: Northern routes toward Calderon's territory and far southern routes toward Glut's territory are extremely dangerous.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 557,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "558": {
      "uid": 558,
      "key": [
        "Deepcrag",
        "Frostgate",
        "Stoneforge",
        "Coldhollow",
        "Greypeak",
        "Snowharbor",
        "Frostholm waypoint",
        "named waypoint"
      ],
      "keysecondary": [
        "Frostholm travel",
        "waypoint",
        "minor settlement"
      ],
      "comment": "NAMED WAYPOINTS: Frostholm Anchor Locations",
      "content": "FROSTHOLM NAMED WAYPOINTS - Anchor Locations for Travel\n\nThese pre-defined settlements provide consistent reference points for travel narration within Frostholm. All continents are separated by ocean - sea travel required to reach other continents.\n\nDEEPCRAG (Resource Node)\nLocation: 2 days southeast of Ironforge along the main mining road\nDescription: Major iron mining town built into a cliff face. Three generations of tunnels extend deep into the mountain. Known for high-quality raw ore.\nNotable: Miners' Guild local chapter, underground ore market, Unshaken Foundation waystation, heated communal halls.\nRumor Hook: The deepest tunnel was sealed last month after miners heard voices offering them 'true wealth' - Greed cultists may have already infiltrated.\n\nFROSTGATE (Military Node)\nLocation: 3 days north of Ironpeak Citadel, guarding the main northern pass\nDescription: Fortress town controlling access through the Skyreach Mountains. Heavy Unshaken Foundation presence. Every traveler is inspected.\nNotable: Mountain Pass Authority (travel permits required), emergency shelter network, avalanche warning system, clan warrior barracks.\nRumor Hook: A Foundation patrol hasn't reported in for two weeks - their last message mentioned finding a 'golden door' in the mountainside.\n\nSTONEFORGE (Resource Node)\nLocation: 4 days west of Ironforge in the central highlands\nDescription: Renowned smithing town where legendary weapons are made. Multiple master forges compete for contracts with the sects.\nNotable: Master Smiths' Conclave, rare metal auction house, Iron Body Sect training outpost, weapon testing grounds.\nRumor Hook: A master smith produced a blade of unprecedented quality last week - then smashed it and fled town. He was seen muttering about 'her whispers in the metal.'\n\nCOLDHOLLOW (Transit Node)\nLocation: 5 days southwest of Ironforge, crossroads of three major trade routes\nDescription: Trading hub where mountain ore meets lowland goods. Busy year-round despite harsh winters. Largest population of mixed races in Frostholm.\nNotable: Tri-Clan Market (neutral trading ground), warm springs bath house, caravan staging area, message relay station.\nRumor Hook: Three different caravans have reported being followed by the same figure in gold-trimmed robes - but no one can agree on what race or gender they were.\n\nGREYPEAK (Resource Node)\nLocation: 6 days east of Ironpeak Citadel, high in the eastern mountains\nDescription: Mithril mining settlement at extreme altitude. Harsh conditions but incredibly valuable ore. Only the toughest miners work here.\nNotable: Mithril Exchange (heavily guarded), altitude sickness healer station, Foundation emergency shelter, clan hall of the Greypeak Delvers.\nRumor Hook: Mithril production has increased dramatically, but so have mining accidents - the foreman insists the quotas are reasonable, but workers whisper about 'the Lady's influence.'\n\nSNOWHARBOR (Transit Node / Port Town)\nLocation: On Frostholm's southern coast, 1 week from Ironforge by mountain road\nDescription: Frostholm's primary port, built where the mountains meet the sea. Cold waters but ice-free year-round due to warm currents.\nNotable: Dwarven Shipwright Guild (ice-breaking vessel designs), metal export docks, passenger ships to Primereach and Scattered Isles, foreign merchant quarter.\nRumor Hook: Ships from Primereach have started arriving with fewer passengers than their manifests claim - the harbor master suspects something is taking people during the voyage.\n\nUSAGE: When players travel through Frostholm, reference these waypoints by name for consistency. Each location can expand into side quests using the rumor hooks provided. Note: Routes toward Lady Aurex's territory in the central mountains are extremely dangerous - multiple mining towns have gone silent.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 558,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "559": {
      "uid": 559,
      "key": [
        "Stillwater",
        "Bogshade",
        "Reedbank",
        "Greyfen",
        "Murkhollow",
        "Mistport waypoint",
        "Mistmere waypoint",
        "named waypoint"
      ],
      "keysecondary": [
        "Mistmere travel",
        "waypoint",
        "minor settlement"
      ],
      "comment": "NAMED WAYPOINTS: Mistmere Anchor Locations",
      "content": "MISTMERE NAMED WAYPOINTS - Anchor Locations for Travel\n\nThese pre-defined settlements provide consistent reference points for travel narration within Mistmere. All continents are separated by ocean - sea travel required to reach other continents. WARNING: Mistmere is extremely dangerous - Morvane (Sloth) controls the west, Elowen (Envy) controls the east. Only the central corridor and coast remain relatively safe.\n\nSTILLWATER (Transit Node)\nLocation: 2 days by boat from Mistport along the main inland waterway\nDescription: Largest inland settlement still under orthodox protection. Built on interconnected platforms across three ancient cypress trees. Major refugee waystation.\nNotable: Veiled Mercy checkpoint, refugee processing station, healer's platform (overwhelmed), lantern-lit market for essentials only.\nRumor Hook: A group of refugees from the west arrived last week - they haven't spoken since, just stare at nothing. The healers say they're not injured, just... empty.\n\nBOGSHADE (Resource Node)\nLocation: 4 days south of Stillwater in the central marshes\nDescription: Alchemical harvesting community known for rare medicinal herbs. Isolated but valuable enough to protect. Half the population are Veiled Mercy operatives.\nNotable: Herb drying platforms, poison-master's workshop, hidden evacuation routes, alarm bells on every platform.\nRumor Hook: The master herbalist has been working on something in secret - an antidote, she claims, but antidote to what? She won't say, but she's stopped sleeping.\n\nREEDBANK (Military Node)\nLocation: 3 days west of Mistport, marking the edge of safe territory\nDescription: Fortified watchtower settlement - the front line against Morvane's expanding apathy zone. Veiled Mercy maintains constant vigil here.\nNotable: Shadow-warded perimeter, morale officer station (critical for Sloth resistance), refugee warning posts, signal fire network.\nRumor Hook: A patrol returned yesterday having forgotten why they left. They can't remember the last week. They were only gone for two days.\n\nGREYFEN (Transit Node)\nLocation: 5 days inland from Mistport via the eastern waterways\nDescription: Trading settlement serving the eastern marsh communities. Tense atmosphere as Elowen's influence creeps closer each month.\nNotable: Boat repair platforms, preserved food market, message relay station, Veiled Mercy safe house (location changes weekly).\nRumor Hook: Two families who were best friends for generations are now feuding viciously - over a fishing net. The arguments started three weeks ago when a strange mirror washed up on shore.\n\nMURKHOLLOW (Crisis Node)\nLocation: 6 days north of Mistport, deep in the interior\nDescription: Former trading town now converted to refugee camp. Thousands of displaced marsh-dwellers crowd platforms never meant for this many people.\nNotable: Veiled Mercy relief coordination, emergency food distribution, overwhelmed healers, temporary platforms sinking under the weight.\nRumor Hook: A child in the refugee camp has been drawing pictures - always the same image: a woman made of mirrors, pointing at specific people. Those people vanish within a day.\n\nNOTE ON SHADOWHAVEN: The Veiled Mercy Sect capital's location is secret. If players need to reach it, a Veiled Mercy guide must be obtained - usually through Mistport or by proving themselves to the sect.\n\nUSAGE: When players travel through Mistmere, reference these waypoints by name for consistency. Travel is ALWAYS by boat - there are no roads. Each location can expand into side quests using the rumor hooks provided. Emphasize the constant threat and refugee crisis throughout Mistmere.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 559,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "560": {
      "uid": 560,
      "key": [
        "Highroost",
        "Saltcove",
        "Windperch",
        "Tidebreak",
        "Cliffside",
        "Anchorpoint",
        "Scattered Isles waypoint",
        "named waypoint"
      ],
      "keysecondary": [
        "Scattered Isles travel",
        "waypoint",
        "minor settlement"
      ],
      "comment": "NAMED WAYPOINTS: Scattered Isles Anchor Locations",
      "content": "SCATTERED ISLES NAMED WAYPOINTS - Anchor Locations for Travel\n\nThese pre-defined settlements provide consistent reference points for travel narration within the Scattered Isles. The five major islands are Stormcrown (largest, temperate), Emberpeak (volcanic), Mistfall (jungle), Frostshore (cold northern), and Dawnhaven (tropical, south). WARNING: Southern islands near Dawnhaven are Vespera's (Temptation) territory; northern islands near Frostshore have Elowen's (Envy) influence.\n\nHIGHROOST (Transit Node)\nLocation: Stormcrown Island, 1 day's sail north of Stormhaven along cliff coast\nDescription: Vertical cliff-face town famous for harpy population and messenger bird services. Fastest communication network in the Isles.\nNotable: Harpy Messenger Guild headquarters, cliff-carved market terraces, Soaring Freedom Sect waystation, sky-ship emergency landing platform.\nRumor Hook: The messenger birds have been returning with strange black feathers mixed in with their own - and the messages they carry sometimes have extra words no one wrote.\n\nSALTCOVE (Resource Node)\nLocation: Small island between Stormcrown and Emberpeak, 2 days from Stormhaven\nDescription: Fishing and salt-harvesting community built around a sheltered natural cove. Known for preserved fish that keeps for months.\nNotable: Salt extraction pools, smoking houses, fishing fleet moorings, seasonal worker housing (crowded during harvest).\nRumor Hook: Fishermen are hauling up catches that should have died years ago - fish with old hooks still in their mouths, some with wounds that should have killed them. They're still alive.\n\nWINDPERCH (Military Node)\nLocation: Emberpeak Island, cliff fortress overlooking the main shipping lane\nDescription: Soaring Freedom Sect observation post monitoring traffic through the central islands. Watches for pirates and suspicious vessels.\nNotable: Signal fire tower (visible for 50km), wind formation arrays for long-range detection, naval patrol dock, sky-ship hangar.\nRumor Hook: Three ships were flagged for inspection last week - all three had the same passenger manifest with the same names, but different faces. The captains claim to have never met.\n\nTIDEBREAK (Transit Node)\nLocation: Mistfall Island, major harbor on the jungle coast\nDescription: Trading port where jungle goods meet the shipping lanes. Hot, humid, and crowded with merchants from every island.\nNotable: Exotic goods market (rare plants, beast parts, cultivation herbs), jungle guide services, Eternal Dawn Sect healing station.\nRumor Hook: A merchant selling 'dream pearls' from the deep jungle has become extremely popular - customers report vivid, wonderful dreams. But some have stopped waking up.\n\nCLIFFSIDE (Transit Node)\nLocation: Frostshore Island, 3 days north of Stormhaven (approach with caution - Elowen's territory expanding)\nDescription: Cold-water port serving the northern fishing communities. Increasingly tense as reports of strange behavior spread from nearby islands.\nNotable: Cold-weather supply depot, ice fishing fleet, refugee boats arriving weekly from smaller northern islands.\nRumor Hook: Refugees say their neighbors started fighting over nothing - who had the better boat, whose children were smarter. Then the mirrors appeared, and people started killing each other to 'prove' they were the best.\n\nANCHORPOINT (Transit Node / Warning Post)\nLocation: Small island 2 days north of Dawnhaven, marking the edge of 'safe' territory\nDescription: Last orthodox-controlled settlement before Vespera's territory. Eternal Dawn Sect maintains strong presence here, warning travelers.\nNotable: Eternal Dawn checkpoint, corruption detection wards (not always effective), supply depot for those going south, message station for those who don't return.\nRumor Hook: A disciple went south to 'investigate' three months ago. She returned last week, said everything was fine, and tried to recruit others to join her. The healers say she's not corrupted... but she smiles too much now.\n\nISLAND TRAVEL NOTE: All travel between islands is by ship or sky-ship. Travel times between major islands average 1-3 days by conventional vessel. Sky-ships halve the time but cost 10x as much.\n\nUSAGE: When players travel through the Scattered Isles, reference these waypoints by name for consistency. Each location can expand into side quests using the rumor hooks provided. Emphasize the maritime culture and the subtle spread of Temptation corruption from the south.",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 560,
      "position": 4,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "561": {
      "uid": 561,
      "key": [
        "Silverflow Gate",
        "Riverfork Metropolis",
        "Primereach riverport",
        "Western Primereach hub"
      ],
      "keysecondary": [],
      "comment": "Silverflow Gate - Primereach River Metropolis",
      "content": "LOCATION: Western Primereach, built where the Silverflow and Ironflow rivers meet, 2 days west of Ebonspire on the barge lines. Massive twin-harbor city handling most inland freight to the capital. POPULATION: 900,000 permanent; swells past 1.1 million during harvest and military mobilizations. ECONOMY: River logistics, grain and ore transshipment, barge-building, customs clearing, banking. Largest bonded warehouse district outside Ebonspire. GOVERNANCE: Merchant Syndicate with an Alliance-appointed Harbor Marshal; Righteous Blade maintains a judiciary enclave. THREAT LEVEL: HIGH - Pride corruption risk via Ebonspire spillover; smuggling routes exploited by Envy/Greed cults; occasional river pirate incursions. DEFENSES: Triple floodwalls with formation gates, river boom chains, harbor ballista towers, 12,000 city guard, 600 Righteous Blade disciples, pride-dampening checkpoints at customs. NOTABLE LOCATIONS: Twin Harbors (north freight, south passenger), Floodwall Market (24/7 trade), Gilded Ledger Bank Row, Riverlock Arsenal (harbor defense arrays), Embassies Terrace. TRAVEL TIMES: 2 days by barge to Ebonspire; 3 days upriver to Ironforge routes (via overland relay); 45 days to southern coast via river chain. [ location(Western Primereach river fork); population(900k+); type(Metropolis/Trade Hub); threat(Pride spillover + cult smuggling); status(High alert but thriving); importance(Primary river logistics node) ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 561,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "562": {
      "uid": 562,
      "key": [
        "Highfield Granaries",
        "Harvestwheel",
        "Primereach grain capital",
        "Eastern Primereach hub"
      ],
      "keysecondary": [],
      "comment": "Highfield Granaries - Primereach Agricultural Capital",
      "content": "LOCATION: Central-eastern Primereach grain belt, 5 days east of Ebonspire along the Harvest Road. Surrounded by terraced golden fields and massive granary complexes feeding the Alliance. POPULATION: 650,000 (peaks to 800,000 during harvest). ECONOMY: Grain aggregation, milling, food preservation, beast fodder trade, array-stabilized storage, logistics hiring. GOVERNANCE: Council of Grain Factors under Alliance Grain Authority oversight; Tranquil Depths mediators settle contract disputes. THREAT LEVEL: MEDIUM-HIGH - Pride/Greed influence via price manipulation; banditry increases when harvest caravans move; food-riot risk during shortages. DEFENSES: Ringed granary walls with humidity wards, mounted grain-guard cavalry (8,000), volunteer militias, 400 Tranquil Depths arbiters for rapid mediation, contract-sealing formations to deter fraud. NOTABLE LOCATIONS: Great Harvest Exchange, Thousand-Silo District, Beast Team Yards, Contract Hall (formation-sealed deals), Sky Granary Tower (airlift loading). TRAVEL TIMES: 5 days to Ebonspire; 3 days to Greenvale; 67 days to Southport port route. [ location(Eastern Primereach grain belt); population(650k); type(Agricultural City/Logistics Hub); threat(Greed/Pride market manipulation + caravan bandits); status(Stable, heavily guarded during harvest); importance(Alliance food artery) ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 562,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "563": {
      "uid": 563,
      "key": [
        "Saffron Delta Freeport",
        "Solhara delta city",
        "Eastern Solhara port",
        "Spice Free City"
      ],
      "keysecondary": [],
      "comment": "Saffron Delta Freeport - Eastern Solhara Maritime Capital",
      "content": "LOCATION: Broad river delta on Solhara's southeast coast, 3 days by sea east of Goldport and closer to Scattered Isles lanes. Natural deepwater berths and wide canals allow simultaneous ocean and river traffic. POPULATION: 700,000 (surges with spice fleets). ECONOMY: Spices, silk, jade dust, fire crystal export staging, sky-ship service yard, bonded free-trade zone with minimal tariffs. Black-market luxuries thrive under lax rules. GOVERNANCE: Free City Charter ruled by Five Guild Princes; Blazing Heart maintains a consular garrison but lacks legal authority inside free zone. THREAT LEVEL: HIGH - Wrath privateers raid convoys; Temptation/Greed cults launder wealth; Gluttony scavengers lurk far south; internal crime syndicates entrenched. DEFENSES: Harbor chain arrays, fire-beacon towers, 9,000 hired marines, Blazing Heart consul-guard (500 disciples) restricted to consul district, sky-ship watchtower network. NOTABLE LOCATIONS: Guild Princes' Court, Saffron Spire Market, Free Docks (tariff-free), Sky-Lift Yard, Red Lantern Ward (vice district). TRAVEL TIMES: 3 days by sea from Goldport; 46 days to Scattered Isles by standard ship (half by sky-ship); 78 days upriver into interior caravan routes. [ location(Southeast Solhara delta); population(700k); type(Freeport/Trade City); threat(Privateers + cult finance + organized crime); status(Prosperous but volatile); importance(Second Solharan port + spice corridor) ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 563,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "564": {
      "uid": 564,
      "key": [
        "Ashbridge Oasis",
        "Caravan Crown",
        "Central Solhara city",
        "Desert logistics hub"
      ],
      "keysecondary": [],
      "comment": "Ashbridge Oasis - Central Solhara Caravan City",
      "content": "LOCATION: Central Sunfire Desert at the only stable stone bridge over the Ashflow Chasm, 2 days north of Oasis Spring and 34 days south of Sunforge Citadel. Built around a massive tiered oasis lake and permanent caravanserai rings. POPULATION: 520,000 (plus 150,000 transients during peak convoys). ECONOMY: Water rights market, caravan outfitting, beast trade, fire crystal brokerage, desert guide guilds, repair yards for drake-drawn wagons. GOVERNANCE: Council of Watermasters with Blazing Heart Warden oversight for security; emergency powers when Wrath warbands approach. THREAT LEVEL: HIGH - Calderon warband probes from the Burning Wastes; drought sabotage attempts; sandstorm hazards; bandit-khans occasionally unite. DEFENSES: Concentric wall-rings with heat-dispersal arrays, collapsible bridge killzone, reservoir bunkers, 7,500 city guard, 900 Blazing Heart wardens, fire-drake aerial patrols. NOTABLE LOCATIONS: Bridge Market Ring, Water Auction Hall, Drake Stables, Ashflow Watchtower, Pilgrim Caves (cool caverns under the oasis). TRAVEL TIMES: 2 days to Oasis Spring; 34 days to Sunforge Citadel; 45 days to Coolshade; 67 days to Goldport by desert road. [ location(Central Solhara desert); population(520k+); type(Caravan City/Oasis Fortress); threat(Wrath warbands + drought sabotage); status(Armed but essential); importance(Key bridge and water node for northsouth caravans) ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 564,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "565": {
      "uid": 565,
      "key": [
        "Greywater Confluence",
        "Mistmere river hub",
        "Central Mistmere city",
        "Refuge flotilla city"
      ],
      "keysecondary": [],
      "comment": "Greywater Confluence - Mistmere River Metropolis",
      "content": "LOCATION: Central Mistmere where three major waterways merge into the main eastbound channel toward Mistport. Built on massive stone pylons and interlinked barges forming floating districts. POPULATION: 450,000 residents; refugee influx can push past 600,000. ECONOMY: River trade aggregation, alchemical herb auctions, barge-building, medical services for refugees, shadow-light talisman crafting. GOVERNANCE: Veiled Mercy stewards with a rotating civilian council; strict curfews when apathy mists rise. THREAT LEVEL: EXTREME - Between Morvane's apathy to the west and Elowen's envy to the east; cult sleepers and mirror artifacts frequently intercepted; panic risk from refugee surges. DEFENSES: Shadow-veiled perimeter, mirror-free policy, signal lantern network, 5,000 city guard, 1,200 Veiled Mercy disciples, rapid-evac boat corridors to hidden channels. NOTABLE LOCATIONS: Confluence Grand Dock, Herb Auction Spires, Refugee Tier (floating shelters), Lantern Ward (talisman workshops), Silent Hall Annex (trauma care). TRAVEL TIMES: 23 days by boat to Mistport; 2 days to Stillwater; 45 days to Reedbank line (western front); 45 days to Greyfen line (eastern front). [ location(Central Mistmere waterways); population(450k+); type(Floating Metropolis/Refuge Hub); threat(Apathy + Envy fronts; refugee volatility); status(High strain, heavily warded); importance(Primary consolidation point before reaching Mistport) ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 565,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    },
    "566": {
      "uid": 566,
      "key": [
        "Lanternreach",
        "Northern Mistmere port",
        "Shorelight City",
        "Lightward Haven"
      ],
      "keysecondary": [],
      "comment": "Lanternreach - Northern Mistmere Shore City",
      "content": "LOCATION: Northern Mistmere coastline on a rare firm shore ridge, 2 days by boat north of Mistport along the safer coastal channel. Acts as a staging city for evacuations and supply lines heading inland. POPULATION: 380,000 residents; plus 100,000 transients (refugees, relief crews). ECONOMY: Coastal trade, salted fish, boat repair, purification ward production, relief logistics, light-path shrine tourism. GOVERNANCE: Joint council between coastal guilds and Eternal Dawn/Veiled Mercy representatives; emergency powers activate when Envy mists approach from the northeast. THREAT LEVEL: HIGH - Envy mirror spores ride sea fogs; Pride smugglers attempt to bypass Mistport screening; refugee unrest common. DEFENSES: Shoreline lightward pylons, mirror bans, rotating patrol boats, 4,500 city guard, 700 Eternal Dawn purifiers, 600 Veiled Mercy operatives; beacon network to warn Mistport and Stillwater. NOTABLE LOCATIONS: Beacon Promenade (continuous light wards), Salt Wharf, Dawnkeep Shrine (mass purification), Refuge Quarter, Shipwright's Row. TRAVEL TIMES: 2 days to Mistport by coastal boat; 34 days to Stillwater via inner channels; 56 days to Greywater Confluence upriver. [ location(Northern Mistmere coast); population(380k+); type(Coastal City/Relief Hub); threat(Envy fog + smuggling + unrest); status(Guarded, strained by evac flows); importance(Key coastal buffer feeding Mistport corridor) ]",
      "constant": false,
      "selective": false,
      "selectiveLogic": 0,
      "addMemo": true,
      "order": 566,
      "position": 2,
      "disable": false,
      "probability": 100,
      "useProbability": true,
      "depth": 4,
      "vectorized": false,
      "ignoreBudget": false,
      "excludeRecursion": false,
      "preventRecursion": false
    }
  }
}
